{
    "236": {
        "CIK": "0000021344",
        "Company Name": "COCA COLA CO",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "During times of crisis, business continuity and adapting to the needs of our customers are critical. We have developed systemwide knowledge-sharing routines and processes, which include the management of any supply chain challenges. As of the date of this filing, there has been no material impact, and we do not foresee a material impact, on our and our bottling partners' ability to manufacture or distribute our products. We are moving with speed to best serve our customers impacted by COVID-19. In partnership with our bottlers and retail customers, we are working to ensure adequate inventory levels in key channels while prioritizing core brands, key packages and consumer affordability. We are increasing investments in                  e-commerce to support retailer and meal delivery services, shifting toward package sizes that are fit-for-purpose for online sales, and shifting more consumer and trade promotions to digital.",
        "after": "Although we are experiencing a time of crisis, we are not losing sight of long-term opportunities for our business. The pandemic helped us realize we could be much bolder in our efforts to change. We believe that we will come out of this situation a better and stronger company. We identified the following key objectives to navigate the pandemic and position us to emerge stronger: winning more consumers; gaining market share; maintaining strong system economics; strengthening stakeholder impact; and equipping the organization to win. We leveraged the crisis as a catalyst to accelerate our strategy and to begin to deliver against these objectives by focusing on the following priorities: optimizing our portfolio of strong global, regional and scaled local brands; establishing a disciplined innovation framework; increasing consumer-centric marketing effectiveness and efficiency; strengthening data-driven revenue growth management and execution capabilities; enhancing system collaboration and capturing supply chain efficiencies; and evolving our organization and investing in new capabilities to support the accelerated strategy. In August 2020, the Company announced strategic steps to transform our organizational structure to better enable us to capture growth in the fast-changing marketplace. The Company is building a networked global organization designed to combine the power of scale with the deep knowledge required to win locally. Refer to Note 18 of Notes to Consolidated Financial Statements for additional information about our strategic realignment initiatives."
    },
    "254": {
        "CIK": "0000021344",
        "Company Name": "COCA COLA CO",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "before": "During times of crisis, business continuity and adapting to the needs of our customers are critical. We have developed systemwide knowledge-sharing routines and processes, which include the management of any supply chain challenges. As of the date of this filing, there has been no material impact, and we do not foresee a material impact, on our and our bottling partners' ability to manufacture or distribute our products. We are moving with speed to best serve our customers impacted by COVID-19. In partnership with our bottlers and retail customers, we are working to ensure adequate inventory levels in key channels while prioritizing core brands, key packages and consumer affordability. We are increasing investments in                  e-commerce to support retailer and meal delivery services, shifting toward package sizes that are fit-for-purpose for online sales, and shifting more consumer and trade promotions to digital.",
        "match": "Although we are experiencing a time of crisis, we are not losing sight of long-term opportunities for our business. The pandemic helped us realize we could be much bolder in our efforts to change. We believe that we will come out of this situation a better and stronger company. We identified the following key objectives to navigate the pandemic and position us to emerge stronger: winning more consumers; gaining market share; maintaining strong system economics; strengthening stakeholder impact; and equipping the organization to win. We leveraged the crisis as a catalyst to accelerate our strategy and to begin to deliver against these objectives by focusing on the following priorities: optimizing our portfolio of strong global, regional and scaled local brands; establishing a disciplined innovation framework; increasing consumer-centric marketing effectiveness and efficiency; strengthening data-driven revenue growth management and execution capabilities; enhancing system collaboration and capturing supply chain efficiencies; and evolving our organization and investing in new capabilities to support the accelerated strategy. In August 2020, the Company announced strategic steps to transform our organizational structure to better enable us to capture growth in the fast-changing marketplace. The Company is building a networked global organization designed to combine the power of scale with the deep knowledge required to win locally. Refer to Note 18 of Notes to Consolidated Financial Statements for additional information about our strategic realignment initiatives."
    },
    "318": {
        "CIK": "0000024491",
        "Company Name": "COOPER TIRE & RUBBER CO",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "COVID-19 negatively impacted the Company's business in 2020 and also presented potential new risks to it. The Company began to see the impacts of COVID-19 on its Asian operations early in the first quarter, and in customer demand in late March in the Americas and Europe, which continued into the second quarter of 2020. The situation surrounding COVID-19 remains fluid and the potential for a continued material impact on the Company increases the longer the virus impacts the level of economic activity in the United States and globally. In the future, the COVID-19 pandemic may cause additional reduced demand for the Company's products, including if it results in a recessionary global economic environment. It could also lead to volatility in consumer demand for or access to Company products, including due to government actions impacting the ability to produce and ship products or impacting consumers’ movements and access to the Company's products. The Company believes that over the long term, there will continue to be strong demand for the Company's products. However, the timing and extent of demand recovery in specific markets, the resumption of travel, and product demand trends caused by future economic trends are unclear. Accordingly, there may be heightened volatility in net sales and earnings during and subsequent to the duration of the COVID-19 pandemic. The Company's customers are also being impacted by the pandemic. The success of customers in addressing the issues and maintaining their operations, including their ability to remit timely payment, could impact consumer access to, and as a result, sales of the Company's products. In addition, the COVID-19 pandemic and the Company's and government responses to it have disrupted the Company's operations, and increased its costs, and may continue to do so.",
        "after": "The Company's ability to continue to operate and to mitigate the negative impacts of the pandemic will in part depend on the ability to protect its employees and supply chain. The Company has endeavored to follow recommended actions of government and health authorities to protect employees world-wide, with particular measures in place for those working in the Company's plants and distribution facilities. The Company intends to continue to work with government authorities and implement employee safety measures to ensure that it is able to continue manufacturing and distributing products during the COVID-19 pandemic. However, uncertainty resulting from the pandemic could result in an unforeseen disruption that could impact the results of operations. For additional information on risk factors that could impact the Company's results, refer to “Risk Factors” in Part I, Item 1A of this Form 10-K."
    },
    "333": {
        "CIK": "0000024491",
        "Company Name": "COOPER TIRE & RUBBER CO",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "COVID-19 negatively impacted the Company's business in 2020 and also presented potential new risks to it. The Company began to see the impacts of COVID-19 on its Asian operations early in the first quarter, and in customer demand in late March in the Americas and Europe, which continued into the second quarter of 2020. The situation surrounding COVID-19 remains fluid and the potential for a continued material impact on the Company increases the longer the virus impacts the level of economic activity in the United States and globally. In the future, the COVID-19 pandemic may cause additional reduced demand for the Company's products, including if it results in a recessionary global economic environment. It could also lead to volatility in consumer demand for or access to Company products, including due to government actions impacting the ability to produce and ship products or impacting consumers’ movements and access to the Company's products. The Company believes that over the long term, there will continue to be strong demand for the Company's products. However, the timing and extent of demand recovery in specific markets, the resumption of travel, and product demand trends caused by future economic trends are unclear. Accordingly, there may be heightened volatility in net sales and earnings during and subsequent to the duration of the COVID-19 pandemic. The Company's customers are also being impacted by the pandemic. The success of customers in addressing the issues and maintaining their operations, including their ability to remit timely payment, could impact consumer access to, and as a result, sales of the Company's products. In addition, the COVID-19 pandemic and the Company's and government responses to it have disrupted the Company's operations, and increased its costs, and may continue to do so.",
        "after": "The Company's ability to continue to operate and to mitigate the negative impacts of the pandemic will in part depend on the ability to protect its employees and supply chain. The Company has endeavored to follow recommended actions of government and health authorities to protect employees world-wide, with particular measures in place for those working in the Company's plants and distribution facilities. The Company intends to continue to work with government authorities and implement employee safety measures to ensure that it is able to continue manufacturing and distributing products during the COVID-19 pandemic. However, uncertainty resulting from the pandemic could result in an unforeseen disruption that could impact the results of operations. For additional information on risk factors that could impact the Company's results, refer to “Risk Factors” in Part I, Item 1A of this Form 10-K."
    },
    "354": {
        "CIK": "0000026172",
        "Company Name": "CUMMINS INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "COVID-19 vaccines are currently being administered around the world with the hope that the majority of the population will have access to the vaccine by the middle of 2021. If the distribution and the effectiveness of the vaccine are consistent with current government and health organization estimates, we anticipate the vaccine will mitigate the spread of the virus by the end of 2021 and allow a return to more normal operations in the second half of the year.",
        "after": "While the impacts of the pandemic and the resulting global recession are expected to be temporary, the duration of the production and supply chain disruptions, and related financial impacts, cannot be estimated at this time. Should the reduced manufacturing and distribution capacities continue for an extended period of time or worsen, the impact on our production and supply chain could have a material adverse effect on our results of operations, financial condition and cash flows. Our Board of Directors (the Board) continues to monitor and evaluate all of these factors along with the continuing impacts of the COVID-19 pandemic on our business and operations."
    },
    "455": {
        "CIK": "0000033002",
        "Company Name": "ENNIS, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "before": "Our industry is currently experiencing consolidation of traditional supply channels, product obsolescence, paper supplier capacity adjustments, and increased pricing and potential supply allocations due to demand/supply curve imbalance.  Technology advances have made electronic distribution of documents, internet hosting, digital printing and print-on-demand valid, cost-effective alternatives to traditional custom-printed documents and customer communications.  Improved equipment has become more accessible to our competitors due to the continued low interest rate environment.  We face highly competitive conditions throughout our supply chain in an already over-supplied, price-competitive print industry.  In addition to the risk factors discussed under the caption “Risk Factors” in Item 1A of this Annual Report, some of the key challenges of our business include the following:",
        "match": "–  The global spread of the novel strain of COVID-19 has significantly impacted health and economic conditions throughout the United States and the world, including the markets in which we operate.  In "
    },
    "618": {
        "CIK": "0000059478",
        "Company Name": "ELI LILLY AND COMPANY",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "before": "In regards to COVID-19 therapies, the U.S. Food and Drug Administration (FDA) granted Emergency Use Authorizations (EUA) for bamlanivimab and bamlanivimab and etesevimab administered together for higher-risk patients who have been recently diagnosed with mild-to-moderate COVID-19 and for baricitinib in combination with remdesivir in hospitalized COVID-19 patients. We are actively working with a variety of organizations, including governmental agencies, to facilitate access to our COVID-19 treatments in various countries. However, we face unique risks and uncertainties in our development, manufacture, and uptake of potential treatments for COVID-19, including vulnerability to supply chain disruptions, higher manufacturing costs, difficulties in manufacturing sufficient quantities of our therapies, restrictions on administration that limit widespread and timely access to our therapies, and risks related to handling, return, and/or refund of product after delivery by us. Expedited authorization processes, including our EUAs for bamlanivimab and bamlanivimab and etesevimab administered together, have allowed restricted distribution of products with less than typical safety and efficacy data, and additional data that become available may call into question the safety or effectiveness of our COVID-19 therapies. Additionally, the availability of superior or competitive therapies, or preventative measures, such as vaccines, coupled with the transient nature of pandemics, could negatively impact or eliminate demand for our COVID-19 therapies. In addition, we may be required to accept returns of certain product previously shipped pursuant to EUAs if the relevant EUA is revoked or terminated. Mutations or the spread of other variants of the coronavirus could also render our therapies ineffective. Any of these risks could prevent us from recouping our substantial investments in the research, development, and manufacture of our COVID-19 therapies. ",
        "match": "Our ability to continue to operate without significant negative impacts will in part depend on our ability to protect our employees and our supply chain. We have taken steps to protect our employees worldwide, with particular measures in place for those working in our manufacturing sites and distribution facilities. For 2020, we were able to largely maintain our normal operations. However, uncertainty resulting from the COVID-19 pandemic could have an adverse impact on our manufacturing operations, global supply chain, and distribution systems, which could impact our ability to produce and distribute our products and the ability of third parties on which we rely to fulfill their obligations to us, and could increase our expenses."
    },
    "620": {
        "CIK": "0000059478",
        "Company Name": "ELI LILLY AND COMPANY",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "before": "Our ability to continue to operate without significant negative impacts will in part depend on our ability to protect our employees and our supply chain. We have taken steps to protect our employees worldwide, with particular measures in place for those working in our manufacturing sites and distribution facilities. For 2020, we were able to largely maintain our normal operations. However, uncertainty resulting from the COVID-19 pandemic could have an adverse impact on our manufacturing operations, global supply chain, and distribution systems, which could impact our ability to produce and distribute our products and the ability of third parties on which we rely to fulfill their obligations to us, and could increase our expenses.",
        "match": "Although the COVID-19 pandemic has affected our operations and demand for our products, it has not negatively impacted our liquidity position. We expect to continue to generate cash flows to meet our short-term liquidity needs and to have access to liquidity via the short-term and long-term debt markets. We also have not observed any material impairments of our assets or significant changes in the fair value of assets due to the COVID-19 pandemic."
    },
    "635": {
        "CIK": "0000059478",
        "Company Name": "ELI LILLY AND COMPANY",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "before": "In regards to COVID-19 therapies, the U.S. Food and Drug Administration (FDA) granted Emergency Use Authorizations (EUA) for bamlanivimab and bamlanivimab and etesevimab administered together for higher-risk patients who have been recently diagnosed with mild-to-moderate COVID-19 and for baricitinib in combination with remdesivir in hospitalized COVID-19 patients. We are actively working with a variety of organizations, including governmental agencies, to facilitate access to our COVID-19 treatments in various countries. However, we face unique risks and uncertainties in our development, manufacture, and uptake of potential treatments for COVID-19, including vulnerability to supply chain disruptions, higher manufacturing costs, difficulties in manufacturing sufficient quantities of our therapies, restrictions on administration that limit widespread and timely access to our therapies, and risks related to handling, return, and/or refund of product after delivery by us. Expedited authorization processes, including our EUAs for bamlanivimab and bamlanivimab and etesevimab administered together, have allowed restricted distribution of products with less than typical safety and efficacy data, and additional data that become available may call into question the safety or effectiveness of our COVID-19 therapies. Additionally, the availability of superior or competitive therapies, or preventative measures, such as vaccines, coupled with the transient nature of pandemics, could negatively impact or eliminate demand for our COVID-19 therapies. In addition, we may be required to accept returns of certain product previously shipped pursuant to EUAs if the relevant EUA is revoked or terminated. Mutations or the spread of other variants of the coronavirus could also render our therapies ineffective. Any of these risks could prevent us from recouping our substantial investments in the research, development, and manufacture of our COVID-19 therapies. ",
        "match": "Our ability to continue to operate without significant negative impacts will in part depend on our ability to protect our employees and our supply chain. We have taken steps to protect our employees worldwide, with particular measures in place for those working in our manufacturing sites and distribution facilities. For 2020, we were able to largely maintain our normal operations. However, uncertainty resulting from the COVID-19 pandemic could have an adverse impact on our manufacturing operations, global supply chain, and distribution systems, which could impact our ability to produce and distribute our products and the ability of third parties on which we rely to fulfill their obligations to us, and could increase our expenses."
    },
    "637": {
        "CIK": "0000059478",
        "Company Name": "ELI LILLY AND COMPANY",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "before": "Our ability to continue to operate without significant negative impacts will in part depend on our ability to protect our employees and our supply chain. We have taken steps to protect our employees worldwide, with particular measures in place for those working in our manufacturing sites and distribution facilities. For 2020, we were able to largely maintain our normal operations. However, uncertainty resulting from the COVID-19 pandemic could have an adverse impact on our manufacturing operations, global supply chain, and distribution systems, which could impact our ability to produce and distribute our products and the ability of third parties on which we rely to fulfill their obligations to us, and could increase our expenses.",
        "match": "Although the COVID-19 pandemic has affected our operations and demand for our products, it has not negatively impacted our liquidity position. We expect to continue to generate cash flows to meet our short-term liquidity needs and to have access to liquidity via the short-term and long-term debt markets. We also have not observed any material impairments of our assets or significant changes in the fair value of assets due to the COVID-19 pandemic."
    },
    "649": {
        "CIK": "0000063276",
        "Company Name": "MATTEL INC /DE/",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "before": "Mattel's manufacturing and distribution network was fully operational as of December 31, 2020. Prolonged disruption to Mattel’s customers, supply chain, or other critical operations would result in material adverse effects to Mattel’s business and its liquidity.  The future impact of COVID-19 on Mattel’s results of operations, financial position, and cash flows remains uncertain at this time due to rapidly evolving circumstances.  Mattel is closely monitoring the situation and actively managing its business as developments occur. Refer to Part I, Item 1A \"Risk Factors\" of this Annual Report on Form 10-K for further discussion regarding potential impacts of COVID-19 on Mattel’s business.",
        "match": "The specific line items that have been materially affected by these impacts of COVID-19 are noted as such within \"Results of Operations\" below.  Additional discussion of the impact of COVID-19 on Mattel's liquidity and capital resources is discussed in \"Liquidity and Capital Resources\" and in \"Cost Savings Programs\" below. In addition to the impacts of COVID-19 discussed below, it is reasonably likely that the pandemic and its resulting effects could have other unforeseen consequences that affect Mattel’s business."
    },
    "659": {
        "CIK": "0000063276",
        "Company Name": "MATTEL INC /DE/",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "before": "Mattel's manufacturing and distribution network was fully operational as of December 31, 2020. Prolonged disruption to Mattel’s customers, supply chain, or other critical operations would result in material adverse effects to Mattel’s business and its liquidity.  The future impact of COVID-19 on Mattel’s results of operations, financial position, and cash flows remains uncertain at this time due to rapidly evolving circumstances.  Mattel is closely monitoring the situation and actively managing its business as developments occur. Refer to Part I, Item 1A \"Risk Factors\" of this Annual Report on Form 10-K for further discussion regarding potential impacts of COVID-19 on Mattel’s business.",
        "match": "The specific line items that have been materially affected by these impacts of COVID-19 are noted as such within \"Results of Operations\" below.  Additional discussion of the impact of COVID-19 on Mattel's liquidity and capital resources is discussed in \"Liquidity and Capital Resources\" and in \"Cost Savings Programs\" below. In addition to the impacts of COVID-19 discussed below, it is reasonably likely that the pandemic and its resulting effects could have other unforeseen consequences that affect Mattel’s business."
    },
    "1108": {
        "CIK": "0000354908",
        "Company Name": "FLIR Systems, Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "Impact of COVID-19",
        "after": "On January 30, 2020, the World Health Organization declared the COVID-19 outbreak as a global health emergency. On March 11, 2020, the World Health Organization raised the COVID-19 outbreak to “pandemic” status. Transmission of COVID-19 and efforts to contain its spread resulted in international, national and local border closings and other significant travel restrictions and disruptions, significant disruptions to business operations, supply chains and customer activity, event cancellations and restrictions, service cancellations, reductions and other changes, significant challenges in healthcare service preparation and delivery, quarantines and related government actions and policies, as well as general concern and uncertainty that has negatively affected the U.S. and global economy and financial environments. In addition, as cases have resurged in parts of the U.S., including areas in which we maintain large facilities, we have seen governments slow or reverse efforts to reopen or shift into later phases of recovery, with increased risks to our operations."
    },
    "1111": {
        "CIK": "0000354908",
        "Company Name": "FLIR Systems, Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "before": "On January 30, 2020, the World Health Organization declared the COVID-19 outbreak as a global health emergency. On March 11, 2020, the World Health Organization raised the COVID-19 outbreak to “pandemic” status. Transmission of COVID-19 and efforts to contain its spread resulted in international, national and local border closings and other significant travel restrictions and disruptions, significant disruptions to business operations, supply chains and customer activity, event cancellations and restrictions, service cancellations, reductions and other changes, significant challenges in healthcare service preparation and delivery, quarantines and related government actions and policies, as well as general concern and uncertainty that has negatively affected the U.S. and global economy and financial environments. In addition, as cases have resurged in parts of the U.S., including areas in which we maintain large facilities, we have seen governments slow or reverse efforts to reopen or shift into later phases of recovery, with increased risks to our operations.",
        "match": "The health and safety of our employees across the globe remain our top priority during this crisis. We have enacted stringent safety protocols to protect our employees and ensure we can continue to service our customers. We initiated a site entry restriction policy for external visitors to our facilities. We have also developed contingency plans for staggered work schedules designed to reduce the number of employees working at a given time. We are regularly deep cleaning our facilities, advising all employees to follow safe hygiene practices, and requiring employees to stay home if they have any of the known symptoms or have come into contact with people who have tested positive for COVID-19. We have also implemented global employee travel restrictions and allowed employees to work remotely if they are able to do so."
    },
    "1129": {
        "CIK": "0000705432",
        "Company Name": "SOUTHSIDE BANCSHARES, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "During March 2020, the World Health Organization declared the COVID-19 a global pandemic in response to the rapidly growing outbreak of the virus. COVID-19 significantly impacted local, national and global economies due to stay-at-home orders and social distancing guidelines.  In compliance with social distancing guidelines issued by federal, state and local governments, we initially closed all of our grocery store branches. As stay-at-home orders were issued by local governments in our market areas to combat the spread of the virus, we closed all traditional lobbies and wealth management and trust offices to walk-in customers, however, most of these traditional locations were offering certain services by appointment only. All other banking services were available to customers through our drive-thrus, ATMs/ITMs and automated telephone, internet and mobile banking products. After careful consideration and implementation of additional safety precautions, all locations were reopened on June 1, 2020. We have since made adjustments to select branch hours and openings, and we continue to closely monitor the COVID-19 situation. Approximately 45% of our workforce has remote working capabilities.",
        "after": "COVID-19 significantly disrupted supply chains, business activity and the overall economic and financial markets.  These disruptions have and are likely to continue to result in a decline in demand for banking products or services, including loans and deposits which could impact our future financial condition, results of operations and liquidity.  The extent to which the COVID-19 pandemic affects our business, operations and financial condition, as well as our regulatory capital and liquidity ratios and credit ratings, is highly uncertain and unpredictable and depends on, among other things, new information that may emerge concerning the scope, duration and severity of the COVID-19 pandemic, actions taken by governmental authorities and other parties in responses to the pandemic, the scale of the distribution and public acceptance of any vaccines for COVID-19 and the effectiveness of such vaccines in stemming or stopping the spread of COVID-19.  The adverse impact on the markets in which we operate and on our business, operations and financial condition is expected to remain elevated until the pandemic subsides.  "
    },
    "1132": {
        "CIK": "0000705432",
        "Company Name": "SOUTHSIDE BANCSHARES, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "before": "COVID-19 significantly disrupted supply chains, business activity and the overall economic and financial markets.  These disruptions have and are likely to continue to result in a decline in demand for banking products or services, including loans and deposits which could impact our future financial condition, results of operations and liquidity.  The extent to which the COVID-19 pandemic affects our business, operations and financial condition, as well as our regulatory capital and liquidity ratios and credit ratings, is highly uncertain and unpredictable and depends on, among other things, new information that may emerge concerning the scope, duration and severity of the COVID-19 pandemic, actions taken by governmental authorities and other parties in responses to the pandemic, the scale of the distribution and public acceptance of any vaccines for COVID-19 and the effectiveness of such vaccines in stemming or stopping the spread of COVID-19.  The adverse impact on the markets in which we operate and on our business, operations and financial condition is expected to remain elevated until the pandemic subsides.  ",
        "match": "In response to the COVID-19 pandemic, the CARES Act was signed into law on March 27, 2020.  The CARES Act provided an estimated $2.2 trillion to address the economic impact of the COVID-19 pandemic and stimulate the economy by supporting individuals and businesses through loans, grants, tax changes, and other types of relief.  The CARES Act also included provisions to encourage financial institutions to work prudently with borrowers.  As an SBA lender, we were well positioned to assist business customers in accessing funds available through the PPP implemented in April.  At December 31, 2020, we had $214.8 million of approved PPP loans outstanding.  On December 27, 2020, the Economic Aid Act was signed into law.  This second coronavirus relief package granted additional funds for a new round of PPP loans.  Additionally, it expands the eligibility for loans and allows certain businesses to request a second loan.  The SBA began accepting applications for the second round of PPP loans on January 13, 2021.  As of February 23, 2021, we had funded $55 million of additional PPP loans under this second round of PPP loans."
    },
    "1156": {
        "CIK": "0000705432",
        "Company Name": "SOUTHSIDE BANCSHARES, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "During March 2020, the World Health Organization declared the COVID-19 a global pandemic in response to the rapidly growing outbreak of the virus. COVID-19 significantly impacted local, national and global economies due to stay-at-home orders and social distancing guidelines.  In compliance with social distancing guidelines issued by federal, state and local governments, we initially closed all of our grocery store branches. As stay-at-home orders were issued by local governments in our market areas to combat the spread of the virus, we closed all traditional lobbies and wealth management and trust offices to walk-in customers, however, most of these traditional locations were offering certain services by appointment only. All other banking services were available to customers through our drive-thrus, ATMs/ITMs and automated telephone, internet and mobile banking products. After careful consideration and implementation of additional safety precautions, all locations were reopened on June 1, 2020. We have since made adjustments to select branch hours and openings, and we continue to closely monitor the COVID-19 situation. Approximately 45% of our workforce has remote working capabilities.",
        "after": "COVID-19 significantly disrupted supply chains, business activity and the overall economic and financial markets.  These disruptions have and are likely to continue to result in a decline in demand for banking products or services, including loans and deposits which could impact our future financial condition, results of operations and liquidity.  The extent to which the COVID-19 pandemic affects our business, operations and financial condition, as well as our regulatory capital and liquidity ratios and credit ratings, is highly uncertain and unpredictable and depends on, among other things, new information that may emerge concerning the scope, duration and severity of the COVID-19 pandemic, actions taken by governmental authorities and other parties in responses to the pandemic, the scale of the distribution and public acceptance of any vaccines for COVID-19 and the effectiveness of such vaccines in stemming or stopping the spread of COVID-19.  The adverse impact on the markets in which we operate and on our business, operations and financial condition is expected to remain elevated until the pandemic subsides.  "
    },
    "1159": {
        "CIK": "0000705432",
        "Company Name": "SOUTHSIDE BANCSHARES, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "before": "COVID-19 significantly disrupted supply chains, business activity and the overall economic and financial markets.  These disruptions have and are likely to continue to result in a decline in demand for banking products or services, including loans and deposits which could impact our future financial condition, results of operations and liquidity.  The extent to which the COVID-19 pandemic affects our business, operations and financial condition, as well as our regulatory capital and liquidity ratios and credit ratings, is highly uncertain and unpredictable and depends on, among other things, new information that may emerge concerning the scope, duration and severity of the COVID-19 pandemic, actions taken by governmental authorities and other parties in responses to the pandemic, the scale of the distribution and public acceptance of any vaccines for COVID-19 and the effectiveness of such vaccines in stemming or stopping the spread of COVID-19.  The adverse impact on the markets in which we operate and on our business, operations and financial condition is expected to remain elevated until the pandemic subsides.  ",
        "match": "In response to the COVID-19 pandemic, the CARES Act was signed into law on March 27, 2020.  The CARES Act provided an estimated $2.2 trillion to address the economic impact of the COVID-19 pandemic and stimulate the economy by supporting individuals and businesses through loans, grants, tax changes, and other types of relief.  The CARES Act also included provisions to encourage financial institutions to work prudently with borrowers.  As an SBA lender, we were well positioned to assist business customers in accessing funds available through the PPP implemented in April.  At December 31, 2020, we had $214.8 million of approved PPP loans outstanding.  On December 27, 2020, the Economic Aid Act was signed into law.  This second coronavirus relief package granted additional funds for a new round of PPP loans.  Additionally, it expands the eligibility for loans and allows certain businesses to request a second loan.  The SBA began accepting applications for the second round of PPP loans on January 13, 2021.  As of February 23, 2021, we had funded $55 million of additional PPP loans under this second round of PPP loans."
    },
    "1191": {
        "CIK": "0000707388",
        "Company Name": "Star Equity Holdings, Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "The target market for our healthcare products and services is comprised of cardiologists, internal medicine physicians, family practice physicians, hospitals, IDNs, and federal institutions in the United States that perform or could perform a diagnostic imaging procedure, have a need for cardiac event monitoring, or have interest in purchasing a diagnostic imaging product. During the year ended December 31, 2020, through Diagnostic Services, we provided imaging services to 584 physicians, physician groups, hospitals, IDNs and federal institutions. Our Diagnostic Services businesses currently operate in approximately 25 states. The overriding challenge during 2020 was the drop in imaging volume due to the COVID-19 pandemic. While we provide critical and important imaging services focused in the cardiac area, the risks of exposure led to reduced patient volumes as these tests were deferred or canceled in hopes that the pandemic would abate.",
        "after": "The target market for our building and construction division includes residential home builders, general contractors, owners/developers of commercial buildings, and individual retail customers. While we witnessed a number of municipalities, especially in the Boston area, shutdown construction sites during the early wave of infections and even shutdown our own plant in South Paris, Maine for six weeks in April and May of 2020, housing demand and demand for building materials have increased as the COVID-19 pandemic has led to “nesting” at home, which have been positive factors in the second half of 2020. The challenge has been less on the demand side and more on the supply chain, as wood-based commodities prices, lumber and OSB, have increased rapidly coming out of the first wave of the pandemic in the Spring of 2020 and supply has not kept up with demand. We have seen some supply chain disruption and tightness during the second half of 2020 and that has continued into 2021 as lead times have extended out, but we are still able to operate at normal levels of production. We believe that the high price environment that we are currently experiencing will lead to additional supply coming on line going forward."
    },
    "1199": {
        "CIK": "0000707388",
        "Company Name": "Star Equity Holdings, Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "The target market for our healthcare products and services is comprised of cardiologists, internal medicine physicians, family practice physicians, hospitals, IDNs, and federal institutions in the United States that perform or could perform a diagnostic imaging procedure, have a need for cardiac event monitoring, or have interest in purchasing a diagnostic imaging product. During the year ended December 31, 2020, through Diagnostic Services, we provided imaging services to 584 physicians, physician groups, hospitals, IDNs and federal institutions. Our Diagnostic Services businesses currently operate in approximately 25 states. The overriding challenge during 2020 was the drop in imaging volume due to the COVID-19 pandemic. While we provide critical and important imaging services focused in the cardiac area, the risks of exposure led to reduced patient volumes as these tests were deferred or canceled in hopes that the pandemic would abate.",
        "after": "The target market for our building and construction division includes residential home builders, general contractors, owners/developers of commercial buildings, and individual retail customers. While we witnessed a number of municipalities, especially in the Boston area, shutdown construction sites during the early wave of infections and even shutdown our own plant in South Paris, Maine for six weeks in April and May of 2020, housing demand and demand for building materials have increased as the COVID-19 pandemic has led to “nesting” at home, which have been positive factors in the second half of 2020. The challenge has been less on the demand side and more on the supply chain, as wood-based commodities prices, lumber and OSB, have increased rapidly coming out of the first wave of the pandemic in the Spring of 2020 and supply has not kept up with demand. We have seen some supply chain disruption and tightness during the second half of 2020 and that has continued into 2021 as lead times have extended out, but we are still able to operate at normal levels of production. We believe that the high price environment that we are currently experiencing will lead to additional supply coming on line going forward."
    },
    "1253": {
        "CIK": "0000730708",
        "Company Name": "Seacoast Banking Corporation of Florida",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "Early in 2020, the global economy began experiencing a downturn resulting from the COVID-19 pandemic. Seacoast reacted quickly at the onset to make adjustments to operations intended to protect the health and welfare of our associates and customers. The Company's range of digital banking products combined with continued access to branches through drive-thrus and lobby appointments has allowed the Company to continue to meet customer needs. A robust and well-tested business continuity program has allowed the Company to maintain productivity levels with a majority of associates working remotely.",
        "after": "The spread of COVID-19 has created a global public health crisis that has resulted in unprecedented uncertainty, volatility and disruption in financial markets and in governmental, commercial and consumer activity in the United States and globally, including the markets that we serve. Governmental responses to the pandemic have included orders to close businesses not deemed essential and directing individuals to restrict their movements, observe social distancing and shelter in place. These actions, together with responses to the pandemic by businesses and individuals, have resulted in rapid decreases in commercial and consumer activity, temporary, and some permanent, closures of many businesses that have led to a loss of revenues and a rapid increase in unemployment, material decreases in business valuations, disrupted global supply chains, market downturns and volatility, changes in consumer behavior related to pandemic fears (including "
    },
    "1267": {
        "CIK": "0000730708",
        "Company Name": "Seacoast Banking Corporation of Florida",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "Early in 2020, the global economy began experiencing a downturn resulting from the COVID-19 pandemic. Seacoast reacted quickly at the onset to make adjustments to operations intended to protect the health and welfare of our associates and customers. The Company's range of digital banking products combined with continued access to branches through drive-thrus and lobby appointments has allowed the Company to continue to meet customer needs. A robust and well-tested business continuity program has allowed the Company to maintain productivity levels with a majority of associates working remotely.",
        "after": "The spread of COVID-19 has created a global public health crisis that has resulted in unprecedented uncertainty, volatility and disruption in financial markets and in governmental, commercial and consumer activity in the United States and globally, including the markets that we serve. Governmental responses to the pandemic have included orders to close businesses not deemed essential and directing individuals to restrict their movements, observe social distancing and shelter in place. These actions, together with responses to the pandemic by businesses and individuals, have resulted in rapid decreases in commercial and consumer activity, temporary, and some permanent, closures of many businesses that have led to a loss of revenues and a rapid increase in unemployment, material decreases in business valuations, disrupted global supply chains, market downturns and volatility, changes in consumer behavior related to pandemic fears (including "
    },
    "1286": {
        "CIK": "0000731766",
        "Company Name": "UnitedHealth Group Incorporated",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "The COVID-19 pandemic has resulted in our customers having to close or severely curtail their operations. Among other impacts, we have experienced and may continue to experience loss of commercial and pharmacy care services members due to customer reductions in workforce and an adverse impact on the timing and collectability of premium payments. In addition, governments have modified, and may continue to modify, regulatory standards around various aspects of health care in response to COVID-19, and these changing standards may create challenges for us to ensure timely compliance and meet various contractual obligations.",
        "after": "Further disruptions in public and private infrastructure, including supply chains providing medical supplies and pharmaceutical products, could adversely disrupt our business operations or increase our operating costs. Additionally, the enactment of emergency powers by governments could disrupt our business operations, including restricting pharmaceuticals or other supplies, and could increase the risk of shortages of necessary items."
    },
    "1288": {
        "CIK": "0000731766",
        "Company Name": "UnitedHealth Group Incorporated",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "before": "Further disruptions in public and private infrastructure, including supply chains providing medical supplies and pharmaceutical products, could adversely disrupt our business operations or increase our operating costs. Additionally, the enactment of emergency powers by governments could disrupt our business operations, including restricting pharmaceuticals or other supplies, and could increase the risk of shortages of necessary items.",
        "match": "Although we cannot predict the pacing, intensity and duration of COVID-19, the pandemic’s disruption to business activities, employment and economic effects, and near and long-term impacts on the patterns of care and services across the healthcare system could continue to have material and adverse effects on our business, results of operations, financial position or cash flows."
    },
    "1307": {
        "CIK": "0000731766",
        "Company Name": "UnitedHealth Group Incorporated",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "The COVID-19 pandemic has resulted in our customers having to close or severely curtail their operations. Among other impacts, we have experienced and may continue to experience loss of commercial and pharmacy care services members due to customer reductions in workforce and an adverse impact on the timing and collectability of premium payments. In addition, governments have modified, and may continue to modify, regulatory standards around various aspects of health care in response to COVID-19, and these changing standards may create challenges for us to ensure timely compliance and meet various contractual obligations.",
        "after": "Further disruptions in public and private infrastructure, including supply chains providing medical supplies and pharmaceutical products, could adversely disrupt our business operations or increase our operating costs. Additionally, the enactment of emergency powers by governments could disrupt our business operations, including restricting pharmaceuticals or other supplies, and could increase the risk of shortages of necessary items."
    },
    "1309": {
        "CIK": "0000731766",
        "Company Name": "UnitedHealth Group Incorporated",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "before": "Further disruptions in public and private infrastructure, including supply chains providing medical supplies and pharmaceutical products, could adversely disrupt our business operations or increase our operating costs. Additionally, the enactment of emergency powers by governments could disrupt our business operations, including restricting pharmaceuticals or other supplies, and could increase the risk of shortages of necessary items.",
        "match": "Although we cannot predict the pacing, intensity and duration of COVID-19, the pandemic’s disruption to business activities, employment and economic effects, and near and long-term impacts on the patterns of care and services across the healthcare system could continue to have material and adverse effects on our business, results of operations, financial position or cash flows."
    },
    "1560": {
        "CIK": "0000795266",
        "Company Name": "KB HOME",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "before": "assure a backlog of qualified homebuyers amid the pandemic-induced economic downturn, we experienced a sizable reduction in our 2020 second quarter net orders.  Due to this reduction in net orders, we entered the third quarter with 14% fewer homes in backlog as compared to the previous year.  Further, our construction activities were restricted in many jurisdictions, and completely shut down in some of them, and together with the reduced availability or capacity of some municipal and private services necessary to build and deliver homes, and supply chain disruptions, our cycle times became extended.  This caused home delivery delays during most of the second quarter, which tempered our revenues for the period.",
        "match": "With the easing of restrictive public health orders to varying degrees in our served markets beginning in May 2020 and the associated ability to open our communities to walk-in traffic, following appropriate safety protocols and applicable public health guidelines, complemented by our enhanced virtual selling capabilities, as discussed under Item 1 – Business, our net orders began to rebound significantly.  This positive momentum continued through the 2020 second half, largely fueled by the combination of historically low mortgage interest rates, a limited supply of resale inventory, an underproduction of new homes over the past decade, favorable demographic trends and consumers’ increasing desire to own a home.  Reflecting this strong demand, our 2020 third and fourth quarter net orders rose to their respective highest levels since 2005.  Though this sharp rise in net orders in the second half generated a substantial expansion in our backlog, as discussed below, our deliveries and revenues for our third and fourth quarters were moderated primarily by the negative effects of the COVID-19 pandemic in our 2020 second quarter. "
    },
    "1573": {
        "CIK": "0000795266",
        "Company Name": "KB HOME",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "before": "assure a backlog of qualified homebuyers amid the pandemic-induced economic downturn, we experienced a sizable reduction in our 2020 second quarter net orders.  Due to this reduction in net orders, we entered the third quarter with 14% fewer homes in backlog as compared to the previous year.  Further, our construction activities were restricted in many jurisdictions, and completely shut down in some of them, and together with the reduced availability or capacity of some municipal and private services necessary to build and deliver homes, and supply chain disruptions, our cycle times became extended.  This caused home delivery delays during most of the second quarter, which tempered our revenues for the period.",
        "match": "With the easing of restrictive public health orders to varying degrees in our served markets beginning in May 2020 and the associated ability to open our communities to walk-in traffic, following appropriate safety protocols and applicable public health guidelines, complemented by our enhanced virtual selling capabilities, as discussed under Item 1 – Business, our net orders began to rebound significantly.  This positive momentum continued through the 2020 second half, largely fueled by the combination of historically low mortgage interest rates, a limited supply of resale inventory, an underproduction of new homes over the past decade, favorable demographic trends and consumers’ increasing desire to own a home.  Reflecting this strong demand, our 2020 third and fourth quarter net orders rose to their respective highest levels since 2005.  Though this sharp rise in net orders in the second half generated a substantial expansion in our backlog, as discussed below, our deliveries and revenues for our third and fourth quarters were moderated primarily by the negative effects of the COVID-19 pandemic in our 2020 second quarter. "
    },
    "1593": {
        "CIK": "0000802481",
        "Company Name": "PILGRIM’S PRIDE CORPORATION",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "The extensive impact of the pandemic caused by COVID-19 has resulted and will likely continue to result in significant disruptions to the global economy, as well as businesses and capital markets around the world. In an effort to halt the outbreak of COVID-19, a number of countries, states, counties and other jurisdictions have imposed various measures, including but not limited to, voluntary and mandatory quarantines, stay-at-home orders, travel restrictions, limitations on gatherings of people, reduced operations and extended closures of businesses. On April 28, 2020, an executive order designated meat and poultry processing plants as critical infrastructure. ",
        "after": "As the global spread of the virus began to accelerate late in March of 2020, we began to experience adverse impacts to our business and financial results. The impact of the COVID-19 pandemic included disruptions in supply chain, an increase in both broiler and chick costs and an increase in payroll and benefits costs. During the second quarter of 2020, the impact of the COVID-19 pandemic on our financial results generally decreased because of increased demand for our products at retail grocery stores and quick service restaurants and our ability to meet this demand through our transitioned business operations, as further discussed below. We believe that we will continue to experience disruptions and other changes to our business due to the COVID-19 pandemic into 2021."
    },
    "1600": {
        "CIK": "0000802481",
        "Company Name": "PILGRIM’S PRIDE CORPORATION",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "The extensive impact of the pandemic caused by COVID-19 has resulted and will likely continue to result in significant disruptions to the global economy, as well as businesses and capital markets around the world. In an effort to halt the outbreak of COVID-19, a number of countries, states, counties and other jurisdictions have imposed various measures, including but not limited to, voluntary and mandatory quarantines, stay-at-home orders, travel restrictions, limitations on gatherings of people, reduced operations and extended closures of businesses. On April 28, 2020, an executive order designated meat and poultry processing plants as critical infrastructure. ",
        "after": "As the global spread of the virus began to accelerate late in March of 2020, we began to experience adverse impacts to our business and financial results. The impact of the COVID-19 pandemic included disruptions in supply chain, an increase in both broiler and chick costs and an increase in payroll and benefits costs. During the second quarter of 2020, the impact of the COVID-19 pandemic on our financial results generally decreased because of increased demand for our products at retail grocery stores and quick service restaurants and our ability to meet this demand through our transitioned business operations, as further discussed below. We believe that we will continue to experience disruptions and other changes to our business due to the COVID-19 pandemic into 2021."
    },
    "1683": {
        "CIK": "0000815556",
        "Company Name": "FASTENAL CO",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "before": "e second quarter of 2020 in order to procure supplies we utilized unfamiliar supply chains and prioritized speed of ac",
        "match": "quisition over efficiency, resulting in lower margins. Second, in the third and fourth quarters of 2020 certain pandemic related products became oversupplied, and profits on our inventory fell (masks) while other products were in such short supply that cost rose (gloves). We mitigated these effects as the year progressed, but did not eliminate them. Third, mix within these categories was negative to margin, as in general COVID-related products had lower margins and increased in the mix. (2) A change in product mix. Fasteners are our largest and highest gross profit margin product line due to the high transaction cost surrounding the sourcing and supply of the product for customers. Our fastener product line declined to 29.9% of sales in 2020 from 34.2% of sales in 2019. (3) Overhead and organizational expenses. This includes the negative impact that reduced sales for certain product lines has on vendor rebates, clearance efforts to remove older and slower moving inventory, and the deleverage of certain fixed and period costs related to cyclical weakness in our traditional manufacturing and construction markets. These three adverse variables were partly offset by a better cost profile for our captive fleet. We operate our own fleet of trucks for moving product between suppliers, our distribution centers, and our in-market locations. We believe this provides us a competitive advantage in terms of our ability to move product efficiently and quickly, but there is a cost to supporting and maintaining these assets. During periods of economic weakness, it can become more difficult to charge freight to offset these costs and/or the relatively stable cost profile of these assets could result in deleverage. We successfully mitigated these challenges in 2020 by reducing movement and labor costs."
    },
    "1899": {
        "CIK": "0000866374",
        "Company Name": "FLEX LTD.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "Update on the Impact of COVID-19 on our Business",
        "after": "As anticipated, our results were negatively impacted by COVID-19 disruptions to our factories, workforce, and suppliers most notably in our first quarter as the impact from the pandemic extended throughout the entire quarter. Total COVID-19 related costs incurred over fiscal year 2021 were over $150 million and were primarily comprised of enhanced health and safety protocols, incremental labor incentives, incremental supply chain costs and forced under-absorption of idle and underutilized labor and overhead costs. As we expected, these incremental costs persisted during fiscal year 2021, but declined significantly over the period as demand improved. Although not materially impacting our results for the fourth quarter of fiscal year 2021, most recently, with the second wave of the pandemic, we have also been experiencing temporary plant closures and/or restrictions at certain manufacturing facilities in Brazil and Malaysia. In addition, India is experiencing a severe COVID-19 resurgence, which has resulted in renewed disease control measures being taken to limit its spread including movement bans and shelter-in-place orders. We have workforce and operations in India and are closely monitoring the situation in India. Our priority is the welfare of our employees."
    },
    "1900": {
        "CIK": "0000866374",
        "Company Name": "FLEX LTD.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "outsourcing",
        "before": "We believe that our continued business transformation is strategically positioning us to take advantage of the long-term, future growth prospects for outsourcing of advanced manufacturing capabilities, design and engineering services and after-market services.",
        "match": "Update on the Impact of COVID-19 on our Business"
    },
    "1902": {
        "CIK": "0000866374",
        "Company Name": "FLEX LTD.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "As anticipated, our results were negatively impacted by COVID-19 disruptions to our factories, workforce, and suppliers most notably in our first quarter as the impact from the pandemic extended throughout the entire quarter. Total COVID-19 related costs incurred over fiscal year 2021 were over $150 million and were primarily comprised of enhanced health and safety protocols, incremental labor incentives, incremental supply chain costs and forced under-absorption of idle and underutilized labor and overhead costs. As we expected, these incremental costs persisted during fiscal year 2021, but declined significantly over the period as demand improved. Although not materially impacting our results for the fourth quarter of fiscal year 2021, most recently, with the second wave of the pandemic, we have also been experiencing temporary plant closures and/or restrictions at certain manufacturing facilities in Brazil and Malaysia. In addition, India is experiencing a severe COVID-19 resurgence, which has resulted in renewed disease control measures being taken to limit its spread including movement bans and shelter-in-place orders. We have workforce and operations in India and are closely monitoring the situation in India. Our priority is the welfare of our employees.",
        "after": "Throughout the fiscal year 2021, COVID-19 related demand and production pressures remained in certain end markets that we serve. Net sales decreased $0.1 billion during fiscal year 2021 versus the prior year primarily due to declines in our Consumer Devices business included in the FAS segment.  Included in the FRS segment, our Health Solutions business performed well during fiscal year 2021 driven by the increased demand for critical care products and diagnostics and patient monitoring programs. Our factories were productive throughout most of fiscal year 2021 resulting in sales recovering specifically for the automotive businesses that were shut down during the majority of the first quarter. During the third quarter of fiscal year 2021, we started to see certain component constraints in the supply chain and we continued to carefully monitor potential supply chain disruptions due to ongoing tightness in the overall component environment. We expect consumer devices to be one of the end markets more sensitive to industry component constraints. In addition, while we anticipate revenue will continue to improve across our end markets, we believe that our businesses tied to consumer spending, such as Lifestyle and Consumer Devices, will continue to be impacted if there is a prolonged demand slowdown. Refer to “Risk Factors - "
    },
    "1904": {
        "CIK": "0000866374",
        "Company Name": "FLEX LTD.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "before": "As anticipated, our results were negatively impacted by COVID-19 disruptions to our factories, workforce, and suppliers most notably in our first quarter as the impact from the pandemic extended throughout the entire quarter. Total COVID-19 related costs incurred over fiscal year 2021 were over $150 million and were primarily comprised of enhanced health and safety protocols, incremental labor incentives, incremental supply chain costs and forced under-absorption of idle and underutilized labor and overhead costs. As we expected, these incremental costs persisted during fiscal year 2021, but declined significantly over the period as demand improved. Although not materially impacting our results for the fourth quarter of fiscal year 2021, most recently, with the second wave of the pandemic, we have also been experiencing temporary plant closures and/or restrictions at certain manufacturing facilities in Brazil and Malaysia. In addition, India is experiencing a severe COVID-19 resurgence, which has resulted in renewed disease control measures being taken to limit its spread including movement bans and shelter-in-place orders. We have workforce and operations in India and are closely monitoring the situation in India. Our priority is the welfare of our employees.",
        "match": "Throughout the fiscal year 2021, COVID-19 related demand and production pressures remained in certain end markets that we serve. Net sales decreased $0.1 billion during fiscal year 2021 versus the prior year primarily due to declines in our Consumer Devices business included in the FAS segment.  Included in the FRS segment, our Health Solutions business performed well during fiscal year 2021 driven by the increased demand for critical care products and diagnostics and patient monitoring programs. Our factories were productive throughout most of fiscal year 2021 resulting in sales recovering specifically for the automotive businesses that were shut down during the majority of the first quarter. During the third quarter of fiscal year 2021, we started to see certain component constraints in the supply chain and we continued to carefully monitor potential supply chain disruptions due to ongoing tightness in the overall component environment. We expect consumer devices to be one of the end markets more sensitive to industry component constraints. In addition, while we anticipate revenue will continue to improve across our end markets, we believe that our businesses tied to consumer spending, such as Lifestyle and Consumer Devices, will continue to be impacted if there is a prolonged demand slowdown. Refer to “Risk Factors - "
    },
    "1915": {
        "CIK": "0000866374",
        "Company Name": "FLEX LTD.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "before": "FAS segment margin remained constant at 2.6% for fiscal year 2020 and fiscal year 2019, respectively. FAS segment margin in fiscal year 2020 was impacted by manufacturing inefficiencies from supply chain disruptions and constraints in the fourth quarter due to COVID-19, slower roll-out of 5G technology, and ongoing repositioning of our operating structure and portfolio transition in the Consumer Devices end market. FAS segment margin in fiscal year 2019 was impacted by losses from our NIKE operations in Mexico, which we exited in the third quarter coupled with under-performance of certain accounts in the Consumer Devices end markets, partially offset by operational efficiencies and improved absorption of overhead in our CEC business.",
        "match": "FRS segment margin increased 60 basis points, to 6.3% for fiscal year 2020, from 5.7% for fiscal year 2019. The FRS segment margin benefited from favorable business mix resulting from increased demand from new business particularly in the Industrial end market, greater levels of design and engineering led engagements and improved operational execution. Offsetting these favorable impacts to the FAS segment were margin deterioration due to accelerated investments and costs associated with new program ramps and pricing pressure with demand declines in the global market that impacted product mix, coupled with under absorption of costs associated with the temporary closure of several automotive sites in the fourth quarter of fiscal year 2020 due to COVID-19."
    },
    "1918": {
        "CIK": "0000866374",
        "Company Name": "FLEX LTD.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "As anticipated, our results were negatively impacted by COVID-19 disruptions to our factories, workforce, and suppliers most notably in our first quarter as the impact from the pandemic extended throughout the entire quarter. Total COVID-19 related costs incurred over fiscal year 2021 were over $150 million and were primarily comprised of enhanced health and safety protocols, incremental labor incentives, incremental supply chain costs and forced under-absorption of idle and underutilized labor and overhead costs. As we expected, these incremental costs persisted during fiscal year 2021, but declined significantly over the period as demand improved. Although not materially impacting our results for the fourth quarter of fiscal year 2021, most recently, with the second wave of the pandemic, we have also been experiencing temporary plant closures and/or restrictions at certain manufacturing facilities in Brazil and Malaysia. In addition, India is experiencing a severe COVID-19 resurgence, which has resulted in renewed disease control measures being taken to limit its spread including movement bans and shelter-in-place orders. We have workforce and operations in India and are closely monitoring the situation in India. Our priority is the welfare of our employees.",
        "after": "Throughout the fiscal year 2021, COVID-19 related demand and production pressures remained in certain end markets that we serve. Net sales decreased $0.1 billion during fiscal year 2021 versus the prior year primarily due to declines in our Consumer Devices business included in the FAS segment.  Included in the FRS segment, our Health Solutions business performed well during fiscal year 2021 driven by the increased demand for critical care products and diagnostics and patient monitoring programs. Our factories were productive throughout most of fiscal year 2021 resulting in sales recovering specifically for the automotive businesses that were shut down during the majority of the first quarter. During the third quarter of fiscal year 2021, we started to see certain component constraints in the supply chain and we continued to carefully monitor potential supply chain disruptions due to ongoing tightness in the overall component environment. We expect consumer devices to be one of the end markets more sensitive to industry component constraints. In addition, while we anticipate revenue will continue to improve across our end markets, we believe that our businesses tied to consumer spending, such as Lifestyle and Consumer Devices, will continue to be impacted if there is a prolonged demand slowdown. Refer to “Risk Factors - "
    },
    "1963": {
        "CIK": "0000874499",
        "Company Name": "Gulfport Energy Corp",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "before": "As a result of our business continuity measures, we have not experienced significant disruptions in executing our business operations during 2020.  While we did not experience significant disruptions to our operations in 2020, we are unable to predict the impact on our business, including our cash flows, liquidity, and results of operations in future periods due to numerous uncertainties.  There is considerable uncertainty regarding the extent to which COVID-19 will continue to spread and the extent and duration of governmental and other measures implemented to slow the spread of the virus, such as large-scale travel bans and restrictions, quarantines, shelter-in-place orders and business and government shutdowns.  Restrictions of this nature may cause, us, our suppliers and other business counterparties to experience operational delays, or delays in the delivery of materials and supplies.  We expect the principal areas of operational risk for us are the availability and reliability of service providers and potential supply chain disruption.  Additionally, the operations of our midstream service providers, on whom we rely for the transmission, gathering and processing of a significant portion of our produced natural gas, NGL and oil, may be disrupted or suspended in response to containing the outbreak, or the difficult economic environment may lead to the  bankruptcy or closing of the facilities and infrastructure of our midstream service providers. This may result in substantial discount in the prices we receive for our produced natural gas, NGL and oil or result in the shut-in of producing wells or the delay or discontinuance of development plans for our properties.",
        "match": "One of the impacts of the pandemic has been a significant reduction in global demand for oil and natural gas. The significant decline in demand has been met with a sharp decline in oil prices following the announcement of price reductions and production increases in March 2020 by members of the Organization of Petroleum Exporting Countries, and other foreign, oil-exporting countries.  The resulting supply/demand imbalance is having disruptive impacts on the oil and natural gas exploration and production industry and on other industries that serve exploration and production companies.  These industry conditions, coupled with those resulting from the COVID-19 pandemic, has led to significant global economic contraction generally and in our industry in particular.  We expect to see continued volatility in oil and natural gas prices for the foreseeable future, which may, over the long term, adversely impact our business.  Continued depressed demand or prices for oil and natural gas would have a material adverse effect on our business, cash flows, liquidity, financial condition and results of operations.  "
    },
    "1966": {
        "CIK": "0000874499",
        "Company Name": "Gulfport Energy Corp",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "before": "As a result of our business continuity measures, we have not experienced significant disruptions in executing our business operations during 2020.  While we did not experience significant disruptions to our operations in 2020, we are unable to predict the impact on our business, including our cash flows, liquidity, and results of operations in future periods due to numerous uncertainties.  There is considerable uncertainty regarding the extent to which COVID-19 will continue to spread and the extent and duration of governmental and other measures implemented to slow the spread of the virus, such as large-scale travel bans and restrictions, quarantines, shelter-in-place orders and business and government shutdowns.  Restrictions of this nature may cause, us, our suppliers and other business counterparties to experience operational delays, or delays in the delivery of materials and supplies.  We expect the principal areas of operational risk for us are the availability and reliability of service providers and potential supply chain disruption.  Additionally, the operations of our midstream service providers, on whom we rely for the transmission, gathering and processing of a significant portion of our produced natural gas, NGL and oil, may be disrupted or suspended in response to containing the outbreak, or the difficult economic environment may lead to the  bankruptcy or closing of the facilities and infrastructure of our midstream service providers. This may result in substantial discount in the prices we receive for our produced natural gas, NGL and oil or result in the shut-in of producing wells or the delay or discontinuance of development plans for our properties.",
        "match": "One of the impacts of the pandemic has been a significant reduction in global demand for oil and natural gas. The significant decline in demand has been met with a sharp decline in oil prices following the announcement of price reductions and production increases in March 2020 by members of the Organization of Petroleum Exporting Countries, and other foreign, oil-exporting countries.  The resulting supply/demand imbalance is having disruptive impacts on the oil and natural gas exploration and production industry and on other industries that serve exploration and production companies.  These industry conditions, coupled with those resulting from the COVID-19 pandemic, has led to significant global economic contraction generally and in our industry in particular.  We expect to see continued volatility in oil and natural gas prices for the foreseeable future, which may, over the long term, adversely impact our business.  Continued depressed demand or prices for oil and natural gas would have a material adverse effect on our business, cash flows, liquidity, financial condition and results of operations.  "
    },
    "1974": {
        "CIK": "0000875320",
        "Company Name": "VERTEX PHARMACEUTICALS INC / MA",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "COVID-19",
        "after": "We continue to monitor the impacts of the COVID-19 global pandemic on our business. COVID-19 has not affected our supply chain or the demand for our medicines, and we believe that we will be able to continue to supply all of our approved medicines to patients globally. We have adjusted our business operations in response to COVID-19, with a majority of our employees continuing to work remotely. We continue to monitor local COVID-19 trends and government guidance for each of our site locations, and are utilizing a phased, site-specific approach to assess employee access to our sites. Currently, all of our research and manufacturing sites are open to essential employees. To provide a safe working environment for our on-site employees, we have, among other things, limited employee numbers at our open sites and increased safety measures, including at home and on-site testing in the U.S., enhanced cleaning and sanitation protocols, required use of personal protective equipment for all on-site employees, hand sanitation stations throughout our open sites and implementation of various social distancing measures while on-site."
    },
    "1983": {
        "CIK": "0000878526",
        "Company Name": "NATUS MEDICAL INC",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "COVID-19 Update",
        "after": "Healthcare providers and patients continue to depend on our products and services every day. Our team members and partners are continuing to maintain our supply chain, manufacturing and delivery of our products and services. The health and welfare of our employees, our customers and our partners remain our top priority as we continue our business operations. "
    },
    "2213": {
        "CIK": "0000914025",
        "Company Name": "Plantronics, Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "before": "change.  The semiconductor chip global supply chain is complex and constrained wafer capacity is limiting supply.  We do not manufacture these component parts and currently purchase certain parts, including semiconductor chips and sub-assemblies that require semiconductor chips, from single or limited sources.  Additionally, constrained supply has resulted in increased prices for certain components, including semiconductor chips.  We continue to monitor our supply chain and are taking action against limited supply and increasing lead times, including outreach to critical suppliers and entering into contractual obligations to secure supply. We are unable to estimate the extent and the period over which these conditions will exist, but expect them to at least impact results in the first quarter of Fiscal Year 2022.",
        "match": "In responding to this pandemic, employee safety continues to be a critical concern for Poly and we have taken measures to protect our employees globally by adherence to public safety and shelter in place directives, physical distancing protocols within offices and manufacturing facilities, providing personal protective equipment, including face masks and hand sanitizers, conducting routine sanitation of facilities, requiring health monitoring before entry into Poly facilities and restricting the number of visitors to our sites. The safety protocols implemented globally meet or exceed current regulations, however we continue to monitor employees’ safety and evolving regulatory requirements. Although our manufacturing facility remains open and certain office employees may utilize our offices when necessary, the majority of all non-factory employees continue to work from home, using headsets and other Poly-issued equipment.",
        "after": "The full extent and duration of the impact of the COVID-19 pandemic on our business continues to be uncertain and difficult to predict and will depend on many factors outside of our control, including the extent and duration of the pandemic, mutations of the virus, the development and availability of effective treatments, including the availability of vaccines for our global workforce, mandates of protective public safety measures, and the impact of the pandemic on the global economy, global supply chains, and demand for our products. It is not possible at this time to foresee whether the outbreak of COVID-19 or other events beyond our control will be effectively contained, nor can we estimate the entirety of the impact that COVID-19 or such other pandemics or natural or man-made disaster will have on the global economy, our business, customers, suppliers or other business partners. As such, impacts from such events on Poly are highly uncertain and we will continue to assess the impact from such events on our Consolidated Financial Statements."
    },
    "2216": {
        "CIK": "0000918541",
        "Company Name": "NN, Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "Global COVID-19 Pandemic",
        "after": "The COVID-19 pandemic continues to disrupt the United States and global economy, and we cannot predict when a full economic recovery will occur.  Consistent with actions taken by governmental authorities and in response to reduced customer demand, in late March 2020, we idled manufacturing operations in certain regions around the world, other than China, where manufacturing operations began to resume in March 2020.  During the year, we experienced supplier and customer disruption, which adversely affected our results of operations and cash flows in 2020.  In Europe and North America, sales began declining in the second half of March as the pandemic led to customer plant closures.  The situation grew more challenging in the second and third quarters of fiscal 2020, as customer closures affected much of our operations.  Although much of the United States and the global economies have reopened, many public health experts warn there may be additional COVID-19 surges in 2021.  Further surges in the COVID-19 infection rates could result in the reinstatement of directives and mandates requiring businesses to again curtail or cease normal operations, just as some jurisdictions rolled back reopening plans in the summer of 2020 during one of the initial COVID-19 surges.  Thus, the spread of COVID-19 and the responses thereto have created a disruption in the manufacturing, delivery, and overall supply chain of automobile manufacturers and suppliers, as well as disruption within the power industry.  Global vehicle production decreased significantly, and some vehicle manufacturers completely shut down manufacturing operations in some countries and regions, including the United States and Europe.  The rapid development and fluidity of the situation precludes any prediction as to the ultimate impact COVID-19 will have on our business, financial condition, results of operations, and cash flows, which will depend largely on future developments directly or indirectly relating to the duration and scope of the COVID-19 outbreak.  "
    },
    "2234": {
        "CIK": "0000920148",
        "Company Name": "LABORATORY CORPORATION OF AMERICA HOLDINGS",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "Total volume, measured by requisitions, increased by 7.8% as organic volume increased by 6.5% and acquisition volume contributed growth of 1.3%. The organic volume growth is due to demand for COVID-19 Testing of 21.2%, partially offset by a 14.7% reduction of organic Base Business. Price/mix increased by 24.4% due to COVID-19 Testing of 18.6% and Base Business of 5.8%. The Base Business price includes the negative impact from PAMA of 1.0%.",
        "after": "DD revenues for the year ended December 31, 2020, were $4,877.7, an increase of 6.5% over revenues of $4,578.1 in the corresponding period in 2019. The increase in revenues was due to the benefit of acquisitions of 2.6%, favorable foreign currency translation of 0.9% and organic growth of 3.5%, partially offset by a business disposition of 0.5%. The increase in organic revenue was primarily driven by COVID-19 PCR testing through its Central Laboratories unit along with broad based demand including COVID-19 vaccine and therapeutic work, partially offset by the negative impact from the pandemic. The pandemic continues to cause delays in clinical trial progression and associated testing, reductions in investigator site access, as well as interruptions to the supply chain. "
    },
    "2300": {
        "CIK": "0000926326",
        "Company Name": "OMNICELL, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "COVID-19 Update",
        "after": "Keeping in mind our role in the healthcare industry, we are continuing to closely monitor the COVID-19 pandemic. As a result of the COVID-19 pandemic, health systems have faced financial pressures which we believe led our customers to delay or defer purchasing decisions and/or implementation of our solutions during the first half of 2020. However, starting in the third quarter of 2020, we began to see our customers returning to pre-pandemic purchasing patterns consistent with long-term strategic investments. We believe that the challenges that our customers have faced during the COVID-19 pandemic, including the need for robust visibility throughout their pharmacy supply chains, have increased the strategic relevance of our products and services. Though we expect to continue to face challenges and opportunities brought on by the COVID-19 pandemic, we remain confident in the overall health of our business and in our ability to navigate through these unusual times."
    },
    "2319": {
        "CIK": "0000927653",
        "Company Name": "McKESSON CORPORATION",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "In response to the COVID-19 pandemic, federal, state, and local government directives and policies have been put in place in the U.S. to enhance availability of medications and supplies to meet the increased demand, assist front-line healthcare providers, manage public health concerns by creating social distancing, and address the economic impacts, including sharply reduced business activity, increased unemployment, and overall uncertainty presented by this healthcare emergency. Similar governmental actions have occurred in Canada and Europe, the timing of which has varied across geographies. In December 2020, the FDA issued an EUA for the Pfizer-BioNTech COVID-19 vaccine manufactured by Pfizer, Inc. (“Pfizer Vaccine”) and the Moderna COVID-19 vaccine manufactured by ModernaTX, Inc. (“Moderna Vaccine”) to be distributed in the U.S. These authorizations were followed by an EUA for the Janssen COVID-19 vaccine manufactured by Janssen Biotech Inc., a Janssen pharmaceutical company of Johnson & Johnson, (“Janssen Vaccine”) in February 2021. Government-coordinated administrative or allocation decisions at the federal, state, and local levels may cause variability in the timing and volume of COVID-19 vaccine distribution and administration activities. Our role in the distribution of COVID-19 vaccines in the U.S. as well as the assembly and distribution of related ancillary supply kits is discussed further below. Similar COVID-19 vaccine authorizations have occurred in Canada and Europe. McKesson Canada’s corporately owned retail pharmacy chain, Rexall, as well as independent pharmacy banners are supporting Canada’s vaccination efforts. McKesson Europe is also playing a role in helping support governments and public health entities in not only distributing COVID-19 vaccines across several European countries, but administering them in pharmacies as well.",
        "after": "As a global leader in healthcare supply chain management solutions, retail pharmacy, community oncology and specialty care, and healthcare information solutions, we are well positioned to respond to the COVID-19 pandemic in the U.S., Canada, and Europe. We have worked and continue to work closely with national and local governments, agencies, and industry partners to ensure that available supplies, including personal protective equipment (“PPE”), and medicine reach our customers and patients. "
    },
    "2331": {
        "CIK": "0000927653",
        "Company Name": "McKESSON CORPORATION",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "We also continue to monitor the COVID-19 pandemic impacts on our supply chain. Although the availability of various products is dependent on our suppliers, their locations, and the extent to which they are impacted by the COVID-19 pandemic, we are proactively working with manufacturers, industry partners, and government agencies to meet the needs of our customers during the pandemic. We have assembled a Critical Care Drug Task Force, made up of our procurement specialists, clinical health systems pharmacists, and supply chain professionals, that is focused on securing additional product where available, sourcing back-up products, and protecting our operations across all locations and facilities. We are also working with manufacturers through several channels, including our ClarusONE Sourcing Services LLP (“ClarusONE”) and global sourcing teams in London, and our leaders are actively engaged in addressing potential shortages. We have engaged with industry partners and government agencies to gain visibility into supply and demand. Additionally, we have a robust Business Continuity and Disaster Recovery Program (“BCRP”) and we have proactively enhanced our BCRP in response to the COVID-19 pandemic to protect the supply chain to minimize disruption in healthcare, protect our customers, ensure the safety and security of our employees and workplaces, and ensure the continuity of critical business processes. ",
        "after": "The situation remains fluid and we are taking a proactive approach to protect inventory during this crisis and ensure our provider partners have needed supplies and medications to help prevent the spread of the disease and treat those that are ill. COVID-19 has put an unprecedented strain on the supply of high-demand PPE, including N95 masks, gloves, as well as disinfecting sprays and wipes. The supply chain has improved over the initial impact of pandemic-related demand, and we continue to closely monitor demand by customer type and certain PPE and infection prevention items are still in short supply. Our allocation approach has helped us avoid stock outs in many critical product categories, allowing us to provide PPE supplies to many more customers for a much longer time. We anticipate these market conditions will remain for the foreseeable future. Our efforts to help the supply chain have included sourcing products from new suppliers all over the world, working closely with the federal government to help with the nation’s response and collaborating with partners to source, develop, and deliver new products to market. "
    },
    "2333": {
        "CIK": "0000927653",
        "Company Name": "McKESSON CORPORATION",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "before": "We also continue to monitor the COVID-19 pandemic impacts on our supply chain. Although the availability of various products is dependent on our suppliers, their locations, and the extent to which they are impacted by the COVID-19 pandemic, we are proactively working with manufacturers, industry partners, and government agencies to meet the needs of our customers during the pandemic. We have assembled a Critical Care Drug Task Force, made up of our procurement specialists, clinical health systems pharmacists, and supply chain professionals, that is focused on securing additional product where available, sourcing back-up products, and protecting our operations across all locations and facilities. We are also working with manufacturers through several channels, including our ClarusONE Sourcing Services LLP (“ClarusONE”) and global sourcing teams in London, and our leaders are actively engaged in addressing potential shortages. We have engaged with industry partners and government agencies to gain visibility into supply and demand. Additionally, we have a robust Business Continuity and Disaster Recovery Program (“BCRP”) and we have proactively enhanced our BCRP in response to the COVID-19 pandemic to protect the supply chain to minimize disruption in healthcare, protect our customers, ensure the safety and security of our employees and workplaces, and ensure the continuity of critical business processes. ",
        "match": "The situation remains fluid and we are taking a proactive approach to protect inventory during this crisis and ensure our provider partners have needed supplies and medications to help prevent the spread of the disease and treat those that are ill. COVID-19 has put an unprecedented strain on the supply of high-demand PPE, including N95 masks, gloves, as well as disinfecting sprays and wipes. The supply chain has improved over the initial impact of pandemic-related demand, and we continue to closely monitor demand by customer type and certain PPE and infection prevention items are still in short supply. Our allocation approach has helped us avoid stock outs in many critical product categories, allowing us to provide PPE supplies to many more customers for a much longer time. We anticipate these market conditions will remain for the foreseeable future. Our efforts to help the supply chain have included sourcing products from new suppliers all over the world, working closely with the federal government to help with the nation’s response and collaborating with partners to source, develop, and deliver new products to market. "
    },
    "2347": {
        "CIK": "0000927653",
        "Company Name": "McKESSON CORPORATION",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "In response to the COVID-19 pandemic, federal, state, and local government directives and policies have been put in place in the U.S. to enhance availability of medications and supplies to meet the increased demand, assist front-line healthcare providers, manage public health concerns by creating social distancing, and address the economic impacts, including sharply reduced business activity, increased unemployment, and overall uncertainty presented by this healthcare emergency. Similar governmental actions have occurred in Canada and Europe, the timing of which has varied across geographies. In December 2020, the FDA issued an EUA for the Pfizer-BioNTech COVID-19 vaccine manufactured by Pfizer, Inc. (“Pfizer Vaccine”) and the Moderna COVID-19 vaccine manufactured by ModernaTX, Inc. (“Moderna Vaccine”) to be distributed in the U.S. These authorizations were followed by an EUA for the Janssen COVID-19 vaccine manufactured by Janssen Biotech Inc., a Janssen pharmaceutical company of Johnson & Johnson, (“Janssen Vaccine”) in February 2021. Government-coordinated administrative or allocation decisions at the federal, state, and local levels may cause variability in the timing and volume of COVID-19 vaccine distribution and administration activities. Our role in the distribution of COVID-19 vaccines in the U.S. as well as the assembly and distribution of related ancillary supply kits is discussed further below. Similar COVID-19 vaccine authorizations have occurred in Canada and Europe. McKesson Canada’s corporately owned retail pharmacy chain, Rexall, as well as independent pharmacy banners are supporting Canada’s vaccination efforts. McKesson Europe is also playing a role in helping support governments and public health entities in not only distributing COVID-19 vaccines across several European countries, but administering them in pharmacies as well.",
        "after": "As a global leader in healthcare supply chain management solutions, retail pharmacy, community oncology and specialty care, and healthcare information solutions, we are well positioned to respond to the COVID-19 pandemic in the U.S., Canada, and Europe. We have worked and continue to work closely with national and local governments, agencies, and industry partners to ensure that available supplies, including personal protective equipment (“PPE”), and medicine reach our customers and patients. "
    },
    "2355": {
        "CIK": "0000927653",
        "Company Name": "McKESSON CORPORATION",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "We also continue to monitor the COVID-19 pandemic impacts on our supply chain. Although the availability of various products is dependent on our suppliers, their locations, and the extent to which they are impacted by the COVID-19 pandemic, we are proactively working with manufacturers, industry partners, and government agencies to meet the needs of our customers during the pandemic. We have assembled a Critical Care Drug Task Force, made up of our procurement specialists, clinical health systems pharmacists, and supply chain professionals, that is focused on securing additional product where available, sourcing back-up products, and protecting our operations across all locations and facilities. We are also working with manufacturers through several channels, including our ClarusONE Sourcing Services LLP (“ClarusONE”) and global sourcing teams in London, and our leaders are actively engaged in addressing potential shortages. We have engaged with industry partners and government agencies to gain visibility into supply and demand. Additionally, we have a robust Business Continuity and Disaster Recovery Program (“BCRP”) and we have proactively enhanced our BCRP in response to the COVID-19 pandemic to protect the supply chain to minimize disruption in healthcare, protect our customers, ensure the safety and security of our employees and workplaces, and ensure the continuity of critical business processes. ",
        "after": "The situation remains fluid and we are taking a proactive approach to protect inventory during this crisis and ensure our provider partners have needed supplies and medications to help prevent the spread of the disease and treat those that are ill. COVID-19 has put an unprecedented strain on the supply of high-demand PPE, including N95 masks, gloves, as well as disinfecting sprays and wipes. The supply chain has improved over the initial impact of pandemic-related demand, and we continue to closely monitor demand by customer type and certain PPE and infection prevention items are still in short supply. Our allocation approach has helped us avoid stock outs in many critical product categories, allowing us to provide PPE supplies to many more customers for a much longer time. We anticipate these market conditions will remain for the foreseeable future. Our efforts to help the supply chain have included sourcing products from new suppliers all over the world, working closely with the federal government to help with the nation’s response and collaborating with partners to source, develop, and deliver new products to market. "
    },
    "2357": {
        "CIK": "0000927653",
        "Company Name": "McKESSON CORPORATION",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "before": "We also continue to monitor the COVID-19 pandemic impacts on our supply chain. Although the availability of various products is dependent on our suppliers, their locations, and the extent to which they are impacted by the COVID-19 pandemic, we are proactively working with manufacturers, industry partners, and government agencies to meet the needs of our customers during the pandemic. We have assembled a Critical Care Drug Task Force, made up of our procurement specialists, clinical health systems pharmacists, and supply chain professionals, that is focused on securing additional product where available, sourcing back-up products, and protecting our operations across all locations and facilities. We are also working with manufacturers through several channels, including our ClarusONE Sourcing Services LLP (“ClarusONE”) and global sourcing teams in London, and our leaders are actively engaged in addressing potential shortages. We have engaged with industry partners and government agencies to gain visibility into supply and demand. Additionally, we have a robust Business Continuity and Disaster Recovery Program (“BCRP”) and we have proactively enhanced our BCRP in response to the COVID-19 pandemic to protect the supply chain to minimize disruption in healthcare, protect our customers, ensure the safety and security of our employees and workplaces, and ensure the continuity of critical business processes. ",
        "match": "The situation remains fluid and we are taking a proactive approach to protect inventory during this crisis and ensure our provider partners have needed supplies and medications to help prevent the spread of the disease and treat those that are ill. COVID-19 has put an unprecedented strain on the supply of high-demand PPE, including N95 masks, gloves, as well as disinfecting sprays and wipes. The supply chain has improved over the initial impact of pandemic-related demand, and we continue to closely monitor demand by customer type and certain PPE and infection prevention items are still in short supply. Our allocation approach has helped us avoid stock outs in many critical product categories, allowing us to provide PPE supplies to many more customers for a much longer time. We anticipate these market conditions will remain for the foreseeable future. Our efforts to help the supply chain have included sourcing products from new suppliers all over the world, working closely with the federal government to help with the nation’s response and collaborating with partners to source, develop, and deliver new products to market. "
    },
    "2373": {
        "CIK": "0000935703",
        "Company Name": "DOLLAR TREE, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "The future impact of COVID-19 on our customers is difficult to predict as the course of the pandemic, the effectiveness of health measures, and the impact of ongoing economic stabilization efforts is uncertain and government assistance payments may not provide enough funding to support current spending levels. The American Rescue Plan Act of 2021 (“Rescue Act”), which was enacted on March 11, 2021, provides U.S. government funding to address the continuing impact of COVID-19 on the economy, public health, individuals and businesses. Among other things, the Rescue Act provides for $1,400 direct payments to individuals, continues supplemental unemployment benefits until September 2021, extends a prior increase in food stamp benefits, expands the child tax credit and earned income tax credit, provides for rent and utility assistance, and funds COVID-19 vaccinations, testing, treatment and prevention. An increase in the federal minimum wage was not included in the Rescue Act as enacted. During fiscal 2020, we paid wage premiums to our store and distribution center associates as well as “Thank You” bonuses to our store managers in recognition of their extraordinary efforts during the COVID-19 pandemic, which increased our costs. We currently do not anticipate paying these types of premiums and bonuses in fiscal 2021.",
        "after": "As a result of COVID-19, our supply chain has been strained and our suppliers have faced challenges in keeping up with the unprecedented demand for essential goods, as well as discretionary goods. Recently, the ocean-shipping industry has faced capacity issues resulting in higher costs and delays in the shipment of products from Asia. We continue to make operational changes in an attempt to minimize the impact of these challenges on our business; however, we do not know how long these disruptions will continue. For additional information regarding the impact of COVID-19 on our business, refer to the discussion in this Item 1. below and “"
    },
    "2380": {
        "CIK": "0000935703",
        "Company Name": "DOLLAR TREE, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "In March 2020, the World Health Organization declared a pandemic arising from a novel strain of coronavirus and its related disease, known as COVID-19. Nations and governments at every level responded with significant actions to attempt to mitigate the public health crisis and the impact of the pandemic on the economy. The continuing COVID-19 pandemic and related public health measures have caused economic disruptions that have adversely affected, and are expected to continue to adversely affect, elements of our business. We have, however, been classified as an essential business and been allowed to remain open but our operational costs have increased significantly because of COVID-19. To date, sales at Family Dollar have increased during the pandemic. However, sales at Dollar Tree have been adversely affected, especially in our party departments and for Easter in 2020 and, as a result of fewer customer trips, in certain consumable departments such as snacks and candy.",
        "after": "There continues to be uncertainty and unpredictability about the impact of the COVID-19 pandemic on our financial and operating results in future periods. If the pandemic worsens or continues longer than expected, governments may reinstate or extend business or personal restrictions, and we could be forced to curtail or restrict operations or incur additional costs. Certain states and localities are considering laws that would require increasing the pay of store associates if we remain open when certain COVID-19 restrictions are implemented. We might also experience new disruptions in our supply chain and sources of supply, suffer facility closures or encounter difficulties in hiring or retaining the workforce required for our business. These circumstances, if applicable for an extended duration or across significant parts of our operating footprint, could have a material adverse effect on our business and results of operations."
    },
    "2392": {
        "CIK": "0000935703",
        "Company Name": "DOLLAR TREE, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "The future impact of COVID-19 on our customers and our business is difficult to predict. The course of the pandemic, the effectiveness of health measures such as vaccines, and the impact of ongoing economic stabilization efforts is uncertain and government assistance payments may not provide enough funding to support current spending. The American Rescue Plan Act of 2021 (“Rescue Act”), which was enacted on March 11, 2021, provides U.S. government funding to address the continuing impact of COVID-19 on the economy, public health, individuals and businesses. Among other things, the Rescue Act provides for $1,400 direct payments to individuals, continues supplemental unemployment benefits until September 2021, extends a prior increase in food stamp benefits, expands the child tax credit and earned income tax credit, provides for rent and utility assistance, and funds COVID-19 vaccinations, testing, treatment and prevention. An increase in the federal minimum wage was not included in the Rescue Act as enacted. ",
        "after": "The demand for essential supplies has increased and we are dependent on our suppliers to replenish the goods in our stores. Disruptions in our supply chain or sources of supply could adversely impact our sales."
    },
    "2394": {
        "CIK": "0000935703",
        "Company Name": "DOLLAR TREE, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "before": "The demand for essential supplies has increased and we are dependent on our suppliers to replenish the goods in our stores. Disruptions in our supply chain or sources of supply could adversely impact our sales.",
        "match": "Our new store openings in fiscal 2020 were affected by construction delays due to challenges with the permitting process during COVID-19. During 2020, we opened 341 new Dollar Tree stores and 156 new Family Dollar stores compared to an original plan of 350 new Dollar Tree stores and 200 new Family Dollar stores."
    },
    "2402": {
        "CIK": "0000935703",
        "Company Name": "DOLLAR TREE, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "The future impact of COVID-19 on our customers is difficult to predict as the course of the pandemic, the effectiveness of health measures, and the impact of ongoing economic stabilization efforts is uncertain and government assistance payments may not provide enough funding to support current spending levels. The American Rescue Plan Act of 2021 (“Rescue Act”), which was enacted on March 11, 2021, provides U.S. government funding to address the continuing impact of COVID-19 on the economy, public health, individuals and businesses. Among other things, the Rescue Act provides for $1,400 direct payments to individuals, continues supplemental unemployment benefits until September 2021, extends a prior increase in food stamp benefits, expands the child tax credit and earned income tax credit, provides for rent and utility assistance, and funds COVID-19 vaccinations, testing, treatment and prevention. An increase in the federal minimum wage was not included in the Rescue Act as enacted. During fiscal 2020, we paid wage premiums to our store and distribution center associates as well as “Thank You” bonuses to our store managers in recognition of their extraordinary efforts during the COVID-19 pandemic, which increased our costs. We currently do not anticipate paying these types of premiums and bonuses in fiscal 2021.",
        "after": "As a result of COVID-19, our supply chain has been strained and our suppliers have faced challenges in keeping up with the unprecedented demand for essential goods, as well as discretionary goods. Recently, the ocean-shipping industry has faced capacity issues resulting in higher costs and delays in the shipment of products from Asia. We continue to make operational changes in an attempt to minimize the impact of these challenges on our business; however, we do not know how long these disruptions will continue. For additional information regarding the impact of COVID-19 on our business, refer to the discussion in this Item 1. below and “"
    },
    "2407": {
        "CIK": "0000935703",
        "Company Name": "DOLLAR TREE, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "In March 2020, the World Health Organization declared a pandemic arising from a novel strain of coronavirus and its related disease, known as COVID-19. Nations and governments at every level responded with significant actions to attempt to mitigate the public health crisis and the impact of the pandemic on the economy. The continuing COVID-19 pandemic and related public health measures have caused economic disruptions that have adversely affected, and are expected to continue to adversely affect, elements of our business. We have, however, been classified as an essential business and been allowed to remain open but our operational costs have increased significantly because of COVID-19. To date, sales at Family Dollar have increased during the pandemic. However, sales at Dollar Tree have been adversely affected, especially in our party departments and for Easter in 2020 and, as a result of fewer customer trips, in certain consumable departments such as snacks and candy.",
        "after": "There continues to be uncertainty and unpredictability about the impact of the COVID-19 pandemic on our financial and operating results in future periods. If the pandemic worsens or continues longer than expected, governments may reinstate or extend business or personal restrictions, and we could be forced to curtail or restrict operations or incur additional costs. Certain states and localities are considering laws that would require increasing the pay of store associates if we remain open when certain COVID-19 restrictions are implemented. We might also experience new disruptions in our supply chain and sources of supply, suffer facility closures or encounter difficulties in hiring or retaining the workforce required for our business. These circumstances, if applicable for an extended duration or across significant parts of our operating footprint, could have a material adverse effect on our business and results of operations."
    },
    "2420": {
        "CIK": "0000935703",
        "Company Name": "DOLLAR TREE, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "The future impact of COVID-19 on our customers and our business is difficult to predict. The course of the pandemic, the effectiveness of health measures such as vaccines, and the impact of ongoing economic stabilization efforts is uncertain and government assistance payments may not provide enough funding to support current spending. The American Rescue Plan Act of 2021 (“Rescue Act”), which was enacted on March 11, 2021, provides U.S. government funding to address the continuing impact of COVID-19 on the economy, public health, individuals and businesses. Among other things, the Rescue Act provides for $1,400 direct payments to individuals, continues supplemental unemployment benefits until September 2021, extends a prior increase in food stamp benefits, expands the child tax credit and earned income tax credit, provides for rent and utility assistance, and funds COVID-19 vaccinations, testing, treatment and prevention. An increase in the federal minimum wage was not included in the Rescue Act as enacted. ",
        "after": "The demand for essential supplies has increased and we are dependent on our suppliers to replenish the goods in our stores. Disruptions in our supply chain or sources of supply could adversely impact our sales."
    },
    "2429": {
        "CIK": "0000936340",
        "Company Name": "DTE Energy Co",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "COVID-19 Pandemic",
        "after": "DTE Energy will continue to monitor the impact of the COVID-19 pandemic on supply chains, markets, counterparties, and customers, and any related impacts on the operating costs, customer demand, and recoverability of assets in our business segments that could materially impact the Registrants' financial results."
    },
    "2517": {
        "CIK": "0001002910",
        "Company Name": "Ameren Corporation",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "Our results of operations and financial position are affected by many factors. Economic conditions, including those resulting from the COVID-19 pandemic discussed below, energy-efficiency investments by our customers and by us, technological advances, distributed generation, and the actions of key customers can significantly affect the demand for our services. Ameren and Ameren Missouri results are also affected by seasonal fluctuations in winter heating and summer cooling demands, as well as by energy center maintenance outages. Additionally, fluctuations in interest rates and conditions in the capital and credit markets affect our cost of borrowing, and our pension and postretirement benefits costs. Almost all of Ameren’s revenues are subject to state or federal regulation. This regulation has a material impact on the rates we charge customers for our services. Our results of operations, financial position, and liquidity are affected by our ability to align our overall spending, both operating and capital, with the frameworks established by our regulators. See Note 2 – Rate and Regulatory Matters under Part II, Item 8, of this report for additional information regarding Ameren Missouri’s, Ameren Illinois’, and ATXI’s regulatory frameworks.",
        "after": "We continue to assess the impacts of the COVID-19 pandemic on our businesses, including impacts on electric and natural gas sales volumes, supply chain operations, and bad debt expense. Ameren Missouri and Ameren Illinois suspended customer disconnections and late "
    },
    "2524": {
        "CIK": "0001002910",
        "Company Name": "Ameren Corporation",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "Our results of operations and financial position are affected by many factors. Economic conditions, including those resulting from the COVID-19 pandemic discussed below, energy-efficiency investments by our customers and by us, technological advances, distributed generation, and the actions of key customers can significantly affect the demand for our services. Ameren and Ameren Missouri results are also affected by seasonal fluctuations in winter heating and summer cooling demands, as well as by energy center maintenance outages. Additionally, fluctuations in interest rates and conditions in the capital and credit markets affect our cost of borrowing, and our pension and postretirement benefits costs. Almost all of Ameren’s revenues are subject to state or federal regulation. This regulation has a material impact on the rates we charge customers for our services. Our results of operations, financial position, and liquidity are affected by our ability to align our overall spending, both operating and capital, with the frameworks established by our regulators. See Note 2 – Rate and Regulatory Matters under Part II, Item 8, of this report for additional information regarding Ameren Missouri’s, Ameren Illinois’, and ATXI’s regulatory frameworks.",
        "after": "We continue to assess the impacts of the COVID-19 pandemic on our businesses, including impacts on electric and natural gas sales volumes, supply chain operations, and bad debt expense. Ameren Missouri and Ameren Illinois suspended customer disconnections and late "
    },
    "2618": {
        "CIK": "0001021162",
        "Company Name": "Triumph Group, Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": " unable at this time to reasonably estimate potential future additional financial impacts or a range of loss, if any, due to continued uncertainties related to the impacts of COVID-19 on our operations, supply chain and customers, future changes to OEM ",
        "after": "production rates, supply chain impacts, and/or the results of negotiations with particular customers. Any such impacts, including any changes in our estimates, could have a material adverse effect on our financial position, results of operations, and/or cash flows. "
    },
    "2778": {
        "CIK": "0001037646",
        "Company Name": "Mettler-Toledo International Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "The COVID-19 pandemic has resulted in millions of confirmed cases throughout the world and in all countries where we conduct business. The outbreak has caused many governments to implement stay-at-home orders, quarantines, and significant restrictions on travel. Several governments have also implemented work restrictions that prohibit many employees from going to their customary work locations and that require these employees to work remotely if possible. Quarantines, travel bans, work and other restrictions were initially put in place on a national level in China in January 2020, and with the global spread of the virus, subsequently adopted in other countries and regions with many restrictions in Asia Pacific, Europe, North America, and South America. These restrictions continue to change as COVID-19 evolves in each country and region.",
        "after": "The health and safety of our employees and business partners have been our highest priority throughout the COVID-19 pandemic, and we have implemented several preventative and protective measures relating to social distancing, hygiene, health monitoring, personal protective equipment, split shifts, and remote work. We have also implemented business continuity plans and have been able to continue to support our customers with their essential businesses such as life sciences, food manufacturing, chemicals (e.g., sanitizers, disinfectants, soaps, etc.), food retail, and transportation and logistics. Our production and logistics facilities are currently operational, and our office-based employees have been able to work remotely in adherence to applicable jurisdictional stay-at-home orders. Our supply chain is currently continuing with minimal interruption, and we generally maintain adequate product inventory levels and safety stock for certain components. We quickly adapted to leverage our digital and remote sales and service capabilities, while also meeting delivery requirements with our global supply chain. Our service organization also continues to provide on-site and remote customer support to facilitate uptime, productivity, and regulatory compliance."
    },
    "2789": {
        "CIK": "0001037646",
        "Company Name": "Mettler-Toledo International Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "The COVID-19 pandemic has resulted in millions of confirmed cases throughout the world and in all countries where we conduct business. The outbreak has caused many governments to implement stay-at-home orders, quarantines, and significant restrictions on travel. Several governments have also implemented work restrictions that prohibit many employees from going to their customary work locations and that require these employees to work remotely if possible. Quarantines, travel bans, work and other restrictions were initially put in place on a national level in China in January 2020, and with the global spread of the virus, subsequently adopted in other countries and regions with many restrictions in Asia Pacific, Europe, North America, and South America. These restrictions continue to change as COVID-19 evolves in each country and region.",
        "after": "The health and safety of our employees and business partners have been our highest priority throughout the COVID-19 pandemic, and we have implemented several preventative and protective measures relating to social distancing, hygiene, health monitoring, personal protective equipment, split shifts, and remote work. We have also implemented business continuity plans and have been able to continue to support our customers with their essential businesses such as life sciences, food manufacturing, chemicals (e.g., sanitizers, disinfectants, soaps, etc.), food retail, and transportation and logistics. Our production and logistics facilities are currently operational, and our office-based employees have been able to work remotely in adherence to applicable jurisdictional stay-at-home orders. Our supply chain is currently continuing with minimal interruption, and we generally maintain adequate product inventory levels and safety stock for certain components. We quickly adapted to leverage our digital and remote sales and service capabilities, while also meeting delivery requirements with our global supply chain. Our service organization also continues to provide on-site and remote customer support to facilitate uptime, productivity, and regulatory compliance."
    },
    "2806": {
        "CIK": "0001042893",
        "Company Name": "DRIL-QUIP, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": " and $6.6 million in surface equipment, partially offset by increased revenues of $0.6 million in offshore rig equipment and $0.4 million in downhole tools. Total revenues decreased in the Eastern Hemisphere by $38.9 million, in the Western Hemisphere by $11.6 million, partially offset by increase in revenues in Asia-Pacific by $0.7 million. The Company’s revenues were negatively impacted by customers requesting extensions on their deliveries, orders and projects being delayed, disruptions to supply chain and production output and an increase in the number of employees in quarantine. All of these negative impacts were attributable to both the COVID-19 pandemic and developments in the global oil markets. ",
        "after": "During the first quarter of 2020 as the COVID-19 pandemic outbreak began to affect the global markets, our revenues were negatively impacted by reduced productivity, customers requesting extension of their deliveries and supply chain disruptions. Although all regions were impacted to differing degrees, the initial impact earlier in the year was most felt in the Asia-Pacific region. Further, as a result of supply chain interruptions to our wellhead business in Europe we shifted our focus to pipe fabrication which invariably has lower gross margins. As the year progressed, the effects of the COVID-19 pandemic spread globally and continued to cause delays and disruptions to our production schedule. In the fourth quarter of 2020, as the COVID-19 cases began to rise again, we witnessed an increase of our plant workers requiring quarantine resulting in lower production output and consequently lower revenue compared to the prior year. Overall, stagnant demand and reduced productivity negatively impacted our revenue during the year as a result of the developments discussed in this section. In any given time period, the revenues recognized between the various product lines and geographic areas will vary depending upon the timing of shipments to customers, completion status of the projects accounted for under the over time accounting method, market conditions and customer demand."
    },
    "2812": {
        "CIK": "0001042893",
        "Company Name": "DRIL-QUIP, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": " and $6.6 million in surface equipment, partially offset by increased revenues of $0.6 million in offshore rig equipment and $0.4 million in downhole tools. Total revenues decreased in the Eastern Hemisphere by $38.9 million, in the Western Hemisphere by $11.6 million, partially offset by increase in revenues in Asia-Pacific by $0.7 million. The Company’s revenues were negatively impacted by customers requesting extensions on their deliveries, orders and projects being delayed, disruptions to supply chain and production output and an increase in the number of employees in quarantine. All of these negative impacts were attributable to both the COVID-19 pandemic and developments in the global oil markets. ",
        "after": "During the first quarter of 2020 as the COVID-19 pandemic outbreak began to affect the global markets, our revenues were negatively impacted by reduced productivity, customers requesting extension of their deliveries and supply chain disruptions. Although all regions were impacted to differing degrees, the initial impact earlier in the year was most felt in the Asia-Pacific region. Further, as a result of supply chain interruptions to our wellhead business in Europe we shifted our focus to pipe fabrication which invariably has lower gross margins. As the year progressed, the effects of the COVID-19 pandemic spread globally and continued to cause delays and disruptions to our production schedule. In the fourth quarter of 2020, as the COVID-19 cases began to rise again, we witnessed an increase of our plant workers requiring quarantine resulting in lower production output and consequently lower revenue compared to the prior year. Overall, stagnant demand and reduced productivity negatively impacted our revenue during the year as a result of the developments discussed in this section. In any given time period, the revenues recognized between the various product lines and geographic areas will vary depending upon the timing of shipments to customers, completion status of the projects accounted for under the over time accounting method, market conditions and customer demand."
    },
    "2952": {
        "CIK": "0001050825",
        "Company Name": "STEELCASE INC",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "Revenue of $2,596.2 in 2021 represented a decrease of $1,127.5, or 30%, compared to the prior year.  The decline was broad-based across all segments due to the impacts of the COVID-19 pandemic.  Revenue declined by 31% in the Americas, 24% in EMEA and 38% in the Other category.  After adjusting for a $61.5 impact from the divestiture of PolyVision, $48.4 from an additional week in 2020, $23.0 of currency translation effects and $2.2 from an acquisition, the organic revenue decline was $1,042.8 or 29% compared to the prior year.  The organic revenue decline was 30% in the Americas, 26% in EMEA and 25% in the Other category. ",
        "after": "Cost of sales as a percentage of revenue increased by 280 basis points to 70.2% of revenue in 2021 compared to 2020.  Cost of sales as a percentage of revenue increased by 260 basis points in the Americas, 370 basis points in EMEA and 190 basis points in the Other category compared to the prior year.  The year-over-year increase was driven by the decrease in revenue and approximately $15 of higher costs related to direct labor and logistics inefficiencies as a result of disruptions and supply chain challenges experienced throughout the year, partially offset by:"
    },
    "2955": {
        "CIK": "0001050825",
        "Company Name": "STEELCASE INC",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "The Americas revenue represented 71.2% of consolidated revenue in 2021.  Revenue for 2021 of $1,848.5 represented a decrease of $824.4 or 31% compared to 2020.  The decline was driven by reduced industry demand due to the COVID-19 pandemic.  After adjusting for the $42.7 impact from the additional week in 2020, $2.2 from an acquisition and $0.8 of currency translation effects, revenue in 2021 declined by $783.1 or 30% on an organic basis compared to the prior year.",
        "after": "Cost of sales as a percentage of revenue increased by 260 basis points to 69.5% of revenue in 2021 compared to the prior year.  The year-over-year increase was driven by the decrease in revenue and approximately $14 of higher costs related to direct labor and logistics inefficiencies as a result of disruptions and supply chain challenges experienced throughout the year, partially offset by:"
    },
    "2964": {
        "CIK": "0001050825",
        "Company Name": "STEELCASE INC",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "Revenue of $2,596.2 in 2021 represented a decrease of $1,127.5, or 30%, compared to the prior year.  The decline was broad-based across all segments due to the impacts of the COVID-19 pandemic.  Revenue declined by 31% in the Americas, 24% in EMEA and 38% in the Other category.  After adjusting for a $61.5 impact from the divestiture of PolyVision, $48.4 from an additional week in 2020, $23.0 of currency translation effects and $2.2 from an acquisition, the organic revenue decline was $1,042.8 or 29% compared to the prior year.  The organic revenue decline was 30% in the Americas, 26% in EMEA and 25% in the Other category. ",
        "after": "Cost of sales as a percentage of revenue increased by 280 basis points to 70.2% of revenue in 2021 compared to 2020.  Cost of sales as a percentage of revenue increased by 260 basis points in the Americas, 370 basis points in EMEA and 190 basis points in the Other category compared to the prior year.  The year-over-year increase was driven by the decrease in revenue and approximately $15 of higher costs related to direct labor and logistics inefficiencies as a result of disruptions and supply chain challenges experienced throughout the year, partially offset by:"
    },
    "2967": {
        "CIK": "0001050825",
        "Company Name": "STEELCASE INC",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "The Americas revenue represented 71.2% of consolidated revenue in 2021.  Revenue for 2021 of $1,848.5 represented a decrease of $824.4 or 31% compared to 2020.  The decline was driven by reduced industry demand due to the COVID-19 pandemic.  After adjusting for the $42.7 impact from the additional week in 2020, $2.2 from an acquisition and $0.8 of currency translation effects, revenue in 2021 declined by $783.1 or 30% on an organic basis compared to the prior year.",
        "after": "Cost of sales as a percentage of revenue increased by 260 basis points to 69.5% of revenue in 2021 compared to the prior year.  The year-over-year increase was driven by the decrease in revenue and approximately $14 of higher costs related to direct labor and logistics inefficiencies as a result of disruptions and supply chain challenges experienced throughout the year, partially offset by:"
    },
    "3005": {
        "CIK": "0001058057",
        "Company Name": "Marvell Technology Group Ltd",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "before": "In response to growth in demand from customers for our products, our operations team is continuing to ramp production with our global supply chain partners. However, we have begun to experience a number of industry-wide supply constraints affecting the type of high complexity products we provide for data infrastructure. These supply challenges are currently limiting our ability to fully satisfy the increase in demand for some of our products. ",
        "match": "We continue to monitor the impact of COVID-19 on our business. While many of our offices around the world remain open to enable critical on-site business functions in accordance with local government guidelines, the majority of our employees continue to work from home. During fiscal 2021, some of our customers have reported adverse impacts on demand for their products due to COVID-19. We have seen a reduction in demand for products from customers in the enterprise networking, and enterprise server and storage end markets. We expect COVID-19 to continue to impact our business and for a further discussion of the uncertainties and business risks associated with the COVID-19 pandemic, see Part I, Item 1A, “Risk Factors,” including but not limited to the risk detailed under the caption “"
    },
    "3009": {
        "CIK": "0001058057",
        "Company Name": "Marvell Technology Group Ltd",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "before": "In response to growth in demand from customers for our products, our operations team is continuing to ramp production with our global supply chain partners. However, we have begun to experience a number of industry-wide supply constraints affecting the type of high complexity products we provide for data infrastructure. These supply challenges are currently limiting our ability to fully satisfy the increase in demand for some of our products. ",
        "match": "We continue to monitor the impact of COVID-19 on our business. While many of our offices around the world remain open to enable critical on-site business functions in accordance with local government guidelines, the majority of our employees continue to work from home. During fiscal 2021, some of our customers have reported adverse impacts on demand for their products due to COVID-19. We have seen a reduction in demand for products from customers in the enterprise networking, and enterprise server and storage end markets. We expect COVID-19 to continue to impact our business and for a further discussion of the uncertainties and business risks associated with the COVID-19 pandemic, see Part I, Item 1A, “Risk Factors,” including but not limited to the risk detailed under the caption “"
    },
    "3020": {
        "CIK": "0001058867",
        "Company Name": "GUARANTY BANCSHARES, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "before": "The spread of COVID-19 has created a global public health crisis that has resulted in unprecedented uncertainty, volatility and disruption in financial markets and in governmental, commercial and consumer activity in the United States and globally. Governmental responses to the pandemic have included orders closing businesses not deemed essential and directing individuals to restrict their movements, observe social distancing and shelter in place. These actions, together with responses to the pandemic by businesses and individuals, have resulted in rapid decreases in commercial and consumer activity, temporary closures of many businesses that have led to loss of revenues and a rapid increase in unemployment, material decreases in oil and gas prices and in business valuations, disrupted global supply chains, market downturns and volatility, changes in consumer behavior related to pandemic fears, related emergency response legislation and an expectation that Federal Reserve policy will maintain a low interest rate environment for the foreseeable future. These changes have a significant adverse effect on the markets in which we conduct our business and the demand for our products and services.",
        "match": "Business and consumer customers of the Bank are experiencing varying degrees of financial distress, which may adversely affect their ability to timely pay interest and principal on their loans and the value of the collateral securing their obligations. This in turn has influenced the recognition of credit losses in our loan portfolios and has increased our allowance for credit losses. Disruptions to our customers' businesses could also result in declines in, among other things, wealth management revenue. These developments as a consequence of the pandemic have materially impacted our business and the businesses of our customers and may have a material adverse effect on our financial results in future periods."
    },
    "3089": {
        "CIK": "0001071255",
        "Company Name": "GOLDEN ENTERTAINMENT, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "Impact of COVID-19",
        "after": "Since the declaration of COVID-19 as a pandemic on March 11, 2020, people across the globe have been advised to avoid non-essential travel, and steps have been taken by governmental authorities, including in the states in which we operate, to implement closures of non-essential operations to contain the spread of the virus. The pandemic has negatively impacted the global economy, disrupted global supply chains and created significant volatility and disruption of financial markets. Following emergency executive orders issued by the Governors of Nevada, Maryland, and Montana, in the week of March 16, 2020, all of our properties were temporarily closed to the public and our Distributed Gaming operations at third-party locations were suspended. Our Distributed Gaming operations in Montana and Nevada resumed on May 4, 2020 and June 4, 2020, respectively, and our Casino operations in Nevada and Maryland resumed on June 4, 2020 and June 19, 2020, respectively. However, as a result of the impact of the pandemic, the operations of the Colorado Belle remain suspended. While all of our properties, except for the Colorado Belle, re-opened during the second quarter of 2020, our implementation of protocols intended to protect team members, gaming patrons and guests from potential COVID-19 exposure continues to limit our operations. These measures include enhanced sanitization, public gathering limitations of 25-50% of casino, tavern and venue capacity, patron social distancing requirements, restrictions on permitted hours of operations, limitations on casino operations, which include disabling electronic gaming machines, and face mask and temperature check requirements for patrons. Certain amenities at our casinos may remain closed or operate in a limited capacity, including restaurants, bars, and other food and beverage outlets, as well as table games, showrooms, meeting rooms, spas and pools. These measures limit the number of patrons that are able to attend these venues. We cannot predict when these restrictions on our operations will be changed or eliminated."
    },
    "3146": {
        "CIK": "0001089063",
        "Company Name": "DICK'S SPORTING GOODS, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "before": "The retail industry as a whole is dynamic, and sporting goods retail in particular has faced significant disruption in recent years, as several sporting goods retailers have gone out of business. Vendors have broadened their distribution into department stores and family footwear channels while continuing to grow their direct to consumer business. We have responded to these challenges by reallocating floor space to growing categories while focusing on driving profitable sales, emphasizing a refined merchandise assortment that delivers newness, innovation and exclusivity. We have also made strategic investments in our supply chain, digital capabilities, athlete experience, vertical brands and employees, to whom we refer as teammates, to support these efforts and have focused on increasing productivity, while eliminating non-essential expenses, which has enabled us to fund our future strategic investments. ",
        "match": "COVID-19 Update "
    },
    "3209": {
        "CIK": "0001101239",
        "Company Name": "EQUINIX, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "Most of our corporate offices remain closed as a result of the pandemic and we instructed our non-IBX employees in these offices to work from home until further notice. We have announced a phased plan for return-to-office for non-IBX attached sites and have been following this plan to open certain offices with occupancy limits as local conditions allow. Additionally, we have decided to continue to limit employee travel and postpone or virtualize global events in response to the COVID-19 pandemic.",
        "after": "We are experiencing some construction delays, however, to date, the construction delays and additional costs are insignificant relative to the overall project duration and budget. Equipment for construction projects which are scheduled to be placed in the near future has been ordered, and is currently being manufactured or delivered with minimal delays. We are actively monitoring our vendors and suppliers to evaluate any anticipated changes in equipment availability or delivery timetables. We have redundancies built into our supply chain of vendors and, to the best of our ability, we keep a stock of critical items on site to ensure repairs can be completed. To date, we have not observed any significant disruption to our IBX data center operations due to supply chain impacts from the COVID-19 pandemic. "
    },
    "3212": {
        "CIK": "0001101239",
        "Company Name": "EQUINIX, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "before": "We are experiencing some construction delays, however, to date, the construction delays and additional costs are insignificant relative to the overall project duration and budget. Equipment for construction projects which are scheduled to be placed in the near future has been ordered, and is currently being manufactured or delivered with minimal delays. We are actively monitoring our vendors and suppliers to evaluate any anticipated changes in equipment availability or delivery timetables. We have redundancies built into our supply chain of vendors and, to the best of our ability, we keep a stock of critical items on site to ensure repairs can be completed. To date, we have not observed any significant disruption to our IBX data center operations due to supply chain impacts from the COVID-19 pandemic. ",
        "match": "During the year ended December 31, 2020, the COVID-19 pandemic did not have a material impact on our results of operations. The majority of our revenue is derived from large companies across a diverse set of industries. Customers operating in sectors more drastically impacted by the COVID-19 pandemic, such as retail, travel, and energy, made up an insignificant percentage of our revenue. Smart Hands service revenues declined during the year ended December 31, 2020, as we waived Smart Hands service fees from the affected customers in certain circumstances during the first few months of the pandemic. We ceased to waive Smart Hands service fees for most customers as of June 30, 2020. We assessed realized and potential credit deterioration of our customers due to changes in the macroeconomic environment, considered the potential for payment term revision requests, and as a result, increased our allowance for credit losses for accounts receivable by an insignificant amount for the year ended December 31, 2020. We also incurred one-time cash bonuses and compensation expense of $8.6 million for our IBX employees as well as other employees to support their work-from-home requirements during the first quarter of 2020. We have experienced some travel expense savings during the year ended December 31, 2020 resulting from travel restrictions imposed in response to the COVID-19 pandemic."
    },
    "3223": {
        "CIK": "0001101239",
        "Company Name": "EQUINIX, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "Most of our corporate offices remain closed as a result of the pandemic and we instructed our non-IBX employees in these offices to work from home until further notice. We have announced a phased plan for return-to-office for non-IBX attached sites and have been following this plan to open certain offices with occupancy limits as local conditions allow. Additionally, we have decided to continue to limit employee travel and postpone or virtualize global events in response to the COVID-19 pandemic.",
        "after": "We are experiencing some construction delays, however, to date, the construction delays and additional costs are insignificant relative to the overall project duration and budget. Equipment for construction projects which are scheduled to be placed in the near future has been ordered, and is currently being manufactured or delivered with minimal delays. We are actively monitoring our vendors and suppliers to evaluate any anticipated changes in equipment availability or delivery timetables. We have redundancies built into our supply chain of vendors and, to the best of our ability, we keep a stock of critical items on site to ensure repairs can be completed. To date, we have not observed any significant disruption to our IBX data center operations due to supply chain impacts from the COVID-19 pandemic. "
    },
    "3226": {
        "CIK": "0001101239",
        "Company Name": "EQUINIX, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "before": "We are experiencing some construction delays, however, to date, the construction delays and additional costs are insignificant relative to the overall project duration and budget. Equipment for construction projects which are scheduled to be placed in the near future has been ordered, and is currently being manufactured or delivered with minimal delays. We are actively monitoring our vendors and suppliers to evaluate any anticipated changes in equipment availability or delivery timetables. We have redundancies built into our supply chain of vendors and, to the best of our ability, we keep a stock of critical items on site to ensure repairs can be completed. To date, we have not observed any significant disruption to our IBX data center operations due to supply chain impacts from the COVID-19 pandemic. ",
        "match": "During the year ended December 31, 2020, the COVID-19 pandemic did not have a material impact on our results of operations. The majority of our revenue is derived from large companies across a diverse set of industries. Customers operating in sectors more drastically impacted by the COVID-19 pandemic, such as retail, travel, and energy, made up an insignificant percentage of our revenue. Smart Hands service revenues declined during the year ended December 31, 2020, as we waived Smart Hands service fees from the affected customers in certain circumstances during the first few months of the pandemic. We ceased to waive Smart Hands service fees for most customers as of June 30, 2020. We assessed realized and potential credit deterioration of our customers due to changes in the macroeconomic environment, considered the potential for payment term revision requests, and as a result, increased our allowance for credit losses for accounts receivable by an insignificant amount for the year ended December 31, 2020. We also incurred one-time cash bonuses and compensation expense of $8.6 million for our IBX employees as well as other employees to support their work-from-home requirements during the first quarter of 2020. We have experienced some travel expense savings during the year ended December 31, 2020 resulting from travel restrictions imposed in response to the COVID-19 pandemic."
    },
    "3333": {
        "CIK": "0001128361",
        "Company Name": "HOPE BANCORP, INC",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "On March 11, 2020, the World Health Organization declared the novel coronavirus (“COVID-19”) a global pandemic. The COVID-19 pandemic has had a material and adverse impact on our business, financial condition, and results of operations and any further impact will depend on future developments that cannot be predicted, including the scope and duration of the pandemic, the economic implications of the same, effectiveness of vaccines being distributed, and the continued actions taken by governmental authorities in response to the pandemic.",
        "after": "The COVID-19 pandemic has substantially and negatively impacted the United States economy, disrupted global supply chains, considerably lowered equity market valuations, created significant volatility and disruption in financial markets, and materially increased unemployment levels. In addition, the pandemic has resulted in permanent and temporary closures of countless businesses and the institution of social distancing and sheltering in place requirements in most states and communities. Although some states and business have reopened, the last wave of COVID-19 cases resulted in further shutdowns and closures. Although COVID-19 vaccines are currently being distributed, it is unknown how long it will take for the vaccines to have a significant positive impact in reducing COVID-19 cases and how effective the vaccine will be for new emerging strains of the COVID-19 virus. The demand for our products and services has been and likely will continue to be significantly adversely impacted, which would continue to materially and adversely affect our financial condition and results of operations. Furthermore, the pandemic could result in the recognition of amplified credit losses in our loan portfolios and increases in our allowance for credit losses, particularly as more and more businesses are closed. Similarly, because of changing economic and market conditions, we may be required to recognize impairments on goodwill or impairment on other financial instruments we hold. "
    },
    "3345": {
        "CIK": "0001128361",
        "Company Name": "HOPE BANCORP, INC",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "On March 11, 2020, the World Health Organization declared the novel coronavirus (“COVID-19”) a global pandemic. The COVID-19 pandemic has had a material and adverse impact on our business, financial condition, and results of operations and any further impact will depend on future developments that cannot be predicted, including the scope and duration of the pandemic, the economic implications of the same, effectiveness of vaccines being distributed, and the continued actions taken by governmental authorities in response to the pandemic.",
        "after": "The COVID-19 pandemic has substantially and negatively impacted the United States economy, disrupted global supply chains, considerably lowered equity market valuations, created significant volatility and disruption in financial markets, and materially increased unemployment levels. In addition, the pandemic has resulted in permanent and temporary closures of countless businesses and the institution of social distancing and sheltering in place requirements in most states and communities. Although some states and business have reopened, the last wave of COVID-19 cases resulted in further shutdowns and closures. Although COVID-19 vaccines are currently being distributed, it is unknown how long it will take for the vaccines to have a significant positive impact in reducing COVID-19 cases and how effective the vaccine will be for new emerging strains of the COVID-19 virus. The demand for our products and services has been and likely will continue to be significantly adversely impacted, which would continue to materially and adversely affect our financial condition and results of operations. Furthermore, the pandemic could result in the recognition of amplified credit losses in our loan portfolios and increases in our allowance for credit losses, particularly as more and more businesses are closed. Similarly, because of changing economic and market conditions, we may be required to recognize impairments on goodwill or impairment on other financial instruments we hold. "
    },
    "3445": {
        "CIK": "0001166003",
        "Company Name": "XPO Logistics, Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "Impacts of COVID-19",
        "after": "As a global provider of supply chain solutions, our business can be impacted to varying degrees by factors beyond our control. The rapid escalation of COVID-19 into a pandemic in 2020 has affected, and will continue to affect, economic activity broadly and customer sectors served by our industry. "
    },
    "3447": {
        "CIK": "0001166003",
        "Company Name": "XPO Logistics, Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "As a global provider of supply chain solutions, our business can be impacted to varying degrees by factors beyond our control. The rapid escalation of COVID-19 into a pandemic in 2020 has affected, and will continue to affect, economic activity broadly and customer sectors served by our industry. ",
        "after": "In response to the COVID-19 pandemic, the governments of many countries, states, cities and other geographic regions have taken and are continuing to take preventative or reactive actions, such as imposing restrictions on travel and business operations and establishing guidelines for social distancing and occupational safety. Due to the critical role we play in moving goods and equipment in the markets we serve, XPO is considered an “essential business,” providing supply chain solutions to crucial industries and delivering critical consumer goods. As a result, our sites have generally remained open and operating, and we have continued to serve our customers while employing significant measures to protect our employees and keep them safe."
    },
    "3463": {
        "CIK": "0001166003",
        "Company Name": "XPO Logistics, Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "As a global provider of supply chain solutions, our business can be impacted to varying degrees by factors beyond our control. The rapid escalation of COVID-19 into a pandemic in 2020 has affected, and will continue to affect, economic activity broadly and customer sectors served by our industry. ",
        "after": "In response to the COVID-19 pandemic, the governments of many countries, states, cities and other geographic regions have taken and are continuing to take preventative or reactive actions, such as imposing restrictions on travel and business operations and establishing guidelines for social distancing and occupational safety. Due to the critical role we play in moving goods and equipment in the markets we serve, XPO is considered an “essential business,” providing supply chain solutions to crucial industries and delivering critical consumer goods. As a result, our sites have generally remained open and operating, and we have continued to serve our customers while employing significant measures to protect our employees and keep them safe."
    },
    "3565": {
        "CIK": "0001212545",
        "Company Name": "WESTERN ALLIANCE BANCORPORATION",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "Recent Developments: COVID-19 and the CARES Act",
        "after": "The ongoing COVID-19 global and national health emergency has caused significant disruption in the United States and international economies and financial markets. The spread of COVID-19 in the United States has caused illness, quarantines, cancellation of events and travel, business and school shutdowns, reduction in commercial activity and financial transactions, supply chain interruptions, increased unemployment, and overall economic and financial market instability. Many states, including Arizona, where we are headquartered, and California and Nevada, in which we have significant operations, continue to be significantly impacted by the pandemic. "
    },
    "3568": {
        "CIK": "0001212545",
        "Company Name": "WESTERN ALLIANCE BANCORPORATION",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "before": "The ongoing COVID-19 global and national health emergency has caused significant disruption in the United States and international economies and financial markets. The spread of COVID-19 in the United States has caused illness, quarantines, cancellation of events and travel, business and school shutdowns, reduction in commercial activity and financial transactions, supply chain interruptions, increased unemployment, and overall economic and financial market instability. Many states, including Arizona, where we are headquartered, and California and Nevada, in which we have significant operations, continue to be significantly impacted by the pandemic. ",
        "match": "The CARES Act was enacted in March 2020 and provides for approximately $2.2 trillion in emergency economic relief measures including, among other things, loan programs for small and mid-sized businesses and other economic relief for impacted businesses and industries, including financial institutions. Separately, and also in response to COVID-19, the Federal Reserve’s FOMC has set the federal funds target rate - i.e., the interest rate at which depository institutions such as the Bank lend reserve balances to other depository institutions overnight on an uncollateralized basis - to a historic low. In March 2020, the FOMC set the federal funds target rate at 0 to 0.25 percent."
    },
    "3861": {
        "CIK": "0001324404",
        "Company Name": "CF INDUSTRIES HOLDINGS, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "In March 2020, the World Health Organization characterized the outbreak of coronavirus disease 2019 (COVID-19) as a pandemic. Since that time, efforts to slow the spread of COVID-19 have intensified. A number of countries, as well as certain states and cities within the United States, have continued to enact temporary closures of businesses, to issue shelter in place or quarantine orders, and to take other restrictive measures in response to the pandemic. ",
        "after": "Due to the use of fertilizer products in crop production to support the global food supply chain, our business operations were designated as part of the critical infrastructure by the United States and as essential businesses in the United Kingdom and Canada, with corresponding designations for those states and provinces in which we operate that issued restrictive orders. As a result, our manufacturing complexes continued to operate during 2020 and have continued to operate through the date of this report. Our production of ammonia, the basic building block for our products, was 10.4 million tons in 2020 compared to 10.2 million tons in 2019. Through the date of this filing, we have continued to ship products by all modes of transportation to our customers, and we have not experienced any significant delays in marine, rail or truck transportation services due to the pandemic."
    },
    "3863": {
        "CIK": "0001324404",
        "Company Name": "CF INDUSTRIES HOLDINGS, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "before": "Due to the use of fertilizer products in crop production to support the global food supply chain, our business operations were designated as part of the critical infrastructure by the United States and as essential businesses in the United Kingdom and Canada, with corresponding designations for those states and provinces in which we operate that issued restrictive orders. As a result, our manufacturing complexes continued to operate during 2020 and have continued to operate through the date of this report. Our production of ammonia, the basic building block for our products, was 10.4 million tons in 2020 compared to 10.2 million tons in 2019. Through the date of this filing, we have continued to ship products by all modes of transportation to our customers, and we have not experienced any significant delays in marine, rail or truck transportation services due to the pandemic.",
        "match": "In 2020, we did not experience a meaningful impact in customer demand as a result of the COVID-19 pandemic. Our total volume of products shipped in 2020 of 20.3 million tons was 4% higher compared to 19.5 million tons in 2019. "
    },
    "3865": {
        "CIK": "0001324404",
        "Company Name": "CF INDUSTRIES HOLDINGS, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "In response to the pandemic, we instituted safety precautions early in 2020 to protect the health and well-being of all of our employees, including the manufacturing workforce who operate our nitrogen complexes and distribution facilities. These safety measures included installing thermal temperature checks at each of our sites for all personnel, including contractors, who arrive at our sites, adjusting schedules to support social distancing, including changes to loading and shipping procedures, maintaining a close contact log for employees, self-quarantine logs, requiring face coverings on site, restricting visitor access, and implementing enhanced cleaning protocols and travel restrictions for employees. We also paid approximately $19 million of bonuses to our operational workforce under a special COVID-19 bonus program, which concluded in June 2020. In addition, since mid-March 2020, the majority of our non-operational personnel at our sites who work in administrative and operational support functions have worked remotely in order to maintain social distancing following governmental guidelines. These administrative and operational support functions have operated effectively during this period, meeting our commitments to our customers and continuing to manage our business without interruption. We have not furloughed any employees or instituted any reductions in pay or benefits or other significant cost containment measures due to the pandemic.",
        "after": "We participate in a global market, which includes a global supply chain and customer base. The long-term effects of the COVID-19 pandemic are unclear and could adversely affect our business in the future. We have operated our business in a remote working environment and could continue to do so for an extended duration, if necessary. However, if the pandemic were to impact a large portion of our workforce in any one location, we might need to idle that facility temporarily or transfer other employees from other network sites, which could have an impact on our business operations, profitability and cash flow. The impact of the COVID-19 pandemic is fluid and continues to evolve. As a result, we cannot predict the extent to which our business, results of operations, financial condition or liquidity may be impacted by the pandemic in the future."
    },
    "3880": {
        "CIK": "0001324404",
        "Company Name": "CF INDUSTRIES HOLDINGS, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "In March 2020, the World Health Organization characterized the outbreak of coronavirus disease 2019 (COVID-19) as a pandemic. Since that time, efforts to slow the spread of COVID-19 have intensified. A number of countries, as well as certain states and cities within the United States, have continued to enact temporary closures of businesses, to issue shelter in place or quarantine orders, and to take other restrictive measures in response to the pandemic. ",
        "after": "Due to the use of fertilizer products in crop production to support the global food supply chain, our business operations were designated as part of the critical infrastructure by the United States and as essential businesses in the United Kingdom and Canada, with corresponding designations for those states and provinces in which we operate that issued restrictive orders. As a result, our manufacturing complexes continued to operate during 2020 and have continued to operate through the date of this report. Our production of ammonia, the basic building block for our products, was 10.4 million tons in 2020 compared to 10.2 million tons in 2019. Through the date of this filing, we have continued to ship products by all modes of transportation to our customers, and we have not experienced any significant delays in marine, rail or truck transportation services due to the pandemic."
    },
    "3883": {
        "CIK": "0001324404",
        "Company Name": "CF INDUSTRIES HOLDINGS, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "before": "Due to the use of fertilizer products in crop production to support the global food supply chain, our business operations were designated as part of the critical infrastructure by the United States and as essential businesses in the United Kingdom and Canada, with corresponding designations for those states and provinces in which we operate that issued restrictive orders. As a result, our manufacturing complexes continued to operate during 2020 and have continued to operate through the date of this report. Our production of ammonia, the basic building block for our products, was 10.4 million tons in 2020 compared to 10.2 million tons in 2019. Through the date of this filing, we have continued to ship products by all modes of transportation to our customers, and we have not experienced any significant delays in marine, rail or truck transportation services due to the pandemic.",
        "match": "In 2020, we did not experience a meaningful impact in customer demand as a result of the COVID-19 pandemic. Our total volume of products shipped in 2020 of 20.3 million tons was 4% higher compared to 19.5 million tons in 2019. "
    },
    "3885": {
        "CIK": "0001324404",
        "Company Name": "CF INDUSTRIES HOLDINGS, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "In response to the pandemic, we instituted safety precautions early in 2020 to protect the health and well-being of all of our employees, including the manufacturing workforce who operate our nitrogen complexes and distribution facilities. These safety measures included installing thermal temperature checks at each of our sites for all personnel, including contractors, who arrive at our sites, adjusting schedules to support social distancing, including changes to loading and shipping procedures, maintaining a close contact log for employees, self-quarantine logs, requiring face coverings on site, restricting visitor access, and implementing enhanced cleaning protocols and travel restrictions for employees. We also paid approximately $19 million of bonuses to our operational workforce under a special COVID-19 bonus program, which concluded in June 2020. In addition, since mid-March 2020, the majority of our non-operational personnel at our sites who work in administrative and operational support functions have worked remotely in order to maintain social distancing following governmental guidelines. These administrative and operational support functions have operated effectively during this period, meeting our commitments to our customers and continuing to manage our business without interruption. We have not furloughed any employees or instituted any reductions in pay or benefits or other significant cost containment measures due to the pandemic.",
        "after": "We participate in a global market, which includes a global supply chain and customer base. The long-term effects of the COVID-19 pandemic are unclear and could adversely affect our business in the future. We have operated our business in a remote working environment and could continue to do so for an extended duration, if necessary. However, if the pandemic were to impact a large portion of our workforce in any one location, we might need to idle that facility temporarily or transfer other employees from other network sites, which could have an impact on our business operations, profitability and cash flow. The impact of the COVID-19 pandemic is fluid and continues to evolve. As a result, we cannot predict the extent to which our business, results of operations, financial condition or liquidity may be impacted by the pandemic in the future."
    },
    "4007": {
        "CIK": "0001356576",
        "Company Name": "SUPERNUS PHARMACEUTICALS, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "The full impact of the COVID-19 pandemic on our business remains uncertain and subject to change. We are closely monitoring the impact of the COVID-19 pandemic on all aspects of our business operations and have assessed the impact of the COVID-19 pandemic on our consolidated financial statements. Although the COVID-19 pandemic has not significantly impacted our consolidated financial statements as of and for the year ended December 31, 2020, it may have a future impact, especially if the severity worsens, the duration lengthens, or the nature of the effects changes. ",
        "after": "The effects of the pandemic may vary significantly across different aspects of our business operations. We do not and cannot yet know the full extent of the potential impact on our execution of clinical trials, new product launches, including SPN-812, our manufacturing and supply chain, or related impacts on our business or financial condition. These effects could include the adverse impact on research and development activities as a result of a disruption in clinical projects; adverse impact on selling and marketing efforts as a result of temporarily halting in-person interactions by our sales force with healthcare providers; adverse impact on net product sales as a result of decreased new prescriptions due to fewer patient visits to physicians to begin treatment; potential changes in payor segment mix; increased use of co-pay programs due to rising unemployment; and potential future disruption to our supply chain and manufacturing operations."
    },
    "4011": {
        "CIK": "0001356576",
        "Company Name": "SUPERNUS PHARMACEUTICALS, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "The full impact of the COVID-19 pandemic on our business remains uncertain and subject to change. We are closely monitoring the impact of the COVID-19 pandemic on all aspects of our business operations and have assessed the impact of the COVID-19 pandemic on our consolidated financial statements. Although the COVID-19 pandemic has not significantly impacted our consolidated financial statements as of and for the year ended December 31, 2020, it may have a future impact, especially if the severity worsens, the duration lengthens, or the nature of the effects changes. ",
        "after": "The effects of the pandemic may vary significantly across different aspects of our business operations. We do not and cannot yet know the full extent of the potential impact on our execution of clinical trials, new product launches, including SPN-812, our manufacturing and supply chain, or related impacts on our business or financial condition. These effects could include the adverse impact on research and development activities as a result of a disruption in clinical projects; adverse impact on selling and marketing efforts as a result of temporarily halting in-person interactions by our sales force with healthcare providers; adverse impact on net product sales as a result of decreased new prescriptions due to fewer patient visits to physicians to begin treatment; potential changes in payor segment mix; increased use of co-pay programs due to rising unemployment; and potential future disruption to our supply chain and manufacturing operations."
    },
    "4045": {
        "CIK": "0001375151",
        "Company Name": "ZOGENIX INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "We commenced the commercial launch of Fintepla in the United States in July 2020 and in Germany in February 2021. Our commercialization efforts will need to navigate through the operational restrictions imposed on our sales force from quarantines, travel restrictions and bans and other governmental and healthcare restrictions related to COVID-19. As a result of these restrictions, our sales force has not been able to conduct in-person interactions with physicians and healthcare providers and have been restricted to primarily conducting educational and promotional activities for Fintepla virtually, which may impact our ability to market Fintepla. In addition, Fintepla is being launched through our Fintepla REMS program in the U.S. and a controlled access program in Europe, with each program requiring patients to obtain echocardiograms during this pandemic. ",
        "after": "To date, we have been able to continue to supply Fintepla and MT1621 to our patients currently enrolled in our clinical trials and do not currently anticipate any interruptions in supply. Any delays in the completion of our clinical trials and any disruption in our supply chain could have a material adverse effect on our business, results of operations and financial condition. The full extent to which the COVID-19 pandemic will directly or indirectly impact our business, results of operations and financial condition, will depend on future developments that are highly uncertain, including as a result of new information that may emerge concerning COVID-19 and the actions taken to contain it or treat COVID-19, as well as the economic impact on local, regional, national and international markets."
    },
    "4049": {
        "CIK": "0001375151",
        "Company Name": "ZOGENIX INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "We commenced the commercial launch of Fintepla in the United States in July 2020 and in Germany in February 2021. Our commercialization efforts will need to navigate through the operational restrictions imposed on our sales force from quarantines, travel restrictions and bans and other governmental and healthcare restrictions related to COVID-19. As a result of these restrictions, our sales force has not been able to conduct in-person interactions with physicians and healthcare providers and have been restricted to primarily conducting educational and promotional activities for Fintepla virtually, which may impact our ability to market Fintepla. In addition, Fintepla is being launched through our Fintepla REMS program in the U.S. and a controlled access program in Europe, with each program requiring patients to obtain echocardiograms during this pandemic. ",
        "after": "To date, we have been able to continue to supply Fintepla and MT1621 to our patients currently enrolled in our clinical trials and do not currently anticipate any interruptions in supply. Any delays in the completion of our clinical trials and any disruption in our supply chain could have a material adverse effect on our business, results of operations and financial condition. The full extent to which the COVID-19 pandemic will directly or indirectly impact our business, results of operations and financial condition, will depend on future developments that are highly uncertain, including as a result of new information that may emerge concerning COVID-19 and the actions taken to contain it or treat COVID-19, as well as the economic impact on local, regional, national and international markets."
    },
    "4210": {
        "CIK": "0001406666",
        "Company Name": "Calix, Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "COVID-19 Pandemic",
        "after": "We are subject to risks and uncertainties as a result of the COVID-19 pandemic. The extent of the impact of the COVID-19 pandemic on our business is highly uncertain and difficult to predict as coronavirus continues to spread around the world. The availability of vaccines has been limited, and there are no assurances as to when the pandemic will be contained. Since March 2020, we have instituted office closures, travel restrictions and a mandatory work-from-home policy for substantially all of our employees. The spread of COVID-19 has had a prolonged impact on our supply chain operations due to restrictions, reduced capacity and limited availability from suppliers whom we rely on for sourcing components and materials and from third-party partners whom we rely on for manufacturing, warehousing and logistics services. Although demand for our products has been strong in the short-term as subscribers seek more bandwidth and better Wi-Fi, customers’ purchasing decisions over the long-term may be impacted by the pandemic and its impact on the economy, which could in turn impact our revenue and results of operations. Furthermore, our supply chain continues to face constraints primarily due to challenges in sourcing components and materials for our products, including due to plant closures. The prolonged impact of COVID-19 could exacerbate these constraints or cause further supply chain disruptions."
    },
    "4247": {
        "CIK": "0001418135",
        "Company Name": "Keurig Dr Pepper Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "While we believe that there will continue to be strong long-term demand for our products, the timing and extent of economic recovery, and the uncertainties in short-term demand trends, make it difficult to predict the overall effects of the COVID-19 pandemic on our business. We expect that there will be heightened volatility in net sales during and subsequent to the duration of the pandemic that may impact interim periods. ",
        "after": "Our ability to continue to operate without any significant negative impacts will in part depend on our ability to protect our critical frontline employees and our supply chain. As food and agriculture is deemed part of the critical infrastructure by the Department of Homeland Security, our frontline employees have been identified as critical workers in maintaining the U.S. food and beverage supply. As a result, we have strived to follow recommended actions of government and health authorities to protect our employees, with particular measures in place for those working in our manufacturing and distribution facilities, which also included temporary incentive pay programs and benefits. We intend to continue to work with government authorities and implement our employee safety measures; however, disruptions to our supply chain, measures taken to protect employees, increased absenteeism or other local effects of the COVID-19 pandemic have impacted and could continue to impact our operations. For our corporate employees, we do not believe that the remote work environment has had any significant impact on our internal controls over financial reporting. With the health and safety of our employees remaining our top priority, we are diligently working on plans to safely bring our employees back to office locations with enhanced safety and health protocols. We do not believe these plans will impact our near-term liquidity needs.  "
    },
    "4250": {
        "CIK": "0001418135",
        "Company Name": "Keurig Dr Pepper Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "before": "Our ability to continue to operate without any significant negative impacts will in part depend on our ability to protect our critical frontline employees and our supply chain. As food and agriculture is deemed part of the critical infrastructure by the Department of Homeland Security, our frontline employees have been identified as critical workers in maintaining the U.S. food and beverage supply. As a result, we have strived to follow recommended actions of government and health authorities to protect our employees, with particular measures in place for those working in our manufacturing and distribution facilities, which also included temporary incentive pay programs and benefits. We intend to continue to work with government authorities and implement our employee safety measures; however, disruptions to our supply chain, measures taken to protect employees, increased absenteeism or other local effects of the COVID-19 pandemic have impacted and could continue to impact our operations. For our corporate employees, we do not believe that the remote work environment has had any significant impact on our internal controls over financial reporting. With the health and safety of our employees remaining our top priority, we are diligently working on plans to safely bring our employees back to office locations with enhanced safety and health protocols. We do not believe these plans will impact our near-term liquidity needs.  ",
        "match": "The COVID-19 pandemic has not materially impacted our liquidity position. We continue to generate operating cash flows to meet our short-term liquidity needs, and we expect to maintain access to the capital markets enabled by our debt ratings. Refer to "
    },
    "4271": {
        "CIK": "0001418135",
        "Company Name": "Keurig Dr Pepper Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "While we believe that there will continue to be strong long-term demand for our products, the timing and extent of economic recovery, and the uncertainties in short-term demand trends, make it difficult to predict the overall effects of the COVID-19 pandemic on our business. We expect that there will be heightened volatility in net sales during and subsequent to the duration of the pandemic that may impact interim periods. ",
        "after": "Our ability to continue to operate without any significant negative impacts will in part depend on our ability to protect our critical frontline employees and our supply chain. As food and agriculture is deemed part of the critical infrastructure by the Department of Homeland Security, our frontline employees have been identified as critical workers in maintaining the U.S. food and beverage supply. As a result, we have strived to follow recommended actions of government and health authorities to protect our employees, with particular measures in place for those working in our manufacturing and distribution facilities, which also included temporary incentive pay programs and benefits. We intend to continue to work with government authorities and implement our employee safety measures; however, disruptions to our supply chain, measures taken to protect employees, increased absenteeism or other local effects of the COVID-19 pandemic have impacted and could continue to impact our operations. For our corporate employees, we do not believe that the remote work environment has had any significant impact on our internal controls over financial reporting. With the health and safety of our employees remaining our top priority, we are diligently working on plans to safely bring our employees back to office locations with enhanced safety and health protocols. We do not believe these plans will impact our near-term liquidity needs.  "
    },
    "4274": {
        "CIK": "0001418135",
        "Company Name": "Keurig Dr Pepper Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "before": "Our ability to continue to operate without any significant negative impacts will in part depend on our ability to protect our critical frontline employees and our supply chain. As food and agriculture is deemed part of the critical infrastructure by the Department of Homeland Security, our frontline employees have been identified as critical workers in maintaining the U.S. food and beverage supply. As a result, we have strived to follow recommended actions of government and health authorities to protect our employees, with particular measures in place for those working in our manufacturing and distribution facilities, which also included temporary incentive pay programs and benefits. We intend to continue to work with government authorities and implement our employee safety measures; however, disruptions to our supply chain, measures taken to protect employees, increased absenteeism or other local effects of the COVID-19 pandemic have impacted and could continue to impact our operations. For our corporate employees, we do not believe that the remote work environment has had any significant impact on our internal controls over financial reporting. With the health and safety of our employees remaining our top priority, we are diligently working on plans to safely bring our employees back to office locations with enhanced safety and health protocols. We do not believe these plans will impact our near-term liquidity needs.  ",
        "match": "The COVID-19 pandemic has not materially impacted our liquidity position. We continue to generate operating cash flows to meet our short-term liquidity needs, and we expect to maintain access to the capital markets enabled by our debt ratings. Refer to "
    },
    "4295": {
        "CIK": "0001423869",
        "Company Name": "PCB Bancorp",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "COVID-19 Pandemic",
        "after": "The ongoing COVID-19 pandemic, and governmental and societal responses thereto, have had a severe impact on recent global economic and market conditions, including significant disruption of, and volatility in, financial markets; global supply chain disruptions; and the institution of social distancing and shelter-in-place requirements that have resulted in temporary closures of many businesses, lost revenues, and increased unemployment throughout the U.S., but also specifically in California, where most of the Company’s operations and a large majority of its customers are located."
    },
    "4298": {
        "CIK": "0001423869",
        "Company Name": "PCB Bancorp",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "before": "The ongoing COVID-19 pandemic, and governmental and societal responses thereto, have had a severe impact on recent global economic and market conditions, including significant disruption of, and volatility in, financial markets; global supply chain disruptions; and the institution of social distancing and shelter-in-place requirements that have resulted in temporary closures of many businesses, lost revenues, and increased unemployment throughout the U.S., but also specifically in California, where most of the Company’s operations and a large majority of its customers are located.",
        "match": "On March 27, 2020, the CARES Act was enacted to address the economic impact resulted from the COVID-19 pandemic. The CARES Act included various initiatives, such as extended unemployment benefits, mortgage forbearance, the Small Business Administration (“SBA”) Paycheck Protection Program (“PPP”) and the temporary relief from troubled debt restructuring (“TDRs”). The Economic Aid Act was signed into law on December 27, 2020, and provided additional stimulus relief, reauthorized PPP, and extended the temporary relief from TDR treatment for certain loans modified in connection with COVID-19."
    },
    "4308": {
        "CIK": "0001423869",
        "Company Name": "PCB Bancorp",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "Our business, results of operations, and financial condition have been, and will likely continue to be, adversely affected by the ongoing COVID-19 pandemic.",
        "after": "The ongoing COVID-19 pandemic, and governmental and societal responses thereto, have had a severe impact on recent global economic and market conditions, including significant disruption of, and volatility in, financial markets; global supply chain disruptions; and the institution of social distancing and shelter-in-place requirements that have resulted in temporary closures of many businesses, lost revenues, and increased unemployment throughout the United States, but also specifically in California, where most of our operations and a large majority of our customers are located. These conditions have impacted and are expected in the future to impact-our business, results of operations, and financial condition negatively, including through lower revenue from certain of our fee-based businesses; lower net interest income resulting from lower interest rates and increased loan delinquencies; increased provisions for loan losses and unfunded loan commitments; impairments on the securities we hold; and decreased demand for certain of our products and services. Additionally, our liquidity and regulatory capital could be adversely impacted by volatility and disruptions in the capital and credit markets; deposit flows; and continued client draws on lines of credit as well as our participation in the SBA PPP. Our business operations may also be disrupted if significant portions of our workforce are unable to work effectively, including because of illness, quarantines, government actions, or other restrictions in connection with the pandemic. Negative impacts from these conditions also may include:"
    },
    "4323": {
        "CIK": "0001423869",
        "Company Name": "PCB Bancorp",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "before": "The ongoing COVID-19 pandemic, and governmental and societal responses thereto, have had a severe impact on recent global economic and market conditions, including significant disruption of, and volatility in, financial markets; global supply chain disruptions; and the institution of social distancing and shelter-in-place requirements that have resulted in temporary closures of many businesses, lost revenues, and increased unemployment throughout the U.S., but also specifically in California, where most of the Company’s operations and a large majority of its customers are located.",
        "match": "On March 27, 2020, the CARES Act was enacted to address the economic impact resulted from the COVID-19 pandemic. The CARES Act included various initiatives, such as extended unemployment benefits, mortgage forbearance, the Small Business Administration (“SBA”) Paycheck Protection Program (“PPP”) and the temporary relief from troubled debt restructuring (“TDRs”). The Economic Aid Act was signed into law on December 27, 2020, and provided additional stimulus relief, reauthorized PPP, and extended the temporary relief from TDR treatment for certain loans modified in connection with COVID-19."
    },
    "4331": {
        "CIK": "0001423869",
        "Company Name": "PCB Bancorp",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "Our business, results of operations, and financial condition have been, and will likely continue to be, adversely affected by the ongoing COVID-19 pandemic.",
        "after": "The ongoing COVID-19 pandemic, and governmental and societal responses thereto, have had a severe impact on recent global economic and market conditions, including significant disruption of, and volatility in, financial markets; global supply chain disruptions; and the institution of social distancing and shelter-in-place requirements that have resulted in temporary closures of many businesses, lost revenues, and increased unemployment throughout the United States, but also specifically in California, where most of our operations and a large majority of our customers are located. These conditions have impacted and are expected in the future to impact-our business, results of operations, and financial condition negatively, including through lower revenue from certain of our fee-based businesses; lower net interest income resulting from lower interest rates and increased loan delinquencies; increased provisions for loan losses and unfunded loan commitments; impairments on the securities we hold; and decreased demand for certain of our products and services. Additionally, our liquidity and regulatory capital could be adversely impacted by volatility and disruptions in the capital and credit markets; deposit flows; and continued client draws on lines of credit as well as our participation in the SBA PPP. Our business operations may also be disrupted if significant portions of our workforce are unable to work effectively, including because of illness, quarantines, government actions, or other restrictions in connection with the pandemic. Negative impacts from these conditions also may include:"
    },
    "4366": {
        "CIK": "0001438533",
        "Company Name": "TRAVERE THERAPEUTICS, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "Uncertainty Related to the COVID-19 Pandemic",
        "after": "While the impact of the ongoing COVID-19 pandemic did not have a material adverse effect on our financial position or results of operations for the year ended December 31, 2020, we have been monitoring the developments and assessing areas where there is potential for our business to be impacted. Our labor force is currently working remotely, which could, among other things, negatively impact our ability to conduct research and development activities, engage in sales-related initiatives, or efficiently conduct day-to-day operations, and we are aware that other businesses with which we engage are likely operating under similar restrictions and experiencing disruptions in their own operations, which may create obstacles in the coordination of business activities. Circumstances arising from the pandemic have slowed and could continue to slow the pace of enrollment in our clinical trials or otherwise hinder patients' abilities to comply with the clinical trial protocols and could ultimately delay the availability of results and analysis of outcomes. Disruptions in the supply chain could negatively impact our ability to source materials or manufacture and distribute product. While we do not currently anticipate a material reduction in demand for our commercialized products, we could experience a decrease in new patient identification and increased requests for patient assistance due to increased levels of unemployment, either of which would negatively impact our revenues and hinder our cash flows. Similarly, we could face challenges with regard to healthcare programs, including access and changes in coverage. Growth in revenue could also be impeded by these factors. The financial markets have been subject to significant volatility that could impact our ability to enter into, modify, and negotiate favorable terms and conditions relative to equity and debt financing activities. We had $361.6 million in cash and cash equivalents and available-for-sale securities as of December 31, 2020, which does not take into account $189.0 million in net proceeds we received in February 2021 pursuant to an underwritten public offering, which we believe provides sufficient capital to fund our operations for at least the next twelve months. While we have not yet experienced a material impact to date, the full magnitude of the pandemic cannot be measured at this time, and therefore any of the aforementioned circumstances, as well as other factors, may cause our results of operations to vary substantially from year to year and quarter to quarter."
    },
    "4458": {
        "CIK": "0001463258",
        "Company Name": "RENEWABLE ENERGY GROUP, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "Impact of COVID-19 on Our Business",
        "after": "In March 2020, the World Health Organization declared COVID-19 a global pandemic and recommended containment and mitigation measures worldwide.  The COVID-19 pandemic has negatively impacted the global economy, disrupted consumer spending and global supply chains, and created significant volatility and disruption of financial markets.  "
    },
    "4461": {
        "CIK": "0001463258",
        "Company Name": "RENEWABLE ENERGY GROUP, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "before": "In March 2020, the World Health Organization declared COVID-19 a global pandemic and recommended containment and mitigation measures worldwide.  The COVID-19 pandemic has negatively impacted the global economy, disrupted consumer spending and global supply chains, and created significant volatility and disruption of financial markets.  ",
        "match": "In response to the outbreak and business disruption, we have prioritized the health and safety of our employees.  We have established a COVID-19 Emergency Response Team (\"ERT\") to monitor the health of our employees and mitigate the infection risk of our employees.  Based on input from the ERT, we have implemented several initiatives in response to the COVID-19 pandemic, such as a remote workplace requirement for all office and administrative employees, social distancing protocols for our production employees and any visitors to our facilities, additional paid time off for employees as needed in order to deal with health or family issues related to COVID-19, and a temporary ban on discretionary business travel."
    },
    "4466": {
        "CIK": "0001463258",
        "Company Name": "RENEWABLE ENERGY GROUP, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "before": "In March 2020, the World Health Organization declared COVID-19 a global pandemic and recommended containment and mitigation measures worldwide.  The COVID-19 pandemic has negatively impacted the global economy, disrupted consumer spending and global supply chains, and created significant volatility and disruption of financial markets.  ",
        "match": "In response to the outbreak and business disruption, we have prioritized the health and safety of our employees.  We have established a COVID-19 Emergency Response Team (\"ERT\") to monitor the health of our employees and mitigate the infection risk of our employees.  Based on input from the ERT, we have implemented several initiatives in response to the COVID-19 pandemic, such as a remote workplace requirement for all office and administrative employees, social distancing protocols for our production employees and any visitors to our facilities, additional paid time off for employees as needed in order to deal with health or family issues related to COVID-19, and a temporary ban on discretionary business travel."
    },
    "4546": {
        "CIK": "0001477294",
        "Company Name": "SENSATA TECHNOLOGIES HOLDING PLC",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "In the third and fourth quarters of 2020, the global economy continued to rebound following a period of commercial lockdowns and quarantines instituted by governments around the world in response to the spread of COVID-19 earlier in the year. Our response to that rebound has enabled our revenue to grow sequentially in the second half of fiscal year 2020, as we continue to deliver strong market outgrowth. For fiscal year 2020, we delivered 880 basis points of market outgrowth in our heavy vehicle and off-road (\"HVOR\") business and 690 basis points of market outgrowth in our automotive business. We continue to monitor all of our end markets and customers to ensure that our resources are balanced against forecasts and prioritized against critical growth opportunities.",
        "after": "Due in part to large-scale shutdowns early in 2020 caused by the COVID-19 pandemic, the automotive industry supply chain is currently facing a global shortage of semiconductors, the technology used to make microchips, resulting in paused production on certain vehicles and increased costs to procure microchips. We believe this shortage will have an adverse impact on our operating costs in fiscal year 2021. If the impacts of this shortage are more severe than we expect, it could result in further deterioration of our results, potentially for a longer period than currently anticipated."
    },
    "4570": {
        "CIK": "0001486957",
        "Company Name": "BWX TECHNOLOGIES, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "To date, we have experienced localized operational challenges as a result of employee illness, quarantines and social distancing protocols. Within our Canadian operations, revenues in our medical radioisotopes and radiopharmaceuticals business have declined year over year due to a decrease in demand for elective diagnostic procedures, and certain services scheduled during nuclear power plant outages have been rescheduled, delaying the performance of services by our Nuclear Power Group segment. We have also experienced delays in the bidding and contracting process for our U.S. Government businesses due to COVID-19 concerns.",
        "after": "Because developments related to the spread of COVID-19 and its impacts have been occurring rapidly, it is difficult to predict any future impact at this time. We may experience further disruptions to demand for our products and services and our operations in the future as a result of, among other things, national, state, provincial or local government enforced quarantines, worker illness or absenteeism, and travel and other restrictions. For similar reasons, the COVID-19 pandemic may also adversely impact our supply chain and other manufacturers which could delay our receipt of essential goods and services. Any number of these potential risks could have a material adverse effect on our financial condition, results of operations and cash flows. The extent to which the COVID-19 outbreak impacts our business will depend on future developments that are highly uncertain and cannot be predicted, including new information that may emerge concerning the severity of the virus and the actions to contain its impact."
    },
    "4803": {
        "CIK": "0001555280",
        "Company Name": "Zoetis Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "The spread of the novel coronavirus (COVID-19) has resulted in authorities implementing numerous measures to try to contain the virus, such as travel bans and restrictions, quarantines, shelter in place orders and shutdowns of non-essential businesses. While some of these restrictions have been lifted or eased in certain jurisdictions, other jurisdictions have seen increases in new COVID-19 cases, resulting in restrictions being reinstated or new restrictions being imposed. ",
        "after": "Even though we are currently designated as an essential business and have continued physical operations with respect to manufacturing and supply chain globally, these measures have impacted and may further impact all or portions of our workforce and operations, the operations and workforce of our customers, and those of our respective vendors and suppliers. There is no certainty that measures taken by governmental authorities will be sufficient to mitigate the risks posed by the virus, and our ability to continue to perform critical functions could be harmed."
    },
    "4814": {
        "CIK": "0001555280",
        "Company Name": "Zoetis Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "Uncertainty Relating to COVID-19",
        "after": "We continue to closely monitor the impact of the coronavirus (COVID-19) pandemic and the resulting global recession on all aspects of our business across geographies, including how it has and may continue to impact our customers, workforce, suppliers and vendors. We are currently designated an essential business globally and have continued physical operations with respect to research and development, manufacturing and our supply chain. As the pandemic continues to progress, the severity of the impact across markets remains uncertain as the number of cases rises and falls in various jurisdictions leading to changes in the imposition of restrictive measures intended to contain the virus. "
    },
    "4816": {
        "CIK": "0001555280",
        "Company Name": "Zoetis Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "We continue to closely monitor the impact of the coronavirus (COVID-19) pandemic and the resulting global recession on all aspects of our business across geographies, including how it has and may continue to impact our customers, workforce, suppliers and vendors. We are currently designated an essential business globally and have continued physical operations with respect to research and development, manufacturing and our supply chain. As the pandemic continues to progress, the severity of the impact across markets remains uncertain as the number of cases rises and falls in various jurisdictions leading to changes in the imposition of restrictive measures intended to contain the virus. ",
        "after": "Due to numerous uncertainties regarding the continuing COVID-19 pandemic, we are unable to fully predict the impact that it will ultimately have on our future financial position and operating results. These uncertainties include the severity of the virus, the duration of the outbreak and number of recurrences, the effectiveness of measures to contain and treat the virus, including the timing of widespread vaccinations, governmental, business or other actions in response to the pandemic (which could include actions that result in limitations on, or disruptions to, our manufacturing, transportation and other operations, or mandates to provide products or services), impacts on our supply chain, the effect on customer demand, or changes to our operations. We cannot predict the impact that the COVID-19 pandemic will have on our customers, vendors and suppliers; however, any material effect on these parties could adversely impact us. In particular, our livestock customers have been, and may continue to be, negatively impacted by facility closures, reduced packing plant capacity, quarantines, travel bans and labor shortages, and the shift in protein production from foodservice to grocery, among other impacts. In addition, our companion animal customers have been, and may in the future be, negatively impacted by lack of demand for veterinary services in areas where lockdown and stay-at-home orders are in place. The impact of COVID-19 on our customers has reduced and could continue to reduce the demand for our products, which could continue to adversely impact our revenue. The health of our workforce, and our ability to meet staffing needs in our manufacturing operations and other critical functions also cannot be predicted and is vital to our operations. Further, the impacts of a prolonged global recession and the continued disruptions to, and volatility in, the credit and financial markets, as well as other unanticipated consequences, remain unknown. In addition, in order to preserve liquidity, we issued debt securities in May 2020 and we may in the future incur additional indebtedness, whether through the issuance of debt securities, drawdowns under our credit facility or otherwise. An increase in our outstanding indebtedness will result in additional interest expense. "
    },
    "4818": {
        "CIK": "0001555280",
        "Company Name": "Zoetis Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "before": "We continue to closely monitor the impact of the coronavirus (COVID-19) pandemic and the resulting global recession on all aspects of our business across geographies, including how it has and may continue to impact our customers, workforce, suppliers and vendors. We are currently designated an essential business globally and have continued physical operations with respect to research and development, manufacturing and our supply chain. As the pandemic continues to progress, the severity of the impact across markets remains uncertain as the number of cases rises and falls in various jurisdictions leading to changes in the imposition of restrictive measures intended to contain the virus. ",
        "match": "Due to numerous uncertainties regarding the continuing COVID-19 pandemic, we are unable to fully predict the impact that it will ultimately have on our future financial position and operating results. These uncertainties include the severity of the virus, the duration of the outbreak and number of recurrences, the effectiveness of measures to contain and treat the virus, including the timing of widespread vaccinations, governmental, business or other actions in response to the pandemic (which could include actions that result in limitations on, or disruptions to, our manufacturing, transportation and other operations, or mandates to provide products or services), impacts on our supply chain, the effect on customer demand, or changes to our operations. We cannot predict the impact that the COVID-19 pandemic will have on our customers, vendors and suppliers; however, any material effect on these parties could adversely impact us. In particular, our livestock customers have been, and may continue to be, negatively impacted by facility closures, reduced packing plant capacity, quarantines, travel bans and labor shortages, and the shift in protein production from foodservice to grocery, among other impacts. In addition, our companion animal customers have been, and may in the future be, negatively impacted by lack of demand for veterinary services in areas where lockdown and stay-at-home orders are in place. The impact of COVID-19 on our customers has reduced and could continue to reduce the demand for our products, which could continue to adversely impact our revenue. The health of our workforce, and our ability to meet staffing needs in our manufacturing operations and other critical functions also cannot be predicted and is vital to our operations. Further, the impacts of a prolonged global recession and the continued disruptions to, and volatility in, the credit and financial markets, as well as other unanticipated consequences, remain unknown. In addition, in order to preserve liquidity, we issued debt securities in May 2020 and we may in the future incur additional indebtedness, whether through the issuance of debt securities, drawdowns under our credit facility or otherwise. An increase in our outstanding indebtedness will result in additional interest expense. "
    },
    "4833": {
        "CIK": "0001555280",
        "Company Name": "Zoetis Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "We continue to closely monitor the impact of the coronavirus (COVID-19) pandemic and the resulting global recession on all aspects of our business across geographies, including how it has and may continue to impact our customers, workforce, suppliers and vendors. We are currently designated an essential business globally and have continued physical operations with respect to research and development, manufacturing and our supply chain. As the pandemic continues to progress, the severity of the impact across markets remains uncertain as the number of cases rises and falls in various jurisdictions leading to changes in the imposition of restrictive measures intended to contain the virus. ",
        "after": "Due to numerous uncertainties regarding the continuing COVID-19 pandemic, we are unable to fully predict the impact that it will ultimately have on our future financial position and operating results. These uncertainties include the severity of the virus, the duration of the outbreak and number of recurrences, the effectiveness of measures to contain and treat the virus, including the timing of widespread vaccinations, governmental, business or other actions in response to the pandemic (which could include actions that result in limitations on, or disruptions to, our manufacturing, transportation and other operations, or mandates to provide products or services), impacts on our supply chain, the effect on customer demand, or changes to our operations. We cannot predict the impact that the COVID-19 pandemic will have on our customers, vendors and suppliers; however, any material effect on these parties could adversely impact us. In particular, our livestock customers have been, and may continue to be, negatively impacted by facility closures, reduced packing plant capacity, quarantines, travel bans and labor shortages, and the shift in protein production from foodservice to grocery, among other impacts. In addition, our companion animal customers have been, and may in the future be, negatively impacted by lack of demand for veterinary services in areas where lockdown and stay-at-home orders are in place. The impact of COVID-19 on our customers has reduced and could continue to reduce the demand for our products, which could continue to adversely impact our revenue. The health of our workforce, and our ability to meet staffing needs in our manufacturing operations and other critical functions also cannot be predicted and is vital to our operations. Further, the impacts of a prolonged global recession and the continued disruptions to, and volatility in, the credit and financial markets, as well as other unanticipated consequences, remain unknown. In addition, in order to preserve liquidity, we issued debt securities in May 2020 and we may in the future incur additional indebtedness, whether through the issuance of debt securities, drawdowns under our credit facility or otherwise. An increase in our outstanding indebtedness will result in additional interest expense. "
    },
    "4835": {
        "CIK": "0001555280",
        "Company Name": "Zoetis Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "before": "We continue to closely monitor the impact of the coronavirus (COVID-19) pandemic and the resulting global recession on all aspects of our business across geographies, including how it has and may continue to impact our customers, workforce, suppliers and vendors. We are currently designated an essential business globally and have continued physical operations with respect to research and development, manufacturing and our supply chain. As the pandemic continues to progress, the severity of the impact across markets remains uncertain as the number of cases rises and falls in various jurisdictions leading to changes in the imposition of restrictive measures intended to contain the virus. ",
        "match": "Due to numerous uncertainties regarding the continuing COVID-19 pandemic, we are unable to fully predict the impact that it will ultimately have on our future financial position and operating results. These uncertainties include the severity of the virus, the duration of the outbreak and number of recurrences, the effectiveness of measures to contain and treat the virus, including the timing of widespread vaccinations, governmental, business or other actions in response to the pandemic (which could include actions that result in limitations on, or disruptions to, our manufacturing, transportation and other operations, or mandates to provide products or services), impacts on our supply chain, the effect on customer demand, or changes to our operations. We cannot predict the impact that the COVID-19 pandemic will have on our customers, vendors and suppliers; however, any material effect on these parties could adversely impact us. In particular, our livestock customers have been, and may continue to be, negatively impacted by facility closures, reduced packing plant capacity, quarantines, travel bans and labor shortages, and the shift in protein production from foodservice to grocery, among other impacts. In addition, our companion animal customers have been, and may in the future be, negatively impacted by lack of demand for veterinary services in areas where lockdown and stay-at-home orders are in place. The impact of COVID-19 on our customers has reduced and could continue to reduce the demand for our products, which could continue to adversely impact our revenue. The health of our workforce, and our ability to meet staffing needs in our manufacturing operations and other critical functions also cannot be predicted and is vital to our operations. Further, the impacts of a prolonged global recession and the continued disruptions to, and volatility in, the credit and financial markets, as well as other unanticipated consequences, remain unknown. In addition, in order to preserve liquidity, we issued debt securities in May 2020 and we may in the future incur additional indebtedness, whether through the issuance of debt securities, drawdowns under our credit facility or otherwise. An increase in our outstanding indebtedness will result in additional interest expense. "
    },
    "4886": {
        "CIK": "0001570585",
        "Company Name": "Liberty Global plc",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "COVID-19",
        "after": ") to be a global pandemic. In response, emergency measures were imposed by governments worldwide, including travel restrictions, restrictions on social activity and the shutdown of non-essential businesses. These measures have adversely impacted the global economy, disrupted global supply chains and created significant volatility and disruption of financial markets. In accordance with government mandates or recommended guidelines, as well as our desire to protect the health and safety of our employees, customers and communities, many of our retail stores were temporarily closed in mid-March 2020 and remained closed for up to several months. In addition, on March 16, 2020, most of our office personnel began working remotely, and many continue to do so. We also undertook certain short-term commercial initiatives in response to the pandemic with respect to our product and "
    },
    "4901": {
        "CIK": "0001575051",
        "Company Name": "CINER RESOURCES LP",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "Our Response to COVID-19",
        "after": "We continue to closely monitor the impact of the outbreak of COVID-19 and all governmental actions in response thereto on all aspects of our business, including how it impacts our customers, employees, supply chain, distribution network and cash flows. We have taken strong proactive steps to keep the safety of our team and their families as the priority.  We have been executing and continue to execute a comprehensive plan to help prevent the spread of the virus in our work locations and it appears to be having a positive impact.  This plan includes multiple layers of protection for our employees, including but not limited to, social distancing, working from home for certain employees, splitting shifts, increased sanitation, restricted contractor and visitor access, temperature checks on all contractors and third-party vendors, travel restrictions, mask wearing requirements, and daily communication with our teams.  We have conducted proactive quarantining and contact tracing from the early days of this pandemic and require self-reporting of any illness, in addition to a company doctor, weekly status meetings, tracking local resources, and industry wide efforts.  We have also prepared strong contingency plans for all our operations with specific actions based on absentee rates.  While we have not utilized any such plans to date as they have not been needed, they are continuously refined in case needed.  As COVID-19 vaccines become more broadly available, we will encourage employees to consider getting vaccinated.  We anticipate a re-opening of society when the virus plateaus and diminishes, and we have completed re-entry plans to implement as they become appropriate.  We are using data to guide our actions rather than firm dates, and our teams are kept up to date on these plans.  Our focus prior to and during this pandemic has been the safety of our teams and this will continue to be our priority as we scale our operations back to normal as the data guides us to do so.  We continue to actively monitor and adhere to applicable local, state, federal, and international governmental guideline actions to better ensure the safety of our employees."
    },
    "4904": {
        "CIK": "0001575051",
        "Company Name": "CINER RESOURCES LP",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "before": "We continue to closely monitor the impact of the outbreak of COVID-19 and all governmental actions in response thereto on all aspects of our business, including how it impacts our customers, employees, supply chain, distribution network and cash flows. We have taken strong proactive steps to keep the safety of our team and their families as the priority.  We have been executing and continue to execute a comprehensive plan to help prevent the spread of the virus in our work locations and it appears to be having a positive impact.  This plan includes multiple layers of protection for our employees, including but not limited to, social distancing, working from home for certain employees, splitting shifts, increased sanitation, restricted contractor and visitor access, temperature checks on all contractors and third-party vendors, travel restrictions, mask wearing requirements, and daily communication with our teams.  We have conducted proactive quarantining and contact tracing from the early days of this pandemic and require self-reporting of any illness, in addition to a company doctor, weekly status meetings, tracking local resources, and industry wide efforts.  We have also prepared strong contingency plans for all our operations with specific actions based on absentee rates.  While we have not utilized any such plans to date as they have not been needed, they are continuously refined in case needed.  As COVID-19 vaccines become more broadly available, we will encourage employees to consider getting vaccinated.  We anticipate a re-opening of society when the virus plateaus and diminishes, and we have completed re-entry plans to implement as they become appropriate.  We are using data to guide our actions rather than firm dates, and our teams are kept up to date on these plans.  Our focus prior to and during this pandemic has been the safety of our teams and this will continue to be our priority as we scale our operations back to normal as the data guides us to do so.  We continue to actively monitor and adhere to applicable local, state, federal, and international governmental guideline actions to better ensure the safety of our employees.",
        "match": "The impact of COVID-19"
    },
    "4962": {
        "CIK": "0001593034",
        "Company Name": "Endo International plc",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "COVID-19 Update and Other Key Trends",
        "after": "We are closely monitoring the impact of COVID-19 on all aspects of our business, the pharmaceutical industry and the economy as a whole, including how it has and will continue to impact our workforce, our customers and the patients they serve, our manufacturing and supply chain operations, our R&D programs and regulatory approval processes and our liquidity and access to capital. In addition to our existing business continuity plans, our executive leadership team has developed and implemented a range of proactive measures to address the risks, uncertainties and operational challenges associated with COVID-19. We continue to closely monitor the rapidly evolving situation and implement plans intended to limit the impact of COVID-19 on our business so that we can continue to produce the critical care medicines that hospitals and healthcare providers need to treat patients, including those with COVID-19. Actions we have taken to date and expected key trends are further described below."
    },
    "4971": {
        "CIK": "0001593195",
        "Company Name": "TRIBUNE PUBLISHING COMPANY",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "outsourcing",
        "before": "The Company continually assesses its operations in an effort to identify opportunities to enhance operational efficiencies and reduce expenses.  These activities have in the past included, and could include in the future, outsourcing of various functions or operations, additional abandonment of leased space and other activities which may result in changes to employee headcount.  See Note 6 to the Consolidated Financial Statements for further information on changes in operations during fiscal year 2020.  The Company expects to continue to take actions deemed appropriate to enhance profitability but does not currently know whether or when any such actions will occur or the potential costs and expected savings.  Depending on the actions taken and the timing of any such actions, the anticipated cost savings could be recognized in fiscal periods that do not correspond to the fiscal period(s) in which the charges are recognized.",
        "match": "COVID-19"
    },
    "5031": {
        "CIK": "0001601548",
        "Company Name": "Vectrus, Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "COVID-19 Impact",
        "after": "The global outbreak of COVID-19 was declared a pandemic by the World Health Organization and a national emergency by the U.S. government in March 2020 and has negatively affected the U.S. and global economy, disrupted global supply chains, resulted in significant travel and transport restrictions, including mandated closures and orders to “shelter-in-place,” and created significant disruption of the financial markets. We have taken measures to protect the health and safety of our employees, to work with our customers to minimize ultimate potential disruptions, and to support our community in addressing the challenges posed by this global pandemic. The extent of the ultimate impact of the COVID-19 pandemic on our operational and financial performance, including our ability to execute our programs in the expected timeframe, will depend on future developments, including the duration and spread of the pandemic and related actions taken by the U.S. government, state and local government officials, and international governments to prevent disease spread, all of which remain uncertain and cannot be predicted."
    },
    "5034": {
        "CIK": "0001601548",
        "Company Name": "Vectrus, Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "before": "The global outbreak of COVID-19 was declared a pandemic by the World Health Organization and a national emergency by the U.S. government in March 2020 and has negatively affected the U.S. and global economy, disrupted global supply chains, resulted in significant travel and transport restrictions, including mandated closures and orders to “shelter-in-place,” and created significant disruption of the financial markets. We have taken measures to protect the health and safety of our employees, to work with our customers to minimize ultimate potential disruptions, and to support our community in addressing the challenges posed by this global pandemic. The extent of the ultimate impact of the COVID-19 pandemic on our operational and financial performance, including our ability to execute our programs in the expected timeframe, will depend on future developments, including the duration and spread of the pandemic and related actions taken by the U.S. government, state and local government officials, and international governments to prevent disease spread, all of which remain uncertain and cannot be predicted.",
        "match": "For the twelve months ended December 31, 2020, it is estimated that COVID-19 caused a $63.1 million reduction in our revenue and a $0.39 reduction in our diluted earnings per share. This impact was primarily due to certain government actions to restrict access to certain bases by Vectrus personnel and delays in supplier deliveries.",
        "after": "In accordance with the DoD guidance issued in March 2020 designating the Defense Industrial Base as a critical infrastructure workforce, our U.S. facilities have continued to operate in support of essential products and services required to meet our commitments to the U.S. government and the U.S. military; however, facility closures or work slowdowns or supply chain disruptions have affected our financial results and projections. In addition, other countries are responding to the pandemic differently which have affected our international operations and the operations of our suppliers and customers.  However, any closures to date have not significantly  impacted Vectrus' business."
    },
    "5036": {
        "CIK": "0001601548",
        "Company Name": "Vectrus, Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "before": "In accordance with the DoD guidance issued in March 2020 designating the Defense Industrial Base as a critical infrastructure workforce, our U.S. facilities have continued to operate in support of essential products and services required to meet our commitments to the U.S. government and the U.S. military; however, facility closures or work slowdowns or supply chain disruptions have affected our financial results and projections. In addition, other countries are responding to the pandemic differently which have affected our international operations and the operations of our suppliers and customers.  However, any closures to date have not significantly  impacted Vectrus' business.",
        "match": "We continue to work with our customers, employees, suppliers and communities to address the impacts of COVID-19. We continue to assess possible implications to our business, supply chain and customers and to take actions in an effort to mitigate adverse consequences in order to support our customers' mission critical business and national security."
    },
    "5041": {
        "CIK": "0001601548",
        "Company Name": "Vectrus, Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "In accordance with the DoD guidance issued in March 2020 designating the Defense Industrial Base as a critical infrastructure workforce, our U.S. facilities have continued to operate in support of essential products and services required to meet our commitments to the U.S. government and the U.S. military; however, facility closures or work slowdowns or supply chain disruptions have affected our financial results and projections. In addition, other countries are responding to the pandemic differently which have affected our international operations and the operations of our suppliers and customers.  However, any closures to date have not significantly  impacted Vectrus' business.",
        "after": "We continue to work with our customers, employees, suppliers and communities to address the impacts of COVID-19. We continue to assess possible implications to our business, supply chain and customers and to take actions in an effort to mitigate adverse consequences in order to support our customers' mission critical business and national security."
    },
    "5089": {
        "CIK": "0001606498",
        "Company Name": "Avanos Medical, Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "The COVID-19 global pandemic caused disruption in global supply and distribution channels and dramatically changed the way companies do business. From the beginning of this global health crisis, our first priority has been the safety and well being of our employees. ",
        "after": "We continue to monitor the developments associated with the COVID-19 pandemic and its effects on our employees, customers, supply chain and distribution channels. The ongoing impact of the pandemic depends on a number of factors including the severity and duration of the pandemic and the extent and severity of the impact on our customers, which is uncertain and unpredictable. Our future results of operations and cash flows may suffer adverse effects from delays in payments on outstanding accounts receivable, potential manufacturing, distribution and supply chain disruptions and uncertain demand, and effects of any actions we may take to address financial and operational challenges our customers may face. Other risks and uncertainties that we face include, but are not limited to:"
    },
    "5099": {
        "CIK": "0001606498",
        "Company Name": "Avanos Medical, Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "The COVID-19 global pandemic caused disruption in global supply and distribution channels and dramatically changed the way companies do business. From the beginning of this global health crisis, our first priority has been the safety and well being of our employees. ",
        "after": "We continue to monitor the developments associated with the COVID-19 pandemic and its effects on our employees, customers, supply chain and distribution channels. The ongoing impact of the pandemic depends on a number of factors including the severity and duration of the pandemic and the extent and severity of the impact on our customers, which is uncertain and unpredictable. Our future results of operations and cash flows may suffer adverse effects from delays in payments on outstanding accounts receivable, potential manufacturing, distribution and supply chain disruptions and uncertain demand, and effects of any actions we may take to address financial and operational challenges our customers may face. Other risks and uncertainties that we face include, but are not limited to:"
    },
    "5164": {
        "CIK": "0001634997",
        "Company Name": "Avangrid, Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "The outbreak of COVID-19 and its impact on business and economic conditions could negatively affect our business, results of operations, financial condition, cash flows and the trading value of our securities.",
        "after": "The scale and scope of the COVID-19 pandemic and the impact on the economy and financial markets could adversely affect our business, financial performance and results of operations. We have not yet experienced a materially adverse impact to our business, results of operations or financial condition, however, given the uncertain scope and duration of the COVID-19 outbreak and its potential effects on our business, we currently cannot predict if there will be materially adverse impacts to our business, results of operations or financial condition in the future. While the situation surrounding COVID-19 remains fluid and its potential impact on AVANGRID is difficult to predict, the continued spread of the virus, availability of a vaccine and actions undertaken by national, regional, and local governments and health officials to contain COVID-19 or treat its effects could: impact customer demand for electricity particularly from businesses, commercial and industrial customers; cause us to experience an increase in costs as a result of our emergency measures, delayed payments from our customers and uncollectable accounts; cause delays and disruptions in the availability and timely delivery of materials and components used in our operations; cause delays and disruptions in the supply chain resulting in disruptions in the commercial operation dates of certain projects and impacting qualification criteria for certain tax credits and potential delay damages in our power purchase agreements; cause deterioration in credit quality of our counterparties, contractors or retail customers that could result in credit losses; cause impairment of goodwill or long-lived assets and impact our ability to develop, construct and operate facilities; result in our inability to meet the requirements of the covenants in our existing credit facilities, including covenants regarding the ratio of indebtedness to total capitalization; cause a deterioration in our financial metrics or the business environment that impacts our credit ratings; cause a delay in the permitting process of certain development projects, affecting the timing of final investment decisions and start of construction dates; cause extended remote work, which could harm productivity, increase "
    },
    "5166": {
        "CIK": "0001634997",
        "Company Name": "Avangrid, Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "COVID-19",
        "after": "The COVID-19 pandemic has led to global economic disruption and volatility in financial markets and the United States economy. AVANGRID is one of the many companies providing essential services during this national emergency and we communicate regularly with federal and state authorities and industry resources to ensure a coordinated response. We have implemented business continuity and emergency response plans to continue to provide service to our customers and support our operational needs. We continue to monitor developments affecting both our workforce and our customers and will take precautions that we determine are necessary or appropriate. We regularly communicate with our customers regarding the tools and resources available and to help our customers stay informed during this public health crisis. In addition to measures to protect our workforce and critical operations, we have established a cross-functional task force to plan for a safe and effective return to office. AVANGRID is actively monitoring potential supply chain and transportation disruptions that could impact the Company’s operations and will implement plans to address any such impacts on our business."
    },
    "5235": {
        "CIK": "0001653477",
        "Company Name": "INGEVITY CORPORATION",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "For revenue, we expect favorable volume growth in Performance Materials’ automotive technologies product line largely due to continued industry efforts to refill the vehicle pipeline and despite the absence of any significant new gasoline vapor emission control regulations. In Performance Chemicals, we expect moderate growth in demand for pavement technologies and engineered polymers based on strong paving project backlog, continued Evotherm® warm mix technology adoption, and increased demand for thermoplastics. We also anticipate growth in merchant rosin sales and our agricultural dispersants products within industrial specialties, which will be partially offset by continued softness in publication inks and our oilfield chemicals business. Our outlook reflects our expectation that the first half of 2021 will continue to be impacted by the COVID-19 pandemic and by the microchip shortage, which is disrupting the global automotive supply chain.",
        "after": "Adjusted EBITDA is expected to grow by one percent to six percent versus 2020. In the Performance Materials segment, growth will be driven by continued volume, price, and mix improvements, due in part to a slight uptick in demand over 2020, and a continued refilling of the automotive pipeline. This growth will be partially offset by higher logistics costs, increased compensation costs, and continued legal costs to defend our Performance Materials' intellectual property. In our Performance Chemicals segment, continued profitable growth in pavement technologies and a return to growth in engineered polymers is expected to be partially offset by somewhat lower volumes in oilfield technologies, and modest inflationary costs for freight and primary raw materials. Some risks to the 2021 outlook include lower than anticipated U.S., China, Canadian, and European vehicle sales and production, higher non-primary raw materials costs, a shift towards smaller vehicles in the U.S. (versus the shift towards light trucks as seen in recent years), and further declines in oil drilling and production in oilfield technologies, negative impacts from Brexit, and prolonged disruptions in the global supply chain. We expect to deliver fiscal year 2021 Adjusted EBITDA of $400 million to $420 million. These estimates assume that the first half of the year will continue to impacted by the COVID-19 pandemic, with improvements in economic conditions over the second half of the year."
    },
    "5237": {
        "CIK": "0001653477",
        "Company Name": "INGEVITY CORPORATION",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "before": "For revenue, we expect favorable volume growth in Performance Materials’ automotive technologies product line largely due to continued industry efforts to refill the vehicle pipeline and despite the absence of any significant new gasoline vapor emission control regulations. In Performance Chemicals, we expect moderate growth in demand for pavement technologies and engineered polymers based on strong paving project backlog, continued Evotherm® warm mix technology adoption, and increased demand for thermoplastics. We also anticipate growth in merchant rosin sales and our agricultural dispersants products within industrial specialties, which will be partially offset by continued softness in publication inks and our oilfield chemicals business. Our outlook reflects our expectation that the first half of 2021 will continue to be impacted by the COVID-19 pandemic and by the microchip shortage, which is disrupting the global automotive supply chain.",
        "match": "Adjusted EBITDA is expected to grow by one percent to six percent versus 2020. In the Performance Materials segment, growth will be driven by continued volume, price, and mix improvements, due in part to a slight uptick in demand over 2020, and a continued refilling of the automotive pipeline. This growth will be partially offset by higher logistics costs, increased compensation costs, and continued legal costs to defend our Performance Materials' intellectual property. In our Performance Chemicals segment, continued profitable growth in pavement technologies and a return to growth in engineered polymers is expected to be partially offset by somewhat lower volumes in oilfield technologies, and modest inflationary costs for freight and primary raw materials. Some risks to the 2021 outlook include lower than anticipated U.S., China, Canadian, and European vehicle sales and production, higher non-primary raw materials costs, a shift towards smaller vehicles in the U.S. (versus the shift towards light trucks as seen in recent years), and further declines in oil drilling and production in oilfield technologies, negative impacts from Brexit, and prolonged disruptions in the global supply chain. We expect to deliver fiscal year 2021 Adjusted EBITDA of $400 million to $420 million. These estimates assume that the first half of the year will continue to impacted by the COVID-19 pandemic, with improvements in economic conditions over the second half of the year."
    },
    "5242": {
        "CIK": "0001653477",
        "Company Name": "INGEVITY CORPORATION",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "For revenue, we expect favorable volume growth in Performance Materials’ automotive technologies product line largely due to continued industry efforts to refill the vehicle pipeline and despite the absence of any significant new gasoline vapor emission control regulations. In Performance Chemicals, we expect moderate growth in demand for pavement technologies and engineered polymers based on strong paving project backlog, continued Evotherm® warm mix technology adoption, and increased demand for thermoplastics. We also anticipate growth in merchant rosin sales and our agricultural dispersants products within industrial specialties, which will be partially offset by continued softness in publication inks and our oilfield chemicals business. Our outlook reflects our expectation that the first half of 2021 will continue to be impacted by the COVID-19 pandemic and by the microchip shortage, which is disrupting the global automotive supply chain.",
        "after": "Adjusted EBITDA is expected to grow by one percent to six percent versus 2020. In the Performance Materials segment, growth will be driven by continued volume, price, and mix improvements, due in part to a slight uptick in demand over 2020, and a continued refilling of the automotive pipeline. This growth will be partially offset by higher logistics costs, increased compensation costs, and continued legal costs to defend our Performance Materials' intellectual property. In our Performance Chemicals segment, continued profitable growth in pavement technologies and a return to growth in engineered polymers is expected to be partially offset by somewhat lower volumes in oilfield technologies, and modest inflationary costs for freight and primary raw materials. Some risks to the 2021 outlook include lower than anticipated U.S., China, Canadian, and European vehicle sales and production, higher non-primary raw materials costs, a shift towards smaller vehicles in the U.S. (versus the shift towards light trucks as seen in recent years), and further declines in oil drilling and production in oilfield technologies, negative impacts from Brexit, and prolonged disruptions in the global supply chain. We expect to deliver fiscal year 2021 Adjusted EBITDA of $400 million to $420 million. These estimates assume that the first half of the year will continue to impacted by the COVID-19 pandemic, with improvements in economic conditions over the second half of the year."
    },
    "5244": {
        "CIK": "0001653477",
        "Company Name": "INGEVITY CORPORATION",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "before": "For revenue, we expect favorable volume growth in Performance Materials’ automotive technologies product line largely due to continued industry efforts to refill the vehicle pipeline and despite the absence of any significant new gasoline vapor emission control regulations. In Performance Chemicals, we expect moderate growth in demand for pavement technologies and engineered polymers based on strong paving project backlog, continued Evotherm® warm mix technology adoption, and increased demand for thermoplastics. We also anticipate growth in merchant rosin sales and our agricultural dispersants products within industrial specialties, which will be partially offset by continued softness in publication inks and our oilfield chemicals business. Our outlook reflects our expectation that the first half of 2021 will continue to be impacted by the COVID-19 pandemic and by the microchip shortage, which is disrupting the global automotive supply chain.",
        "match": "Adjusted EBITDA is expected to grow by one percent to six percent versus 2020. In the Performance Materials segment, growth will be driven by continued volume, price, and mix improvements, due in part to a slight uptick in demand over 2020, and a continued refilling of the automotive pipeline. This growth will be partially offset by higher logistics costs, increased compensation costs, and continued legal costs to defend our Performance Materials' intellectual property. In our Performance Chemicals segment, continued profitable growth in pavement technologies and a return to growth in engineered polymers is expected to be partially offset by somewhat lower volumes in oilfield technologies, and modest inflationary costs for freight and primary raw materials. Some risks to the 2021 outlook include lower than anticipated U.S., China, Canadian, and European vehicle sales and production, higher non-primary raw materials costs, a shift towards smaller vehicles in the U.S. (versus the shift towards light trucks as seen in recent years), and further declines in oil drilling and production in oilfield technologies, negative impacts from Brexit, and prolonged disruptions in the global supply chain. We expect to deliver fiscal year 2021 Adjusted EBITDA of $400 million to $420 million. These estimates assume that the first half of the year will continue to impacted by the COVID-19 pandemic, with improvements in economic conditions over the second half of the year."
    },
    "5276": {
        "CIK": "0001657312",
        "Company Name": "Verona Pharma plc",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "To help protect the health and safety of the patients, caregivers and healthcare professionals involved in its ongoing clinical trials of ensifentrine, as well as our employees and independent contractors, we continue to follow guidance from the FDA and other health regulatory authorities regarding the conduct of clinical trials during the COVID-19 pandemic to ensure the safety of study participants, minimize risks to study integrity, and maintain compliance with good clinical practice. We continue to review this guidance and the effect of the COVID-19 pandemic on our operations and clinical trials and will provide an update if we become aware of any meaningful disruption caused by the pandemic to our clinical trials.",
        "after": "We are closely monitoring activities at our contract manufacturers associated with clinical supply for our ongoing clinical trials, and are satisfied that appropriate plans and procedures are in place to ensure uninterrupted future supply of ensifentrine to the clinical trial sites, subject to potential limitations on their operations and on the supply chain due to the COVID-19 pandemic. We continue to monitor this situation and will provide an update if we become aware of any meaningful disruption caused by the pandemic to the clinical supply of ensifentrine for our clinical trials."
    },
    "5279": {
        "CIK": "0001657312",
        "Company Name": "Verona Pharma plc",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "To help protect the health and safety of the patients, caregivers and healthcare professionals involved in its ongoing clinical trials of ensifentrine, as well as our employees and independent contractors, we continue to follow guidance from the FDA and other health regulatory authorities regarding the conduct of clinical trials during the COVID-19 pandemic to ensure the safety of study participants, minimize risks to study integrity, and maintain compliance with good clinical practice. We continue to review this guidance and the effect of the COVID-19 pandemic on our operations and clinical trials and will provide an update if we become aware of any meaningful disruption caused by the pandemic to our clinical trials.",
        "after": "We are closely monitoring activities at our contract manufacturers associated with clinical supply for our ongoing clinical trials, and are satisfied that appropriate plans and procedures are in place to ensure uninterrupted future supply of ensifentrine to the clinical trial sites, subject to potential limitations on their operations and on the supply chain due to the COVID-19 pandemic. We continue to monitor this situation and will provide an update if we become aware of any meaningful disruption caused by the pandemic to the clinical supply of ensifentrine for our clinical trials."
    },
    "5284": {
        "CIK": "0001658566",
        "Company Name": "CENTENNIAL RESOURCE DEVELOPMENT, INC.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "operational disruption",
        "match": "COVID-19 Outbreak",
        "after": "The COVID-19 outbreak and its development into a pandemic in March 2020 have required that we take precautionary measures intended to help minimize the risk to our business, employees, customers, contractors, suppliers and the communities in which we operate. Our operational employees have been and are currently able to work on site, while the vast majority of our non-operational employees have worked remotely or reported to our offices on a limited basis during 2020. We have taken various precautionary measures with respect to our operational employees, direct contractors and employees who returned to our offices or job sites during the year such as (i) requiring them to verify they have not experienced any symptoms consistent with COVID-19, or been in close contact with someone showing such symptoms, before reporting to the work site or office, (ii) self-quarantining any employees or contractors who have shown signs or symptoms of COVID-19 regardless of whether such person has been confirmed to be infected, (iii) imposing social distancing requirements on work sites and at our offices that are in accordance with the guidelines released by the Center for Disease Control (the “CDC”) as well as local and state authorities, (iv) requiring all employees and contractors to have a fit-test for and wear KN-95 type respirators while in our offices and work sites, and (v) encouraging all employees and contractors to follow the CDC recommended preventive measures (including those mentioned above) to limit the spread of COVID-19. We have not experienced any operational disruptions (including disruptions from our suppliers or service providers) as a result of the COVID-19 outbreak."
    },
    "5449": {
        "CIK": "0001739940",
        "Company Name": "Cigna Corporation",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "The novel strain of coronavirus (“COVID-19”) was declared a pandemic by the World Health Organization in March 2020. From the onset of the COVID-19 pandemic we have taken actions to drive affordability, reduce uncertainty and make health care easier. For customers, these actions include COVID-19 related cost share waivers, expanded access to virtual care, support for access to medication and advocating for whole person health through various behavioral health initiatives. We have supported the medical community by simplifying processes and donating medications for a COVID-19 clinical trial. Cigna and the Cigna Foundation have assisted our communities through several initiatives including the launch of the Brave of Heart Fund that provides financial assistance to survivors of front-line U.S. health care workers who gave their lives in the fight against COVID-19. Cigna also provides emotional support services to their families. The Evernorth team launched ParachuteRx, a drug cost assistance program to certain customers without health coverage due to furlough or job loss. Cigna Medical Group was among the first in the United States to administer antibody therapies to high-risk COVID-19 patients in a non-hospital setting. Cigna also partnered with other organizations on digital access to vaccination records for those who have received the COVID-19 vaccine to facilitate return to work and daily activities.",
        "after": "We have continued to support our workforce by enabling remote work where appropriate, and implemented enhanced safety protocols and programs that support the health and mental well-being of our employees. We have continued to execute our business continuity plans over our operations such as leveraging purchasing volume across the pharmaceutical supply chain in order to mitigate risk associated with prescription drug supply. We did not incur significant disruptions to our operations during 2020 from COVID-19."
    },
    "5471": {
        "CIK": "0001739940",
        "Company Name": "Cigna Corporation",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "The novel strain of coronavirus (“COVID-19”) was declared a pandemic by the World Health Organization in March 2020. From the onset of the COVID-19 pandemic we have taken actions to drive affordability, reduce uncertainty and make health care easier. For customers, these actions include COVID-19 related cost share waivers, expanded access to virtual care, support for access to medication and advocating for whole person health through various behavioral health initiatives. We have supported the medical community by simplifying processes and donating medications for a COVID-19 clinical trial. Cigna and the Cigna Foundation have assisted our communities through several initiatives including the launch of the Brave of Heart Fund that provides financial assistance to survivors of front-line U.S. health care workers who gave their lives in the fight against COVID-19. Cigna also provides emotional support services to their families. The Evernorth team launched ParachuteRx, a drug cost assistance program to certain customers without health coverage due to furlough or job loss. Cigna Medical Group was among the first in the United States to administer antibody therapies to high-risk COVID-19 patients in a non-hospital setting. Cigna also partnered with other organizations on digital access to vaccination records for those who have received the COVID-19 vaccine to facilitate return to work and daily activities.",
        "after": "We have continued to support our workforce by enabling remote work where appropriate, and implemented enhanced safety protocols and programs that support the health and mental well-being of our employees. We have continued to execute our business continuity plans over our operations such as leveraging purchasing volume across the pharmaceutical supply chain in order to mitigate risk associated with prescription drug supply. We did not incur significant disruptions to our operations during 2020 from COVID-19."
    },
    "5473": {
        "CIK": "0001739940",
        "Company Name": "Cigna Corporation",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "before": "We have continued to support our workforce by enabling remote work where appropriate, and implemented enhanced safety protocols and programs that support the health and mental well-being of our employees. We have continued to execute our business continuity plans over our operations such as leveraging purchasing volume across the pharmaceutical supply chain in order to mitigate risk associated with prescription drug supply. We did not incur significant disruptions to our operations during 2020 from COVID-19.",
        "match": "We will continue to work with our clients, customers, providers and employees to provide support during the pandemic."
    },
    "5492": {
        "CIK": "0001742924",
        "Company Name": "LIVENT CORPORATION",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "COVID-19",
        "Secondary Word": "supply chain",
        "match": "We have responded to the COVID-19 pandemic in a number of ways. We assembled a Global Pandemic Response Team whose global members are taken from different functional areas, including Operations, Finance, Commercial, Legal, Human Resources and Health & Safety. The Global Pandemic Response Team meets on a regular basis, and provides reports to the Executive Leadership team. We have also assembled COVID-19 Response Teams at several of its regional locations, who have the responsibility to keep informed of local matters such as government policies and regulations. These Response Teams are helping to shape the Company’s policies in response to the COVID-19 pandemic.",
        "after": "We have also worked to identify potential new suppliers and logistics providers for its operations in case of further supply chain disruptions.  This includes suppliers of chemicals and packaging, and air freight companies. We have altered global production schedules to meet changes in customer demand. Future efforts will continue along these lines and be dictated by the particulars of the COVID-19 pandemic. We continue to plan for a return to more normalized business operations once the COVID-19 pandemic subsides. "
    },
    "5508": {
        "CIK": "0001742924",
        "Company Name": "LIVENT CORPORATION",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "match": "We have responded to the COVID-19 pandemic in a number of ways. We assembled a Global Pandemic Response Team whose global members are taken from different functional areas, including Operations, Finance, Commercial, Legal, Human Resources and Health & Safety. The Global Pandemic Response Team meets on a regular basis, and provides reports to the Executive Leadership team. We have also assembled COVID-19 Response Teams at several of its regional locations, who have the responsibility to keep informed of local matters such as government policies and regulations. These Response Teams are helping to shape the Company’s policies in response to the COVID-19 pandemic.",
        "after": "We have also worked to identify potential new suppliers and logistics providers for its operations in case of further supply chain disruptions.  This includes suppliers of chemicals and packaging, and air freight companies. We have altered global production schedules to meet changes in customer demand. Future efforts will continue along these lines and be dictated by the particulars of the COVID-19 pandemic. We continue to plan for a return to more normalized business operations once the COVID-19 pandemic subsides. "
    },
    "5535": {
        "CIK": "0001753706",
        "Company Name": "Whole Earth Brands, Inc.",
        "Item": "7: Management’s Discussion and Analysis of Financial Condition and Results of Operations",
        "Primary Word": "pandemic",
        "Secondary Word": "supply chain",
        "before": "COVID-19 surfaced in Wuhan, China in late 2019, and has since spread throughout the rest of the world. In March 2020, COVID-19 was declared a pandemic by the World Health Organization and a national emergency by the U.S. Government. The pandemic has negatively affected the U.S. and global economies, disrupted global supply chains and financial markets, and resulted in significant travel restrictions, including mandated facility closures and shelter-in-place orders.",
        "match": "We have taken measures to protect the health and safety of our employees and implemented work from home arrangements, where possible, social distancing where working from home is not feasible including in our manufacturing facilities, deep cleaning protocols at all of our facilities and travel restrictions, among other measures. We have also taken appropriate measures to work with our customers to minimize potential disruption and to support the communities that we serve to address the challenges posed by the pandemic."
    }
}