{
    "28": {
        "CIK": "0000010329",
        "Company Name": "BASSETT FURNITURE INDUSTRIES INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Security Ownership of Certain Beneficial Owners and Management and Related Stockholder Matters",
        "match": "the impact of the ongoing coronavirus (“COVID-19”) outbreak upon our ability to maintain normal operations at our retail stores and manufacturing facilities and the resulting effects any future interruption of those operations may have upon our financial condition, results of operations and liquidity, as well as the impact of the outbreak upon general economic conditions, including consumer spending and the strength of the housing market in the United States",
        "after": "future tax legislation, or regulatory or judicial positions"
    },
    "48": {
        "CIK": "0000021535",
        "Company Name": "COHU INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "The following sets forth the names, ages, positions and offices held by all executive officers of Cohu as of February 18, 2021. Executive Officers serve at the discretion of the Board of Directors, until their successors are appointed.",
        "match": "During fiscal 2020, in response to the COVID-19 pandemic, we implemented safety protocols and new procedures to protect our employees, our subcontractors and our customers. These protocols include complying with social distancing, enhanced hygiene and other health and safety standards as required by federal, state and local government agencies, and taking into consideration guidelines of the Centers for Disease Control and Prevention and other public health authorities. In addition, we modified the way we conduct many aspects of our business to reduce the number of in-person interactions. For example, we significantly expanded the use of virtual interactions in all aspects of our business, including customer facing activities. Many of our administrative and operational functions during this time have required modification as well, including most of our workforce working remotely.",
        "after": "The seasonal nature of the semiconductor equipment industry places enormous demands on our employees, operations and infrastructure."
    },
    "64": {
        "CIK": "0000026780",
        "Company Name": "Dana Inc.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "The following table summarizes our principal competitors by operating segment as of December 31, 2020:",
        "match": "We engage in ongoing engineering and research and development activities to improve the reliability, performance and cost-effectiveness of our existing products and to design and develop innovative products that meet customer requirements for new applications. We are integrating related operations to create a more innovative environment, speed product development, maximize efficiency and improve communication and information sharing among our research and development operations. At December 31, 2020, we had seven stand-alone technical and engineering centers and nineteen additional sites at which we conduct research and development activities. Our research and development costs were $146 in 2020, $112 in 2019 and $103 in 2018. Total engineering expenses including research and development were $246 in 2020, $271 in 2019 and $252 in 2018. During 2020, we reduced our total engineering spend in response to the global COVID-19 pandemic, taking advantage of various government programs and subsidies in the countries in which we operate. We also made the strategic decision to focus our engineering spend more heavily on research and development activities, continuing to progress key electrification initiatives despite the global pandemic.",
        "after": "We could be adversely impacted by the loss of any of our significant customers, changes in their requirements for our products or changes in their financial condition."
    },
    "78": {
        "CIK": "0000031667",
        "Company Name": "EDUCATIONAL DEVELOPMENT CORPORATION",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Smaller reporting company ☒",
        "match": "The information discussed in this Annual Report on Form 10-K includes “forward-looking statements.” These forward-looking statements are identified by their use of terms and phrases such as “may,” “expect,” “estimate,” “project,” “plan,” “believe,” “intend,” “achievable,” “anticipate,” “continue,” “potential,” “should,” “could,” and similar terms and phrases.  Although we believe that the expectations reflected in these forward-looking statements are reasonable, they do involve certain assumptions, risks and uncertainties and we can give no assurance that such expectations or assumptions will be achieved.  Known and unknown risks, uncertainties and other factors may cause our actual results, performance or achievements to be materially different from any future results, performance or achievements expressed or implied by forward-looking statements. Factors that could cause or contribute to such differences include, but are not limited to, our success in recruiting and retaining new consultants, our ability to locate and procure desired books, our ability to ship timely, changes to our primary sales channels, our ability to obtain adequate financing for working capital and capital expenditures, economic and competitive conditions, regulatory changes and other uncertainties, the COVID-19 pandemic, as well as those factors discussed below and elsewhere in this Annual Report on Form 10-K, all of which are difficult to predict. In light of these risks, uncertainties and assumptions, the forward-looking events discussed may not occur.  All forward-looking statements attributable to us or persons acting on our behalf are expressly qualified in their entirety by the cautionary statements in this paragraph and elsewhere in this Annual Report on Form 10-K and speak only as of the date of this Annual Report on Form 10-K.  Other than as required under the securities laws, we do not assume a duty to update these forward-looking statements, whether as a result of new information, subsequent events or circumstances, changes in expectations or otherwise.  As used in this Annual Report on Form 10-K, the terms “the Company,” “EDC,” “we,” “our” or “us” mean Educational Development Corporation, a Delaware corporation, unless the context indicates otherwise.",
        "after": "For information regarding our compensation plans see Note 10 of the notes to the financial statements and our definitive Proxy Statement to be filed in connection with the Annual Meeting of Shareholders to be held on July 7, 2021, as outlined in Part III, Item 12 in this Annual Report."
    },
    "82": {
        "CIK": "0000033488",
        "Company Name": "ESCALADE INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "The Company has two major customers, each of which accounted for more than ten percent of consolidated gross sales in the Company’s 2020 fiscal year. The Company also has several other large customers, none of which represent more than ten percent of consolidated gross sales, and historically has derived substantial revenues from these customers. Our customers continue to experience industry consolidation, which increases our risk that we may be unable to find sufficient alternative customers. The Company needs to continue to expand its customer base to minimize the effects of the loss of any single customer in the future. If sales to one or more of the large customers would be lost or materially reduced, there can be no assurance that the Company will be able to replace such revenues, which could have a material adverse effect on the Company's business, results of operations and financial condition.",
        "match": "COVID-19 PANDEMIC RISKS",
        "after": "10,587"
    },
    "96": {
        "CIK": "0000039368",
        "Company Name": "FULLER H B CO",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Title",
        "match": "We care about our colleagues and anyone who enters our workplace and we believe that nothing we do is worth getting hurt for. We have a strong Environmental, Health and Safety program that focuses on implementing policies and training programs, as well as performing self-audits to enhance work safety. Importantly during 2020, our experience and continuing focus on workplace safety have enabled us to preserve business continuity without sacrificing our commitment to keeping our colleagues and workplace visitors safe during the COVID-19 pandemic.",
        "after": "Vice President, Human Resources"
    },
    "102": {
        "CIK": "0000042682",
        "Company Name": "GORMAN RUPP CO",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Indicate by check mark whether the Registrant (1) has filed all reports required to be filed by Section 13 or 15(d) of the Securities Exchange Act of 1934 during the preceding 12 months (or for such shorter period that the Registrant was required to file such reports), and (2) has been subject to such filing requirements for the past 90 days.    Yes  ☒    No  ☐",
        "match": "Such factors include, but are not limited to: company specific risk factors including (1) loss of key personnel; (2) intellectual property security; (3) acquisition performance and integration; (4) impairment in the value of intangible assets, including goodwill; (5) defined benefit pension plan settlement expense; and (6) family ownership of common equity; and general risk factors including; (7) continuation of the current and projected future business environment, including the duration and scope of the COVID-19 pandemic, the impact of the pandemic and actions taken in response to the pandemic; (8) highly competitive markets; (9) availability and costs of raw materials; (10) cyber security threats; (11) compliance with, and costs related to, a variety of import and export laws and regulations; (12) environmental compliance costs and liabilities; (13) exposure to fluctuations in foreign currency exchange rates; (14) conditions in foreign countries in which The Gorman-Rupp Company conducts business; (15) changes in our tax rates and exposure to additional income tax liabilities; and (16) risks described from time to time in our reports filed with the Securities and Exchange Commission. Except to the extent required by law, we do not undertake and specifically decline any obligation to review or update any forward-looking statements or to publicly announce the results of any revisions to any of such statements to reflect future events or developments or otherwise.",
        "after": "Our internal controls may also be impacted by the COVID-19 pandemic. A large portion of our financial and accounting personnel have been required to work from home for extended periods due to the pandemic, requiring them to adapt to new or modified processes, procedures, and controls. These changes could potentially negatively impact our internal controls over financial reporting."
    },
    "104": {
        "CIK": "0000043196",
        "Company Name": "GRAY TELEVISION INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Securities registered pursuant to Section 12(b) of the Act:",
        "match": "This annual report on Form 10-K contains and incorporates by reference “forward-looking statements” within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933 and Section 21E of the Exchange Act. Forward-looking statements are all statements other than those of historical fact. When used in this annual report, the words “believes,” “expects,” “anticipates,” “estimates,” “will,” “may,” “should” and similar words and expressions are generally intended to identify forward-looking statements. These forward-looking statements reflect our then-current expectations and are based upon data available to us at the time the statements are made. Forward-looking statements may relate to, among other things, statements about the evolving and uncertain nature of novel coronavirus and its related disease (“COVID-19”) global pandemic and its impact on us, the media industry, and the economy in general, our strategies, expected results of operations, general and industry-specific economic conditions, future pension plan contributions, future capital expenditures, future income tax payments, future payments of interest and principal on our long-term debt, assumptions underlying various estimates and estimates of future obligations and commitments, and should be considered in context with the various other disclosures made by us about our business. Readers are cautioned that any forward-looking statements, including those regarding the intent, belief or current expectations of our management, are not guarantees of future performance, results or events and involve significant risks and uncertainties, and that actual results and events may differ materially from those contained in the forward-looking statements as a result of various factors including, but not limited to, those listed in Item 1A. of this Annual Report and the other factors described from time to time in our SEC filings. The forward-looking statements included in this Annual Report are made only as of the date hereof. We undertake no obligation to update such forward-looking statements to reflect subsequent events or circumstances.",
        "after": "WXIX"
    },
    "136": {
        "CIK": "0000066004",
        "Company Name": "MIDDLESEX WATER COMPANY",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Indicate by check mark whether the registrant has submitted electronically and posted on their corporate web site, if any, every Interactive Data File required to be submitted and posted pursuant to Rule 405 of Regulation S-T during the preceding 12 months (or for such shorter period that the registrants were required to submit and post such files). Yes ☒  No ☐",
        "match": "impact of the Novel Coronavirus (COVID-19) or other pandemic; and ",
        "after": "Residential "
    },
    "142": {
        "CIK": "0000070487",
        "Company Name": "National Research Corporation",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Donald M. Berwick",
        "match": "Certain matters discussed in this Annual Report on Form 10-K are “forward-looking statements” within the meaning of Section 21E of the Securities Exchange Act of 1934, as amended. These forward-looking statements can generally be identified as such because the context of the statement includes phrases such as National Research Corporation, doing business as NRC Health (“NRC Health,” the “Company,” “we,” “our,” “us” or similar terms), “believes,” “expects,” “may,” “could,” “anticipates,” or the use of words such as “would,” “may,” “could,” or “should,” or other words of similar import. Similarly, statements that describe our future plans, objectives or goals are also forward-looking statements. In this Annual Report on Form 10-K, statements regarding the future impact of adopting new accounting standards, value and utility of, and market demand for, our service offerings, future opportunities for growth and respect to new and existing clients, our future ability to compete and the types of firms with which we will compete, future consolidation in the healthcare industry, future adequacy of our liquidity sources, future revenue sources, future capital expenditures and the sources of cash to fund such capital expenditures, the expected impact of pending claims and contingencies, the future outcome of uncertain tax positions, our future use of owned and leased real property, the source of funds for future payments of deferred purchase price obligations and other cash expenses, the future phase out of LIBOR and applicable replacement benchmark rates and the expected impact of the COVID-19 pandemic and related government mandates and recommendations, among others, are forward-looking statements. Such forward-looking statements are subject to certain risks and uncertainties which could cause actual results or outcomes to differ materially from those currently anticipated. Factors that could affect actual results or outcomes include, without limitation, the following factors:",
        "after": "Because our clients are concentrated in the healthcare industry, our revenue and operating results may be adversely affected by changes in regulations, a business downturn or consolidation with respect to the healthcare industry."
    },
    "176": {
        "CIK": "0000080172",
        "Company Name": "NATIONAL PRESTO INDUSTRIES INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Housewares and electrical appliances sold by the Company include pressure cookers and canners; the Presto Control Master® heat control single thermostatic control line of skillets in several sizes, griddles, woks and multi-purpose cookers; slow cookers; deep fryers of various sizes; air fryers; waffle makers; pizza ovens; slicer/shredders; electric heaters; corn poppers (hot air, oil, and microwave); dehydrators; rice cookers; microwave bacon cookers; egg cookers; coffeemakers and coffeemaker accessories; electric tea kettles; electric knife sharpeners; a line of kitchen gadgets; and timers.  Pressure cookers and canners are available in various sizes and are fabricated of aluminum and, in the case of cookers, of stainless steel, as well.",
        "match": "COVID-19 or Other Pandemics, Epidemics, or Similar Public Health Crises Risks:",
        "after": "Under 1 Year"
    },
    "190": {
        "CIK": "0000086115",
        "Company Name": "SAFEGUARD SCIENTIFICS INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "101",
        "match": "During 2020, Safeguard was impacted by the circumstances of COVID-19 and the related economic impacts.  In addition to a slowed mergers and acquisitions environment, our companies have been impacted in a variety of operational ways including general declines in the markets in which they operate, reduced access to customers or prospective customers, reduced or delayed collections of amounts due from customers and different ways to work with their employee base.  Our companies have also been negatively impacted in their ability to access debt or equity capital.  The management teams of the entities in which the Company holds such ownership interests are continuing to take actions to respond to the rapidly changing environment, including implementing cost reduction efforts, securing additional capital or other actions, which could mitigate some of the expected impacts.  There are uncertainties as to if these actions will be successful or adequate in this uncertain economic environment.  ",
        "after": "Our success is dependent on our senior management team’s ability to execute our strategy. In connection with our new strategy announced in 2018, we made a series of management changes intended to streamline our organizational structure and reduce our operating costs and since then we have made, and may make, further management changes from time to time.  A loss of one or more of the remaining members of our senior management team without adequate replacement could have a material adverse effect on us."
    },
    "208": {
        "CIK": "0000095029",
        "Company Name": "STURM, RUGER & COMPANY, INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "In addition to the competitive compensation package and the development of employees, the Company retains its employees by maintaining a safe, responsible, and preferred workplace. The Company is committed to conducting business in conformance with the highest ethical standards and in compliance with all relevant legal and regulatory requirements. The “Code of Business Conduct and Ethics” and the “Corporate Compliance Program” are two active programs that guide the Company’s practices to achieve these goals. ",
        "match": "During the global outbreak of the Coronavirus disease 2019 (“COVID-19”), the Company took many proactive steps to maintain the health and safety of its employees and maintain a preferred workplace. These actions included: ",
        "after": "Table of Contents"
    },
    "212": {
        "CIK": "0000095574",
        "Company Name": "SUPERIOR GROUP OF COMPANIES, INC.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "(a)(2)",
        "match": "Certain matters discussed in this Form 10-K are “forward-looking statements” intended to qualify for the safe harbors from liability established by the Private Securities Litigation Reform Act of 1995. These forward-looking statements can generally be identified by use of the words “may,” “will,” “should,” “could,” “expect,” “anticipate,” “estimate,” “believe,” “intend,” “project,” “potential,” or “plan” or the negative of these words or other variations on these words or comparable terminology. Forward-looking statements in this Form 10-K may include, without limitation: (1) the projected impact of the current coronavirus (COVID-19) pandemic on our, our customers’, and our suppliers’ businesses, (2) projections of revenue, income, and other items relating to our financial position and results of operations, (3) statements of our plans, objectives, strategies, goals and intentions, (4) statements regarding the capabilities, capacities, market position and expected development of our business operations, and (5) statements of expected industry and general economic trends.",
        "after": "Our Remote Staffing Solutions business and growth within that segment depend in large part on the industry trend toward outsourced customer contact management services. Outsourcing means that an entity contracts with a third party, such as us, to provide customer contact services rather than perform such services in-house. There can be no assurance that this trend will continue, as organizations may elect to perform such services themselves. A significant change in this trend could have a material adverse effect on our business, financial condition and results of operations."
    },
    "214": {
        "CIK": "0000097134",
        "Company Name": "TENNANT CO",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Portions of the registrant’s Proxy Statement for its 2021 annual meeting of shareholders (the “2021 Proxy Statement”) are incorporated by reference in Part III.",
        "match": "Uncertainty surrounding the impacts and duration of the COVID-19 pandemic.",
        "after": "Organic sales decreased approximately 11.8% which excludes the effects of foreign currency translation exchange. The organic sales decrease was primarily driven by volume declines across all regions, largely driven by the impact of the COVID-19 pandemic. The decrease was partially offset by continued strong demand for our autonomous cleaning machines in North America; and"
    },
    "216": {
        "CIK": "0000098222",
        "Company Name": "TIDEWATER INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "101.PRE*",
        "match": "COVID-19 Pandemic",
        "after": "We operate throughout the world and are exposed to risks inherent in doing business in countries other than the U.S."
    },
    "248": {
        "CIK": "0000311094",
        "Company Name": "WESTAMERICA BANCORPORATION",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Certification of Chief Financial Officer pursuant to Securities Exchange Act Rule 13a-14(a)/15d-14(a)",
        "match": "These forward-looking statements are based on Management’s current knowledge and belief and include information concerning the Company’s possible or assumed future financial condition and results of operations. A number of factors, some of which are beyond the Company’s ability to predict or control, could cause future results to differ materially from those contemplated. These factors include but are not limited to (1) the length and severity of any difficulties in the global, national and California economies and the effects of government efforts to address those difficulties; (2) liquidity levels in capital markets; (3) fluctuations in asset prices including, but not limited to stocks, bonds, real estate, and commodities; (4) the effect of acquisitions and integration of acquired businesses; (5) economic uncertainty created by riots, terrorist threats and attacks on the United States, the actions taken in response, and the uncertain effect of these events on the local, regional and national economies; (6) changes in the interest rate environment; (7) changes in the regulatory environment; (8) competitive pressure in the banking industry; (9) operational risks including a failure or breach in data processing or security systems or those of third party vendors and other service providers, including as a result of cyber attacks or fraud; (10) volatility of interest rate sensitive loans, deposits and investments; (11) asset/liability management risks and liquidity risks; (12) the effect of natural disasters, including earthquakes, hurricanes, fire, flood, drought, and other disasters, on the uninsured value of the Company’s assets and of loan collateral, the financial condition of debtors and issuers of investment securities, the economic conditions affecting the Company’s market place, and commodities and asset values; (13) changes in the securities markets; (14) the duration and severity of the COVID-19 pandemic and governmental responses to the pandemic; and (15) the outcome of contingencies, such as legal proceedings. However, the reader should not consider the above-mentioned factors to be a complete set of all potential risks or uncertainties.",
        "after": "a decrease in the demand for loans and other products and services offered by the Company;"
    },
    "278": {
        "CIK": "0000351789",
        "Company Name": "ELECTRO SENSORS INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "(1) Shares issuable pursuant to the 2013 Equity Incentive Plan.",
        "match": "We purchase parts and materials for our systems from various manufacturers and distributors. In some instances, these materials are manufactured in accordance with our proprietary designs. Multiple sources of these parts and materials are generally available, and we, typically, do not depend on any single source for these supplies and materials. We have not experienced any significant problem of short supply or delays from our suppliers.  However, due to the outbreak of the COVID-19 pandemic, we are closely watching lead times and availability of components.  We are continually assessing our current inventory levels and take actions as necessary to minimize disruptions to our supply chain, although such actions may not be successful.",
        "after": "   "
    },
    "286": {
        "CIK": "0000353020",
        "Company Name": "Aegion Corp",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Pursuant to the requirements of Section 13 or 15(d) of the Securities Exchange Act of 1934, the registrant has duly caused this Report to be signed on its behalf by the undersigned, thereunto duly authorized.",
        "match": "The Private Securities Litigation Reform Act of 1995 provides a “safe harbor” for forward-looking statements. We make forward-looking statements in this Annual Report on Form 10-K for the year ended December 31, 2020 (this “Report”) that represent our beliefs or expectations about future events or financial performance. These forward-looking statements are based on information currently available to us and on management’s beliefs, assumptions, estimates and projections, are subject to risks, uncertainties and assumptions that are difficult to predict and are not guarantees of future events or results or statements of historical fact. Forward-looking statements include statements concerning business strategy, plans and prospects, among other things, including anticipated trends and developments in and management plans for our business and the markets in which we operate. In some cases, you can identify these statement by forward-looking words, such as  “estimate,” “expect,” “anticipate,” “project,” plan,” “intend,” “believe,” “forecast,” “foresee,” “likely,” “may,” “should,” “goal,” “target,” “might,” “will,” “could,” “predict,” and “continue,”  the negative or plural of these words and other comparable terminology. Such statements are subject to known and unknown risks, uncertainties and assumptions, including those referred to in the “Risk Factors” section of this Report, and in our subsequently filed documents, and, in particular, the impact of the current COVID-19 virus outbreak and the evolving response thereto both on the Company generally and on the other risks described therein, and the following factors:",
        "after": "As 2020 progressed, oil prices stabilized and we better understood the impact of the pandemic on our business.  As a result, we were able to bring back a majority of the furloughed workers, reverse the temporary cash wage reductions and reimburse employees for forgone wages and reinstate the employer contributions to 401(k) and other defined contribution plans. "
    },
    "298": {
        "CIK": "0000701869",
        "Company Name": "INDEPENDENCE HOLDING COMPANY",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Other Information",
        "match": "We continue to face risks related to the ongoing Coronavirus (COVID-19) pandemic that could impact our sales, operating results and financial condition.",
        "after": "QUARTER ENDED:"
    },
    "300": {
        "CIK": "0000702513",
        "Company Name": "Bank of Commerce Holdings",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "10.18",
        "match": "Developments and changes in Federal, state or local laws and regulations addressing the effects of the COVID-19 pandemic;",
        "after": "The Company files annual, quarterly and current reports, proxy statements and other business and financial information with the SEC. The SEC maintains an Internet site that contains the Company's SEC filings, as well as reports, proxy and information statements, and other information regarding issuers that file electronically with the SEC, located at http://www.sec.gov. These filings are also accessible free of charge at the Company's website at www.bankofcommerceholdings.com as soon as reasonably practicable after filing with the SEC. By making this reference to the Company's website, the Company does not intend to incorporate into this report any information contained in the website. The website should not be considered part of this report."
    },
    "308": {
        "CIK": "0000706698",
        "Company Name": "UTAH MEDICAL PRODUCTS INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "2)  Outside the U.S. (OUS) sales.  ",
        "match": "OUS sales in 2020, as a percentage of consolidated total USD sales, represented 39% compared to 41% in 2019.  The lower OUS share of total sales in 2020 was the result of more restrictions on medical procedures OUS, especially in Europe, due to the COVID-19 pandemic.  In USD terms, 58% of 2020 OUS sales were invoiced in foreign currencies. In addition, foreign subsidiary expenses are in the native currency of the respective country.  Therefore, changes in foreign currency exchange (FX) rates can have a significant impact on UTMD’s USD-reported financial results.  ",
        "after": "Year"
    },
    "312": {
        "CIK": "0000708781",
        "Company Name": "CASS INFORMATION SYSTEMS, INC.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "In order to develop a workforce that aligns with the Company’s corporate values, regularly sponsored campaigns and events occur, such as charitable workplace campaigns, food drives to assist local food banks, and toy drives to support charities during the holidays. Additionally, the Company supports a number of organizations with annual financial contributions. ",
        "match": "Cass strives to place the health and well-being of employees above all else. Never has this been more necessary than during the novel coronavirus (“COVID-19”) pandemic. In response to the COVID-19 pandemic, the Company has taken significant steps to protect the health and well-being of employees and clients. These steps include implementing a work-from-home policy for the majority of employees, establishing safety guidelines in facilities based on guidance from the U.S. Centers for Disease Control and Prevention (“CDC”), and pausing travel that was routine in the Company’s operations. ",
        "after": "39,930 "
    },
    "322": {
        "CIK": "0000712771",
        "Company Name": "ConnectOne Bancorp, Inc.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Forward Looking Statements ",
        "match": "This report, in Item 1, Item 7 and elsewhere, includes forward-looking statements within the meaning of Sections 27A of the Securities Act of 1933, as amended, and 21E of the Securities Exchange Act of 1934, as amended, that involve inherent risks and uncertainties. These forward-looking statements concern the financial condition, results of operations, plans, objectives, future performance and business of ConnectOne Bancorp, Inc. and its subsidiaries, including statements preceded by, followed by or that include words or phrases such as “believes,” “expects,” “anticipates,” “plans,” “trend,” “objective,” “continue,” “remain,” “pattern” or similar expressions or future or conditional verbs such as “will,” “would,” “should,” “could,” “might,” “can,” “may” or similar expressions. There are a number of important factors that could cause future results to differ materially from historical performance and these forward-looking statements. Factors that might cause such a difference include, but are not limited to: (1) the impact of the COVID-19 pandemic and the government’s response to the pandemic on our operations as well as those of our customers and on the economy generally and in our market area specifically, (2) competitive pressures among depository institutions may increase significantly; (3) changes in the interest rate environment may reduce interest margins; (4) prepayment speeds, loan origination and sale volumes, charge-offs and loan loss provisions may vary substantially from period to period; (5) general economic conditions may be less favorable than expected; (6) political developments, wars or other hostilities may disrupt or increase volatility in securities markets or other economic conditions; (7) legislative or regulatory changes or actions may adversely affect the businesses in which ConnectOne Bancorp, Inc. is engaged; (8) changes and trends in the securities markets may adversely impact ConnectOne Bancorp, Inc.; (9) a delayed or incomplete resolution of regulatory issues could adversely impact our planning; (10) difficulties in integrating any businesses that we may acquire, which may increase our expenses and delay the achievement of any benefits that we may expect from such acquisitions; (11) the impact of reputation risk created by the developments discussed above on such matters as business generation and retention, funding and liquidity could be significant; and (12) the outcome of any future regulatory and legal investigations and proceedings may not be anticipated. Further information on other factors that could affect the financial results of ConnectOne Bancorp, Inc. are included in Item 1A of this Annual Report on Form 10-K and in ConnectOne Bancorp’s other filings with the Securities and Exchange Commission. These documents are available free of charge at the Commission’s website at http://www.sec.gov and/or from ConnectOne Bancorp, Inc. ConnectOne Bancorp, Inc. assumes no obligation to update forward-looking statements at any time. ",
        "after": "Historical Development of Business "
    },
    "340": {
        "CIK": "0000719402",
        "Company Name": "FIRST NATIONAL CORP /VA/",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Washington, D.C. 20549",
        "match": "CARES Act. In response to the COVID-19 pandemic, President Trump signed into law the CARES Act on March 27, 2020. Among other things, the CARES Act included the following provisions impacting financial institutions:",
        "after": "The pandemic has negatively impacted the financial condition of certain loan customers. The Bank expects certain sectors of its commercial real estate loan portfolio, including retail shopping, lodging and leisure, may experience elevated financial pressure in future periods. Those sectors comprised 5%, 5% and 2% of the loan portfolio, respectively, excluding PPP loans, at December 31, 2020. The Bank also expects that loans in those same sectors of its commercial and industrial loan portfolio may experience financial pressure in future periods. The magnitude of the potential decline in the Bank’s loan quality in future periods will likely depend on the duration of the pandemic and the extent that the Bank’s customers experience business interruptions."
    },
    "342": {
        "CIK": "0000719413",
        "Company Name": "HECLA MINING CO/DE/",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Scotia",
        "match": "Natural disasters, public health crises (including COVID-19), political crises, and other catastrophic events or other events outside of our control may materially and adversely affect our business or financial results.",
        "after": "industrial accidents;"
    },
    "360": {
        "CIK": "0000727273",
        "Company Name": "CADIZ INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "NOTE 12 – LEASES",
        "match": "COVID-19",
        "after": "Cadiz Inc. Consolidated Financial Statements "
    },
    "362": {
        "CIK": "0000728535",
        "Company Name": "HUNT J B TRANSPORT SERVICES INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "At  December 31, 2020, we had $64.5 million and $17.1 million of total unrecognized compensation expense related to restricted share units and performance share units, respectively, that is expected to be recognized on a straight-line basis over the remaining weighted average vesting period of approximately 3.0 years for restricted share units and 2.9 years for performance share units.",
        "match": "This report, including documents which are incorporated by reference and other documents which we file periodically with the Securities and Exchange Commission (SEC), contains statements that may be considered to be “forward-looking statements.” Such statements relate to our predictions concerning future events or operations and are within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. When we use words like “may,” “plan,” “contemplate,” “anticipate,” “believe,” “intend,” “continue,” “expect,” “project,” “goals,” “strategy,” “future,” “predict,” “seek,” “estimate,” “likely,” “could,” “should,” “would,” and similar expressions, you should consider them as identifying forward-looking statements, although we may use other phrasing. Forward-looking statements are inherently uncertain, subject to risks, and should be viewed with caution. These statements are based on our belief or interpretation of information currently available. Stockholders and prospective investors are cautioned that actual results and future events may differ materially from these forward-looking statements as a result of many factors. Some of the factors and events that are not within our control and that could have a material impact on future operating results include the following: general economic and business conditions; potential business or operational disruptions resulting from the ongoing effects of the novel coronavirus (COVID-19) pandemic, including any future spikes or outbreaks of the virus, as well as government actions taken in response to the pandemic; competition and competitive rate fluctuations; excess capacity in the intermodal or trucking industries; a loss of one or more major customers; cost and availability of diesel fuel; interference with or termination of our relationships with certain railroads; rail service delays; disruptions to U.S. port-of-call activity; ability to attract and retain qualified drivers, delivery personnel, independent contractors, and third-party carriers; retention of key employees; insurance costs and availability; litigation and claims expense; determination that independent contractors are employees; new or different environmental or other laws and regulations; volatile financial credit markets or interest rates; terrorist attacks or actions; acts of war; adverse weather conditions; disruption or failure of information systems; operational disruption or adverse effects of business acquisitions; increased costs for new revenue equipment; increased tariffs assessed on or disruptions in the procurement of imported revenue equipment; decreases in the value of used equipment; and the ability of revenue equipment manufacturers to perform in accordance with agreements for guaranteed equipment trade-in values.",
        "after": "Communication and utilities"
    },
    "364": {
        "CIK": "0000729580",
        "Company Name": "BEL FUSE INC /NJ",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Daniel Bernstein",
        "match": "The Company's consolidated operating results are affected by a wide variety of factors that could materially and adversely affect revenues and profitability, including the risk factors described in Item 1A of this Form 10-K. As a result of these and other factors, the Company may experience material fluctuations in future operating results on a quarterly or annual basis, which could materially and adversely affect its business, consolidated financial condition, operating results, and common stock prices.  Furthermore, this document and other documents filed by the Company with the Securities and Exchange Commission (\"SEC\") contain certain forward-looking statements under the Private Securities Litigation Reform Act of 1995 (\"Forward-Looking Statements\") with respect to the business of the Company.  Forward-Looking Statements are necessarily subject to risks and uncertainties, many of which are outside our control, that could cause actual results to differ materially from these statements. Forward-Looking Statements can be identified by such words as \"anticipates,\" \"believes,\" \"plan,\" \"assumes,\" \"could,\" \"should,\" \"estimates,\" \"expects,\" \"intends,\" \"potential,\" \"seek,\" \"predict,\" \"may,\" \"will\" and similar references to future periods.  All statements other than statements of historical facts included in this report regarding our strategies, prospects, financial condition, operations, costs, plans and objectives and regarding the anticipated impact of COVID-19 are Forward-Looking Statements.  These Forward-Looking Statements are subject to certain risks and uncertainties, including those detailed in Item 1A. of this Form 10-K, which could cause actual results to differ materially from these Forward-Looking Statements.  The Company undertakes no obligation to publicly release the results of any revisions to these Forward-Looking Statements which may be necessary to reflect events or circumstances after the date hereof or to reflect the occurrence of unanticipated events.  Any Forward-Looking Statement made by the Company is based only on information currently available to us and speaks only as of the date on which it is made.",
        "after": "The information called for by this Item is incorporated herein by reference to the caption \"Legal Proceedings\" in Note 17, \"Commitments and Contingencies.\""
    },
    "370": {
        "CIK": "0000741516",
        "Company Name": "AMERICAN NATIONAL BANKSHARES INC.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "101.CAL",
        "match": "Unemployment levels in each Virginia market the Company serves have continued to improve from their COVID-19 related highs in early to mid 2020.  Service sectors, financials, medical, manufacturing, construction, timber management and production, and technology related businesses have remained strong while hospitality, restaurants, travel & tourism, meeting spaces, and fitness facilities continue to suffer from the COVID-19 restrictions.  Other important business industries include farming, tobacco processing and sales, and food processing.  New businesses continue to move into the Company's Virginia footprint, which has been positive for economic growth.",
        "after": "PART II"
    },
    "374": {
        "CIK": "0000743238",
        "Company Name": "SHYFT GROUP, INC.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": " Document",
        "match": "Impact of COVID-19",
        "after": "Our stock price has been and may continue to be volatile, which may result in losses to our shareholders."
    },
    "378": {
        "CIK": "0000744187",
        "Company Name": "REX AMERICAN RESOURCES CORPORATION",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "NOTES TO CONSOLIDATED FINANCIAL STATEMENTS",
        "match": "This Form 10-K contains or may contain\nforward-looking statements as defined in the Private Securities Litigation Reform Act of 1995. Such statements can be identified\nby use of forward-looking terminology such as “may,” “expect,” “believe,” “estimate,”\n“anticipate” or “continue” or the negative thereof or other variations thereon or comparable terminology.\nReaders are cautioned that there are risks and uncertainties that could cause actual events or results to differ materially from\nthose referred to in such forward-looking statements. These risks and uncertainties include the risk factors set forth from time\nto time in the Company’s filings with the Securities and Exchange Commission and include among other things: the effect of\npandemics such as COVID-19 on the Company’s business operations, including impacts on supplies, demand, personnel and other\nfactors, the impact of legislative and regulatory changes, the price volatility and availability of corn, distillers grains, ethanol,\nnon-food grade corn oil, gasoline and natural gas, logistical delays, our ethanol and refined coal plants operating efficiently\nand according to forecasts and projections, changes in the international, national or regional economies, weather, results of income\ntax audits, changes in income tax laws or regulations, the impact of U.S. foreign trade policy, changes in foreign currency exchange\nrates and the effects of terrorism or acts of war. The Company does not intend to update publicly any forward-looking statements\nexcept as required by law. Other factors that could cause actual results to differ materially from those in the forward-looking\nstatements are set forth in Item 1A.",
        "after": "Loss Before Income Taxes\n– As a result of the foregoing, loss before income taxes was approximately $1.5 million for fiscal year 2020 versus loss\nof approximately $1.2 million for fiscal year 2019."
    },
    "416": {
        "CIK": "0000768411",
        "Company Name": "CYBEROPTICS CORP",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "3.2",
        "match": "Important factors, among others, that may affect our actual results include: a possible world-wide recession or depression resulting from the economic consequences of the COVID-19 pandemic; the negative effect on our revenue and operating results of the COVID-19 crisis on our customers and suppliers and the global supply chain; market conditions in the global SMT and semiconductor capital equipment industries; trade relations between the United States and China and other countries; the timing of orders and shipments of our products, particularly our 3D MRS SQ3000 Multi-Function systems and MX systems for memory module inspection; increasing price competition and price pressure on our product sales, particularly our SMT systems; the level of orders from our OEM customers; the availability of parts required to meet customer orders; unanticipated product development challenges; the effect of world events on our sales, the majority of which are from foreign customers; rapid changes in technology in the electronics and semiconductor markets; product introductions and pricing by our competitors; the success of our 3D technology initiatives; the market acceptance of our SQ3000 Multi-Function inspection and measurement systems and products for semiconductor advanced packaging inspection and metrology; costly and time consuming litigation with third parties related to intellectual property infringement; the negative impact on our customers and suppliers due to past and future terrorist threats and attacks and any acts of war; the impact of the MX3000 orders on our consolidated gross margin percentage in any future period; and risks related to cancellation or renegotiation of orders we have received. Our ability to implement our strategy effectively is subject to numerous uncertainties and risks, including the risks identified in Item 1A of this Annual Report on Form 10-K. There can be no assurance that our strategy will be successful.  ",
        "after": "   "
    },
    "424": {
        "CIK": "0000774569",
        "Company Name": "CORTLAND BANCORP INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Director",
        "match": "In December 2018, the bank regulatory agencies issued a final rule to address regulatory treatment of credit loss allowances under the current expected credit loss (CECL) model (accounting standard).  The rule revised the bank regulatory agencies’ regulatory capital rules to identify which credit loss allowances under the CECL model are eligible for inclusion in regulatory capital and to provide banking organizations the option to phase in over three years the day-one adverse effects on regulatory capital that may result from the adoption of the CECL model. Concurrent with the enactment of the Coronavirus Aid, Relief, and Economic Security Act of 2020, as amended (the CARES Act), discussed further below, federal banking agencies issued an interim final rule that delayed the estimated impact on regulatory capital resulting from the adoption of CECL. The interim final rule provided banking organizations that implemented CECL prior to the end of 2020 the option to delay for two years the estimated impact of CECL on regulatory capital relative to regulatory capital determined under the prior incurred loss methodology, followed by a three-year transition period to phase out the aggregate amount of capital benefit provided during the initial two-year delay. On August 26, 2020, the bank regulatory agencies issued a final rule that made certain technical changes to the interim final rule, including expanding the pool of eligible institutions. The changes in the final rule applied only to those banking organizations that elected the CECL transition relief provided for under the rule. Under the Consolidated Appropriations Act, 2021 (the CAA), discussed further below, bank holding companies and their affiliates now have the option of postponing implementation of CECL until the earlier of (i) the end of the national emergency declaration related to COVID-19 or (ii) December 31, 2022. Congress provided this reprieve for a variety of reasons, including the fact that COVID-19 has created a volatile, uncertain lending environment that may result in significant credit losses for banks.",
        "after": "Telephone: 612-303-6000"
    },
    "438": {
        "CIK": "0000788965",
        "Company Name": "HALLADOR ENERGY CO",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Information related to leases was as follows as of  December 31 (in thousands): ",
        "match": "We are committed to protecting our employees and doing our part to mitigate the spread of COVID-19 while implementing contingency plans to ensure that we continue to supply our customers without interruption. As the situation continues to evolve, we will monitor the Center for Disease Control and Prevention (CDC) guidelines to keep our employees and their families safe.  We have taken measures to minimize the spread of germs at our offices and mining locations and educating our employees on how they can reduce the risk of spreading germs to one another.   We have implemented social distancing measures while keeping our employees informed about health and safety. Management encourages employees to stay home when they are sick and has adapted our sick day policy to promote time off for illnesses.",
        "after": "Operating costs"
    },
    "454": {
        "CIK": "0000796534",
        "Company Name": "NATIONAL BANKSHARES INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Consumer Non Real Estate Loans. Consumer loans include loans secured by automobiles, loans to consumers secured by other non-real estate collateral and loans to consumers that are unsecured. Automobile loans include loans secured by new or used automobiles. We originate automobile loans on a direct basis. During 2018 and years prior, automobile loans were also originated on an indirect basis through selected dealerships. This program was discontinued in 2019. We require borrowers to maintain collision insurance on automobiles securing consumer loans. Our procedures for underwriting consumer loans include an assessment of an applicant’s overall financial capacity, including credit history and the ability to meet existing obligations and payments on the proposed loan. An applicant’s creditworthiness is the primary consideration, and if the loan is secured by an automobile or other collateral, the underwriting process also includes a comparison of the value of the collateral security to the proposed loan amount.",
        "match": "SBA Paycheck Protection Program. In response to the COVID-19 pandemic, the Coronavirus Aid, Relief, and Economic Security Act (\"CARES Act\") was signed into law on March 27, 2020.  The CARES Act created the Small Business Administration (\"SBA\") Paycheck Protection Program (\"PPP\").  Under the PPP, money was authorized for small business loans to pay payroll and group health costs, salaries and commissions, mortgage and rent payments, utilities and interest on other debt.  The Company assisted customers in obtaining the loans during the application window between April and August 2020. As of December 31, 2020, the Company held $35,992 in PPP loans, net of deferred fees and costs. The Company is currently participating in the SBA lending window that opened in January 2021.",
        "after": "Other Products and Services. Deposit products offered by the Bank include interest-bearing and non-interest bearing demand deposit accounts, money market deposit accounts, savings accounts, certificates of deposit, health savings accounts and individual retirement accounts. Deposit accounts are offered to both individuals and commercial businesses. Business and consumer debit and credit cards are available. NBB offers other miscellaneous services normally provided by commercial banks, such as letters of credit, night depository, safe deposit boxes, utility payment services and automatic funds transfer. NBB conducts a general trust business that has wealth management, trust and estate services for individual and business customers. "
    },
    "460": {
        "CIK": "0000798287",
        "Company Name": "PAM TRANSPORTATION SERVICES INC ",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Under",
        "match": "This Annual Report on Form 10-K (this “Report”) contains forward-looking statements, including statements about our operating and growth strategies, our expected financial position and operating results, industry trends, our capital expenditure and financing plans and similar matters. Such forward-looking statements are found throughout this Report, including under Item 1, Business, Item 1A, Risk Factors, Item 7, Management’s Discussion and Analysis of Financial Condition and Results of Operations, and Item 7A, Quantitative and Qualitative Disclosures About Market Risk. In those and other portions of this Report, the words “believe,” “may,” “will,” “estimate,” “continue,” “anticipate,” “intend,” “expect,” “project”, “could”, “should”, “would” and similar expressions, as they relate to us, our management, and our industry are intended to identify forward-looking statements. We have based these forward-looking statements largely on our current expectations and projections about future events and financial trends affecting our business. Actual results may differ materially. Some of the risks, uncertainties and assumptions that may cause actual results to differ from these forward-looking statements include, but are not limited to, ongoing and potential future economic, business and operational disruptions and uncertainties due to the COVID-19 pandemic or other public health crises; excess capacity in the trucking industry; surplus inventories; recessionary economic cycles and downturns in customers’ business cycles; increases or rapid fluctuations in fuel prices, interest rates, fuel taxes, tolls, and license and registration fees; the resale value of the Company’s used equipment and the price of new equipment; increases in compensation for and difficulty in attracting and retaining qualified drivers and owner-operators; increases in insurance premiums and deductible amounts relating to accident, cargo, workers’ compensation, health, and other claims; unanticipated increases in the number or amount of claims for which the Company is self-insured; inability of the Company to continue to secure acceptable financing arrangements; seasonal factors such as harsh weather conditions that increase operating costs; competition from trucking, rail, and intermodal competitors including reductions in rates resulting from competitive bidding; the ability to identify acceptable acquisition candidates, consummate acquisitions, and integrate acquired operations; our ability to develop and implement suitable information technology systems and prevent failures in or breaches of such systems; the impact of future or pending litigation; general risks associated with doing business in Mexico, including, without limitation, exchange rate fluctuations, inflation, import duties, tariffs, quotas, political and economic instability and terrorism; the potential impact of new laws, regulations or policy, including, without limitation, tariffs, import/export, trade and immigration regulations or policies; a significant reduction in or termination of the Company’s trucking service by a key customer; and other factors described under the headings “Risk Factors,” “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” and “Quantitative and Qualitative Disclosures About Market Risk” of this Report.",
        "after": "Operating revenues, before fuel surcharge"
    },
    "466": {
        "CIK": "0000799167",
        "Company Name": "MARTEN TRANSPORT LTD",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Our Code of Ethics for Senior Financial Management applies to all of our executive officers, including our principal executive officer, principal financial officer and controller, and meets the requirements of the Securities and Exchange Commission. We have posted our Code of Ethics for Senior Financial Management on our website at www.marten.com. We intend to disclose any amendments to and any waivers from a provision of our Code of Ethics for Senior Financial Management on our website within five business days following such amendment or waiver.",
        "match": "The health and wellbeing of our employees is paramount to our success. We sponsor a wellness program designed to enhance the wellbeing of all our employees. The COVID-19 pandemic has also heightened our responsibility of ensuring our employees have a safe work environment and we have implemented numerous efforts to keep our valued employees safe, healthy and informed. We believe that maintaining a healthy, safe and productive professional driver group is essential to providing excellent customer service and achieving profitability. We select drivers, including independent contractors, using our specific guidelines for safety records, including drivers’ Compliance, Safety, Accountability, or CSA, scores, driving experience, and personal evaluations. We maintain stringent screening, training, and testing procedures for our drivers to reduce the potential for accidents and the corresponding costs of insurance and claims. We train new drivers at a number of our terminals in all phases of our policies and operations, as well as in safety techniques and fuel-efficient operation of the equipment. All new drivers also must pass DOT required tests prior to assignment to a vehicle.",
        "after": "Fuel and fuel taxes"
    },
    "512": {
        "CIK": "0000822663",
        "Company Name": "INTER PARFUMS INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "(In thousands except share and per share\ndata)",
        "match": "Actual\nresults, performance or achievements could differ materially from those contemplated, expressed or implied by the forward-looking\nstatements contained in this report. Important factors that could cause actual results to differ materially from our forward-looking\nstatements are set forth in this report, including under the heading “Risk Factors”. Such factors include: The effects\nof COVID-19 and related governmental mandates; our inability to successfully integrate or manage any future acquisitions; continuation\nand renewal of existing licenses and similar agreements; potential inability to obtain new licensing, arrangements or agreements\nfor additional brands; potential reduction in sales of our fragrance products due to reduced consumer confidence as the result\nof a prolonged economic downturn, recession or terrorist attack in the United States, Europe or any of the other countries in\nwhich we do significant business; uncertainties and deterioration in global credit markets could negatively impact suppliers,\ncustomers and consumers; outbreak of disease, epidemic or pandemic, or similar public health threat, such as the coronavirus;\ninability to protect our intellectual property rights; potential liability for infringement of third party brand names; product\nliability claims; effectiveness of our sales and marketing efforts and product acceptance by consumers; our dependence upon third\nparty manufacturers and distributors; our dependence upon existing management; competition in the fragrance industry; risks related\nto our foreign operations, currency fluctuation and international tariff and trade barriers; compliance with governmental regulation;\npotential negative effects of “Brexit”; potential hacking and outages of our global information systems; seasonal\nvariability of our business; our ability to operate our business without infringing, and misappropriating or otherwise violating\nthe intellectual property rights of other parties.",
        "after": "Our conservative financial tradition has\nenabled us to amass and maintain hefty cash balances and nominal long-term debt levels when this pandemic began. Nonetheless, we\ntook several actions to minimize expenses and protect cash flow. Our operating cost structure, of which variable costs typically\naccounts for over two-thirds, has enabled us to minimize the impact of reduced net sales on our bottom line. In that regard, we\npostponed the launch of several programs originally scheduled for 2020 until 2021 and moved related advertising and promotion expenses\nto 2021 as well. That includes our planned launches for the Kate Spade New York, Jimmy Choo, Anna Sui and GUESS brands. We also\ntook several actions with an eye toward minimizing fixed expenses. While we did not terminate or furlough any employees, we did\ninstitute a hiring freeze and significantly cut bonuses for 2020. We also temporarily suspended our quarterly cash dividend. These\nactions have had a favorable impact on the Company’s fixed expenditures and cash flow. Furthermore, our cash and credit management\nteams, together with our executive management teams, paid particular attention to the management of working capital. As a result\nof the above, we did not experience any short-term liquidity problem or incur any significant credit losses."
    },
    "522": {
        "CIK": "0000834285",
        "Company Name": "REPUBLIC FIRST BANCORP INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "At  December 31, 2020, the Company had forty-two operating lease agreements, which include operating leases for twenty branch locations, seven offices that are used for general office space, and fifteen operating leases for equipment. Two of the real property operating leases did not include one or more options to extend the lease term. Eight of the operating leases for branch locations are land leases where the Company is responsible for the construction of the building on the property. The forty-two operating leases have maturity dates ranging from  August 2021 to  August 2059 most of which include options for multiple five and ten year extensions which the Company is reasonably certain to exercise. No operating leases include variable lease payments that are based on an index or rate, such as the CPI. The weighted average remaining operating lease term for these leases is 21.04 years as of  December 31, 2020.",
        "match": "the negative impacts and disruptions of the COVID-19 pandemic and measures taken to contain its spread on our employees, customers, business operations, credit quality, financial position, liquidity and results of operations;",
        "after": "Our selected financial data contains a non-GAAP financial measure calculated using non-GAAP amounts. This measure is tangible book value per common share. Tangible book value per share adjusts the numerator by the amount of Goodwill and Other Intangible Assets (as a reduction of Shareholders’ Equity). Management uses non-GAAP measures to present historical periods comparable to the current period presentation. In addition, management believes the use of non-GAAP measures provides additional clarity when assessing our financial results and use of equity. Disclosures of this type should not be viewed as substitutes for results determined to be in accordance with U.S. GAAP, nor are they necessarily comparable to non-GAAP performance measures that may be presented by other entities."
    },
    "524": {
        "CIK": "0000834365",
        "Company Name": "BIOLIFE SOLUTIONS INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "(9)",
        "match": "This Annual Report on Form 10-K (“Form 10-K” or “Annual Report”) contains forward-looking statements which are made pursuant to the safe harbor provisions of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). The forward-looking statements in this Form 10-K do not constitute guarantees of future performance and actual results could differ materially from those contained in the forward-looking statements. These statements are based on current expectations of future events. Such statements include, but are not limited to, statements about our products, including our newly acquired products, customers, regulatory approvals, the potential utility of and market for our products and services, our ability to implement our business strategy and anticipated business and operations, in particular following our 2019 and 2020 acquisitions, future financial and operational performance, our anticipated future growth strategy, including the closing of our merger with Global Cooling, Inc. and the acquisition of other synergistic cell and gene therapy manufacturing tools and services or technologies or other companies or technologies, capital requirements, intellectual property, suppliers, joint venture partners, future financial and operating results, the impact of the COVID-19 pandemic, plans, objectives, expectations and intentions, revenues, costs and expenses, interest rates, outcome of contingencies, business strategies, regulatory filings and requirements, the estimated potential size of markets, capital requirements, the terms of any capital financing agreements and other statements that are not historical facts. You can find many of these statements by looking for words like “believes,” “expects,” “anticipates,” “estimates,” “may,” “should,” “will,” “could,” “plan,” “intend,” or similar expressions in this Form 10-K. We intend that such forward-looking statements be subject to the safe harbors created thereby.",
        "after": "The CBS acquisition was accounted for as a purchase of a business under FASB ASC Topic 805, “Business Combinations”. Under the acquisition method of accounting, the acquired assets and liabilities assumed from CBS were recorded as of the acquisition date, at their fair values, and consolidated with BioLife. The fair value of the net tangible assets acquired is $6.0 million, the fair value of the identifiable intangibles is $6.8 million, and the residual goodwill is $3.1 million. The fair value estimates required critical estimates, including, but not limited to, future expected cash flows, revenue and expense projections, discount rates, revenue volatility, and royalty rates. BioLife believes these estimates to be reasonable. Actual results may differ from these estimates."
    },
    "526": {
        "CIK": "0000835324",
        "Company Name": "Stock Yards Bancorp, Inc.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Securities Sold Under Agreements to Repurchase",
        "match": "COVID-19",
        "after": "Coronavirus Disease - 2019"
    },
    "560": {
        "CIK": "0000855658",
        "Company Name": "Lattice Semiconductor Corp",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Deferred tax liabilities:",
        "match": "Forward-looking statements include, but are not limited to, statements about: our opportunities to increase our addressable market; our expectations and strategies regarding market trends and opportunities, including market segment drivers such as 5G infrastructure deployments, cloud and enterprise servers, client computing platforms, industrial Internet of Things, factory automation, automotive electronics, smart homes and prosumers; our beliefs about who we may compete with and how we are differentiated from those competitors; our future investments in research and development and our research and development expense efficiency; whether we will experience seasonality or cyclicality; our expectations about our patent portfolio, including the expiration of patents, whether, when and where we will make future filings, and the value of the patents generally and to our business; our ability to attract and retain personnel and their importance to our performance; our target or expected financial performance and our ability to achieve those results; future financial results or accounting treatments; future impacts of the COVID-19 pandemic, including as a result of actions by governments, businesses, and individuals in response to the situation, on consumer, industrial, and financial markets, our business operations, supply chain and partners, financial performance, results of operations, financial position, and the achievement of our strategic objectives; our use of cash; our judgments involved in accounting matters, including revenue recognition, inventories and cost of revenue and income taxes; our investments in research and development; the continued effectiveness of our internal controls over financial reporting; our expectations regarding product offerings; whether we will consider and act upon acquisition opportunities to extend our product, technology and product offerings; our expectations regarding our customer base; the expected costs of our restructuring plans; our expectations regarding taxes, including unrecognized tax benefits, and tax adjustments and allowances; our beliefs regarding the adequacy of our liquidity, capital resources and facilities; and our beliefs regarding legal proceedings.",
        "after": "The composition of our Amortization of acquired intangible assets, including as a percentage of revenue, is presented in the following table:"
    },
    "570": {
        "CIK": "0000859070",
        "Company Name": "FIRST COMMUNITY BANKSHARES INC /VA/",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Total other operating expense",
        "match": "The list of important factors is not exclusive. If one or more of the factors affecting these forward-looking statements proves incorrect, actual results, performance, or achievements could differ materially from those expressed in, or implied by, forward-looking statements contained in this Annual Report on Form 10-K and other reports we file with the Securities and Exchange Commission. Therefore, the Company cautions you not to place undue reliance on forward-looking information and statements. Further, statements about the potential effects of the COVID-19 pandemic on our business, financial condition, liquidity and results of operations may contain forward-looking statements and are subject to the risk that the actual effects may differ, possibly materially, from what is reflected in those forward-looking statements due to factors and future developments that are uncertain, unpredictable and in many cases beyond our control.  Further, statements about the potential effects of the COVID-19 pandemic on our business, financial condition, liquidity and results of operations may contain forward-looking statements and are subject to the risk that the actual effects may differ, possibly materially, from what is reflected in those forward-looking statements due to factors and future developments that are uncertain, unpredictable and in many cases beyond our control.  The Company does not intend to update any forward-looking statements, whether written or oral, to reflect changes. These cautionary statements expressly qualify all forward-looking statements that apply to the Company including the risk factors presented in Part I, Item 1A of this report.",
        "after": "Liabilities and stockholders' equity"
    },
    "572": {
        "CIK": "0000861459",
        "Company Name": "GRANITE CONSTRUCTION INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "We believe that people are our most valuable asset and their safety is our greatest responsibility. We also understand that Safety and Health are key components for achieving operational excellence, and as such, are a core value of all our operations. Our safety culture is reinforced with relationship-based training, shared knowledge, and engagement at every level of our organization while striving for zero workplace injuries.",
        "match": "Our safety focus is also evident in our response to the COVID-19 pandemic around the country. We have:",
        "after": "All of our work is deemed essential and critical, as such, we have invested in creating physically safe work environments for our employees. "
    },
    "576": {
        "CIK": "0000861842",
        "Company Name": "Cathay General Bancorp",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Total equity securities",
        "match": "The COVID-19 pandemic has caused a significant global economic downturn, which has, and is expected to continue to, adversely affected our business and results of operations.",
        "after": "Liquidity is essential to our business. An inability to raise funds through deposits, FHLB advances and other borrowings, the sale of loans, the issuance of securities and other sources could have a material adverse effect on our liquidity. Our access to funding sources in amounts adequate to finance our activities could be impaired by factors that affect us specifically or the financial services industry in general. Factors that could detrimentally impact our access to liquidity sources include a decrease in the level of our business activity due to a market downturn or adverse regulatory action against us. Deposit balances can decrease when customers perceive alternative investments as providing a better risk/return tradeoff. If customers move money out of bank deposits and into other investments, we would lose a relatively low-cost source of funds, increasing our funding costs and reducing our net interest income and net income. Our ability to acquire deposits or borrow could also be impaired by factors that are not specific to us, such as a severe disruption of the financial markets or negative views and expectations about the prospects for the financial services industry as a whole.  "
    },
    "594": {
        "CIK": "0000866609",
        "Company Name": "ION GEOPHYSICAL CORP",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Existing Second Lien Notes",
        "match": "COVID-19 Business Impact and Response",
        "after": "Our management expects continued portfolio rationalization and high grading as E&P companies seek to find the best return on investment opportunities to meet oil and gas demand in the next decade. Near-term, due to the impact of the COVID-19, project high grading will likely be more acute due to budget reductions.  Over the last several years, we strategically shifted our portfolio closer to the reservoir, where revenue tends to be higher and more consistent. New Venture data acquisition offshore and Software and related personnel-based offshore services are expected to continue to be most impacted by COVID-19 travel restrictions. While offshore operations have been temporarily impacted by travel restrictions, we believe the demand for digitalization technologies will remain strong. In some cases, ION technology is expected to be more relevant and valuable in the current environment (for instance, offerings that facilitate remote working). "
    },
    "596": {
        "CIK": "0000867665",
        "Company Name": "ABRAXAS PETROLEUM CORP",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Level 2 - inputs to the valuation methodology include quoted prices for similar assets and liabilities in active markets, and inputs that are observable for the asset or liability, either directly or indirectly, for substantially the full term of the financial instrument.",
        "match": "COVID-19 Overview",
        "after": "Gross"
    },
    "610": {
        "CIK": "0000875657",
        "Company Name": "Ultralife Corp",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Cost",
        "match": "The Private Securities Litigation Reform Act of 1995 provides a “safe harbor” for forward-looking statements.  This report contains certain forward-looking statements and information that are based on the beliefs of management as well as assumptions made by and information currently available to management.  The statements contained in this report relating to matters that are not historical facts are forward-looking statements that involve risks and uncertainties, including, but not limited to, the impact of COVID-19 on our business, operating results and financial condition; our reliance on certain key customers; the unique risks associated with our China operations; fluctuations in the price of oil and the resulting impact on the level of downhole drilling; possible breaches in information systems security and other disruptions; our efforts to develop new commercial applications for our products; reduced U.S. and foreign military spending including the uncertainty associated with government budget approvals; possible future declines in demand for the products that use our batteries or communications systems; potential disruptions in our supply of raw materials and components; our resources being overwhelmed by our growth prospects; our ability to retain top management and key personnel; potential costs because of the warranties we supply with our products and services; safety risks, including the risk of fire; our entrance into new end-markets which could lead to additional financial exposure; variability in our quarterly and annual results and the price of our common stock; our inability to comply with changes to the regulations for the shipment of our products; our customers’ demand falling short of volume expectations in our supply agreements; our ability to utilize our net operating loss carryforwards; negative publicity of Lithium-ion batteries; our exposure to foreign currency fluctuations; possible impairments of our goodwill and other intangible assets; the risk that we are unable to protect our proprietary and intellectual property; rules and procedures regarding contracting with the U.S. and foreign governments; exposure to possible violations of the U.S. Foreign Corrupt Practices Act, the U.K. Bribery Act or other anti-corruption laws; known and unknown environmental matters; possible audits of our contracts by the U.S. and foreign governments and their respective defense agencies; our ability to comply with government regulations regarding the use of “conflict minerals”; technological innovations in the non-rechargeable and rechargeable battery industries; and other risks and uncertainties, certain of which are beyond our control.",
        "after": "December 31,"
    },
    "614": {
        "CIK": "0000876378",
        "Company Name": "ASENSUS SURGICAL, INC.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Procedure Volumes",
        "match": "In 2020, surgeons performed over 1,450 procedures utilizing the Senhance System, representing a 10% decrease over the previous year, which was less than our goal as a result of the impact of the COVID-19 pandemic on elective surgeries and hospital operations. These procedures included general surgery, gynecology, urology, colorectal and bariatric surgical cases.",
        "after": "other non-U.S. regulatory authorities may not approve our processes or facilities or those of any of our third-party manufacturers, thereby restricting export; or"
    },
    "626": {
        "CIK": "0000879101",
        "Company Name": "KIMCO REALTY CORP",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "HARPER'S CHOICE",
        "match": "This annual report on Form 10-K (“Form 10-K”), together with other statements and information publicly disseminated by Kimco Realty Corporation (the “Company”) contains certain forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended. The Company intends such forward-looking statements to be covered by the safe harbor provisions for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995 and includes this statement for purposes of complying with the safe harbor provisions. Forward-looking statements, which are based on certain assumptions and describe the Company’s future plans, strategies and expectations, are generally identifiable by use of the words “believe,” “expect,” “intend,” “anticipate,” “estimate,” “project,” “will,” “target,” “forecast” or similar expressions. You should not rely on forward-looking statements since they involve known and unknown risks, uncertainties and other factors which are, in some cases, beyond the Company’s control and could materially affect actual results, performances or achievements. Factors which may cause actual results to differ materially from current expectations include, but are not limited to, (i) general adverse economic and local real estate conditions, (ii) the inability of major tenants to continue paying their rent obligations due to bankruptcy, insolvency or a general downturn in their business, (iii) financing risks, such as the inability to obtain equity, debt or other sources of financing or refinancing on favorable terms to the Company, (iv) the Company’s ability to raise capital by selling its assets, (v) changes in governmental laws and regulations and management’s ability to estimate the impact of such changes, (vi) the level and volatility of interest rates and management’s ability to estimate the impact thereof, (vii) pandemics or other health crises, such as coronavirus disease 2019 (“COVID-19”), (viii) the availability of suitable acquisition, disposition, development and redevelopment opportunities, and risks related to acquisitions not performing in accordance with our expectations, (ix) valuation and risks related to the Company’s joint venture and preferred equity investments, (x) valuation of marketable securities and other investments including the shares of Albertsons Companies, Inc. common stock held by the Company, (xi) increases in operating costs, (xii) changes in the dividend policy for the Company’s common and preferred stock and the Company’s ability to pay dividends at current levels, (xiii) the reduction in the Company’s income in the event of multiple lease terminations by tenants or a failure by multiple tenants to occupy their premises in a shopping center, (xiv) impairment charges, (xv) unanticipated changes in the Company’s intention or ability to prepay certain debt prior to maturity and/or hold certain securities until maturity and (xvi) the risks and uncertainties identified under Item 1A, “Risk Factors” and elsewhere in this Form 10-K and in the Company’s other filings with the Securities and Exchange Commission (“SEC”). Accordingly, there is no assurance that the Company’s expectations will be realized. The Company disclaims any intention or obligation to update the forward-looking statements, whether as a result of new information, future events or otherwise. You are advised to refer to any further disclosures the Company makes or related subjects in the Company’s quarterly reports on Form 10-Q and current reports on Form 8-K that the Company files with the SEC.",
        "after": "Results of Operations"
    },
    "640": {
        "CIK": "0000882508",
        "Company Name": "QUICKLOGIC Corp",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Granted",
        "match": "The forward-looking statements contained in this Annual Report involve a number of risks and uncertainties, many of which are outside of our control. Factors that could cause actual results to differ materially from projected results include, but are not limited to, risks associated with (i) the conversion of our design opportunities into revenue; (ii) the commercial and technical success of our new products and our successful introduction of products and solutions incorporating emerging technologies or standards; (iii) our dependence on our relationships with third parties to manufacture our products and solutions; (iv) our dependence upon single suppliers to fabricate and assemble our products; (v) the liquidity required to support our future operating and capital requirements; (vi) our ability to accurately estimate quarterly revenue; (vii) our expectations about market and product trends; (viii) our future plans for partnerships and collaborations; (ix) our dependence upon a few customers for a significant portion of our total revenue; (x) our ability to forecast demand for our products; (xi) our dependence on our international business operations; (xii) our ability to attract and retain key personnel; (xiii) our ability to remain competitive in our industry; (xiv) our ability to achieve the expected benefits from our acquisition of SensiML Corporation; (xv) our ability to protect our intellectual property rights; (xvi) our ability to prevent cyberattacks and protect our data; and (xvii) our ability to handle natural disasters and epidemics, such as the recent outbreak of the COVID-19 virus. Although we believe that the assumptions underlying the forward-looking statements contained in this Annual Report are reasonable, any of the assumptions could be inaccurate, and therefore there can be no assurance that such statements will be accurate. The risks, uncertainties and assumptions referred to above that could cause our results to differ materially from the results expressed or implied by such forward-looking statements include, but are not limited to, those discussed under the heading “Risk Factors” in Part I, Item 1A hereto and the risks, uncertainties and assumptions discussed from time to time in our other public filings and public announcements. All forward-looking statements included in this document are based on information available to us as of the date hereof. In light of the significant uncertainties inherent in the forward-looking statements included herein, the inclusion of such information should not be regarded as a representation by us or any other person that the results or conditions described in such statements or our objectives and plans will be achieved. Furthermore, past performance in operations and share price is not necessarily indicative of future performance. We disclaim any intention or obligation to update or revise any forward-looking statements, whether as a result of new information, future events or otherwise.",
        "after": "The 11% decrease in new product revenue in 2020 was primarily due to lower sales from Display Bridge Solution, eFPGA license and connectivity products, which was partially offset by an increase in AI SaaS revenue. In 2020, mature product revenue was 68% of total revenue compared to 70% in the prior year. Mature product revenue decreased by 19% compared to 2019. The decrease in mature product revenue was due primarily to decreases in most mature product categories, offset by QuickPCI product orders."
    },
    "642": {
        "CIK": "0000882796",
        "Company Name": "BIOCRYST PHARMACEUTICALS INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "The royalty financing obligation is eligible to be repaid based on royalties from net sales of ORLADEYO. Interest expense is accrued using the effective interest rate method over the estimated period the related liability will be paid. This requires the Company to estimate the total amount of future royalty payments to be generated from product sales over the life of the agreement. The Company imputes interest on the carrying value of the royalty financing obligation and records interest expense using an imputed effective interest rate. The Company will reassess the expected royalty payments each reporting period and account for any changes through an adjustment to the effective interest rate on a prospective basis. The assumptions used in determining the expected repayment term of the debt and amortization period of the issuance costs requires that the Company make estimates that could impact the carrying value of the liability, as well as the period over which associated issuance costs will be amortized. A significant increase or decrease in forecasted net sales could materially impact the liability balance, interest expense and the time period for repayment.",
        "match": "The ongoing novel coronavirus (“COVID-19”) pandemic could create challenges in all aspects of our business, including, without limitation, delays, stoppages, difficulties, and increased expenses with respect to our and our partners’ development, regulatory processes, and supply chains, negatively impact our ability to access the capital or credit markets to finance our operations, or have the effect of heightening many of the risks described below or in the “Risk Factors” section in Part I, Item 1A of this report.",
        "after": "Our or our partners’ activities related to approved products or, following their regulatory approval, any of our product candidates under development, such as BCX9930, BCX9250, and galidesivir, are subject to regulatory and law enforcement authorities in the United States (including the FDA, the Federal Trade Commission, the Department of Justice, and state and local governments) and their foreign equivalents (including the EMA, MHLW, MHRA, and others)."
    },
    "702": {
        "CIK": "0000895456",
        "Company Name": "ROCKY BRANDS, INC.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "When a customer has a right to a prompt payment discount, we estimate the likelihood that the customer will earn the discount using historical data and adjust our estimate when the estimate of the likelihood that a customer will earn the discount changes or the consideration becomes fixed, whichever occurs earlier. The estimated amount of variable consideration is recognized as a credit to trade receivables and a reduction in revenue until the uncertainty of the variable consideration is alleviated. Because most of our customers have payment terms less than six months there is not a significant financing component in our contracts with customers.",
        "match": "The COVID-19 outbreak has had, and may continue to have, an adverse impact on our business, financial condition and results of operations.",
        "after": "2020"
    },
    "706": {
        "CIK": "0000896264",
        "Company Name": "USANA HEALTH SCIENCES INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Contract Balances",
        "match": "Uncertainty related to the magnitude, scope and duration of the impact of the novel strain coronavirus COVID-19 pandemic (“COVID-19” or the “COVID-19 pandemic”) to our business, operations and financial results, including, for example, additional regulatory measures or voluntary actions that may be put in place to limit the spread of COVID-19 in the markets where we operate, such as restrictions on business operations, shelter at home, or social distancing requirements;",
        "after": "The COVID-19 pandemic has negatively impacted economies, businesses, sales practices, supply chains, and consumer behavior around the world.  While the overall impact of the pandemic on our business and results of operations was not material in fiscal 2020, the pandemic disrupted and negatively affected our business. Government-imposed restrictions, health and safety mandated best practices, and public hesitance regarding in-person gatherings have reduced our ability and the ability of our Associates to hold sales meetings, required our Associates to share and sell our products in a predominantly virtual environment, resulted in cancellations of key Company events and trips, required us to utilize a work-from-home strategy for all non-manufacturing and non-distribution employees, and required us to temporarily close our walk-in and fulfillment locations in some markets where we have such properties. The pandemic has also affected our ability to obtain some ingredients and packaging as well as ship products in some markets. While we have not experienced a meaningful supply chain interruption, our supply chain and logistics have incurred some disruption and we could experience more significant disruptions or closures in the future. These factors and others related to the COVID-19 pandemic will likely continue to negatively affect our business throughout 2021 in a number of ways, including those described below."
    },
    "714": {
        "CIK": "0000898437",
        "Company Name": "Anika Therapeutics, Inc.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "The reconciliation between the U.S. federal statutory rate and the Company’s effective rate is summarized as follows:",
        "match": "Our development focus for OA pain management will continue to be on bringing Cingal, our third-generation, single-injection viscosupplement product, to the U.S. market. While we have conducted previous clinical trials for Cingal, including a trial that supported CE Mark approval for Cingal, the FDA has indicated an additional Phase III trial is necessary to support U.S. approval. In 2020, we initiated a pilot study to confirm our trial design to increase our probability of success in a Phase III trial and generate data that ultimately will be needed to support FDA approval. Several trial sites were activated during 2020, and the first patient was enrolled in the pilot study in September 2020. However, as a result of the COVID-19 pandemic, we continue to face uncertainty related to the ultimate timing of this Cingal pilot study due to COVID-19-related enrollment challenges. Given the evolving environment, we will continue to update clinical trial timelines as we have more visibility with respect to the length and regional impacts of the COVID-19 pandemic. For additional information on the impact of the COVID-19 pandemic on our Cingal pilot study, please refer to the section captioned “Item 1A. Risk Factors. Risks related to the COVID-19 Pandemic. The COVID-19 pandemic could adversely impact our development activities, preclinical studies and clinical trials, which could significantly impair our long-term business plans and operating results.”",
        "after": "Pursuant to ASC 606, we recognize revenue when a customer obtains control of promised goods or services. The amount of revenue that is recorded reflects the consideration that we expect to receive in exchange for those goods or services. We apply the following five-step model in order to determine this amount: (i) identification of the promised goods or services in the contract; (ii) determination of whether the promised goods or services are performance obligations, including whether they are capable of being distinct or distinct in the context of the contract; (iii) measurement of the transaction price, including the constraint on variable consideration; (iv) allocation of the transaction price to the performance obligations; and (v) recognition of revenue when (or as) we satisfy each performance obligation."
    },
    "734": {
        "CIK": "0000906553",
        "Company Name": "BOYD GAMING CORP ",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "4.4",
        "match": "As a result of the COVID-19 global pandemic, all of our gaming facilities were closed in mid-March 2020 in compliance with orders issued by state officials as precautionary measures intended to slow the spread of the COVID-19 virus. As of February 22, 2021, 26 of our 28 gaming facilities are open and operating, subject to various health and safety measures, including occupancy limitations. Two of our properties in Las Vegas remain closed to the public due to the current levels of demand in the market and our cost containment efforts. Two of our properties in the Midwest & South segment that had re-opened in the summer were temporarily closed again by state officials, one in November and the second in December 2020. These properties subsequently re-opened in January 2021. We cannot predict whether we will be required to temporarily close some or all of our re-opened casinos in the future. Further, we cannot currently predict the ongoing impact of the pandemic on consumer demand and the negative effects on our workforce, suppliers, contractors and other partners. In responding to these circumstances, the safety and well-being of our team members and customers is our utmost priority. We have developed and implemented a broad range of safety protocols at our properties to ensure the health and safety of our team members and our customers.",
        "after": "Year Ended December 31,"
    },
    "742": {
        "CIK": "0000909494",
        "Company Name": "TUCOWS INC /PA/",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Amount reclassified from AOCI",
        "match": "This Annual Report on Form 10-K contains, in addition to historical information, forward-looking statements by Tucows Inc. (the “Company”, “we”, “us” “Tucows” or “our”) with regard to our expectations as to financial results and other aspects of our business that involve risks and uncertainties and may constitute forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995. Words such as “may,” “should,” “anticipate,” “believe,” “plan,” “estimate,” “expect,” and “intend,” and other similar expressions are intended to identify forward-looking statements. The forward-looking statements contained in this report include statements regarding, among other things, the competition we expect to encounter as our business develops and competes in a broader range of Internet services, the Company's foreign currency requirements, specifically for the Canadian dollar and Euro; Mobile Services Platform and fixed Internet access subscriber growth and retention rates, the number of new, renewed and transferred-in domain names we register as our business develops and competes; the effect of a potential generic top level domain (“gTLD”) expansion by the Internet Corporation for Assigned Names and Numbers (“ICANN”) on the number of domains we register and the impact it may have on related revenues; our belief regarding the underlying platform for our domain services, our expectation regarding the trend of sales of domain names and advertising; our belief that, by increasing the number of services we offer, we will be able to generate higher revenues; our expectation regarding litigation; the potential impact of current and pending claims on our business; our valuations of certain deferred tax assets; our expectation to collect our outstanding receivables, net of our allowance for doubtful accounts; our expectation regarding fluctuations in certain expense and cost categories; our expectations regarding our unrecognized tax; our expectations regarding cash from operations to fund our business; the impact of cancellations of or amendments to market development fund programs under which we receive funds, our expectation regarding our ability to manage realized gains/losses from foreign currency contracts; the impact of the novel strain coronavirus (\"COVID-19\") pandemic on our business, operations and financial performance; and general business conditions and economic uncertainty. These statements are based on management’s current expectations and are subject to a number of uncertainties and risks that could cause actual results to differ materially from those described in the forward-looking statements. Many factors affect our ability to achieve our objectives and to successfully develop and commercialize our services including:",
        "after": "Although we believe we have adequately reserved for our uncertain tax positions, no assurance can be given that the final tax outcome of these matters will not be different. We adjust these reserves in light of changing facts and circumstances, such as the closing of a tax audit or the refinement of an estimate based on new information that may become available. To the extent that the final tax outcome of these matters is different than the amounts recorded, such differences will impact the provision for income taxes in the period in which such determination is made."
    },
    "756": {
        "CIK": "0000912061",
        "Company Name": "Natural Health Trends Corp.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Disaggregation of Revenue",
        "match": "Our normal business operations have recently been disrupted by a series of events, including the Chinese government’s 100-day campaign focused on companies involved in the sale of health products in China, recent political and social developments in Hong Kong, and the COVID-19 pandemic and related measures to control it. See “Item 1A. Risk Factors - Our business in China is subject to compliance with a myriad of applicable laws and regulations...”, “Risk Factors - Our Hong Kong operations are being adversely affected by recent political and social developments in Hong Kong….”, “Risk Factors - Epidemics, such as the COVID-19 pandemic, or natural disasters, terrorists attacks or acts of war…”, and “Item 7. Management’s Discussion and Analysis of Financial Condition and Results of Operations - Business Overview.”",
        "after": "Recent Accounting Pronouncements"
    },
    "772": {
        "CIK": "0000914156",
        "Company Name": "UFP TECHNOLOGIES INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "These financial statements are the responsibility of the Company’s management. Our responsibility is to express an opinion on the Company’s financial statements based on our audits. We are a public accounting firm registered with the PCAOB and are required to be independent with respect to the Company in accordance with the U.S. federal securities laws and the applicable rules and regulations of the Securities and Exchange Commission and the PCAOB.",
        "match": "Some of the statements contained in this Report are forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended (“Exchange Act”). Management and representatives of UFP Technologies, Inc. (the “Company”) also may from time to time make forward-looking statements. These statements are subject to known and unknown risks, uncertainties, and other factors, which may cause our or our industry’s actual results, performance, or achievements to be materially different from any future results, performance or achievements expressed or implied by the forward-looking statements. Forward-looking statements include, but are not limited to, statements about the Company’s prospects; statements about the potential further impact the novel coronavirus (\"COVID-19\") pandemic may have on the Company’s business, financial condition and results of operations, including with respect to the different markets in which the Company participates, the demand for its products, the well-being and availability of the Company’s employees, the continuing operation of the Company’s locations, delayed payments by the Company’s customers and the potential for reduced or canceled orders, the Company’s efforts to address the pandemic, including regarding the safety of its employees, the maintenance of its facilities and the sufficiency of the Company’s supply chain, inventory, liquidity and capital resources, including increased costs in connection with such efforts, the impact of the pandemic on the businesses of the Company’s suppliers and customers, and the overall impact the pandemic may have on the Company’s financial results in 2021; statements about the Company’s acquisition strategies and opportunities and the Company’s growth potential and strategies for growth; expectations regarding customer demand; expectations regarding the Company’s liquidity and capital resources, including the sufficiency of its cash reserves and the availability of borrowing capacity to fund operations and/or potential future acquisitions; anticipated revenues and the timing of such revenues; expectations regarding the potential impact of the proposed phase out of LIBOR by the end of 2021; expectations about shifting the Company’s book of business to higher-margin, longer-run opportunities; anticipated trends and potential advantages in the different markets in which the Company competes, including the medical, aerospace and defense, automotive, consumer, electronics, and industrial markets, and the Company’s plans to expand in certain of its markets; statements regarding anticipated advantages the Company expects to realize from its investments and capital expenditures; statements regarding anticipated advantages to improvements and alterations at the Company’s existing plants; expectations regarding the Company’s manufacturing capacity, operating efficiencies, and new production equipment; statements about new product offerings and program launches; statements about the Company’s participation and growth in multiple markets; statements about the Company’s business opportunities; and any indication that the Company may be able to sustain or increase its sales, earnings or earnings per share, or its sales, earnings or earnings per share growth rates.",
        "after": "Interest expense"
    },
    "774": {
        "CIK": "0000915778",
        "Company Name": "DSP GROUP INC /DE/",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "2022",
        "match": "The COVID-19 outbreak we faced in 2020 presented an unprecedented global challenge affecting every aspect of our lives, including, of course, the semiconductor industry. Our technical solutions are playing a significant role in enabling the technological trends that were accelerated as a result of the pandemic. For instance, with more employees working remotely, and offices reconfiguring workspaces to cater to social distancing requirements, high-quality communication and remote collaboration tools have become essential. Moreover, individuals worldwide became very aware of and sensitive to the health risks of touching commonly used surfaces. This awareness has accelerated the adoption of voice user interfaces (VUIs) for a broad array of products, beyond the original value propositions of convenience and functionality. We believe DSP Group is well positioned to leverage its leadership in Unified Communications, SmartVoice and SmartHome technologies with world-class technologies and innovative solutions that address the increasing demands of these markets.",
        "after": "Item 8.         FINANCIAL STATEMENTS AND SUPPLEMENTARY DATA"
    },
    "780": {
        "CIK": "0000917470",
        "Company Name": "OLYMPIC STEEL INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "(in thousands)",
        "match": "risks associated with the novel corona virus, or COVID-19, pandemic, including, but not limited to supply chain disruptions and customer closures, reduced sales and profit levels, slower payment of accounts receivable and potential increases in uncollectible accounts receivable, falling metals prices that could lead to lower of cost or net realizable value inventory adjustments and the impairment of intangible and long-lived assets, reduced availability and productivity of our employees, increased operational risks as a result of remote work arrangements, including the potential effects on internal controls, as well as cybersecurity risks and increased vulnerability to security breaches, information technology disruptions and other similar events, negative impacts on our liquidity position, inability to access our traditional financing sources on the same or reasonably similar terms as were available before the COVID-19 pandemic and increased costs associated with and less ability to access funds under our asset-based credit facility, or ABL Credit Facility, and the capital markets;",
        "after": "Income Taxes"
    },
    "822": {
        "CIK": "0000928658",
        "Company Name": "COVENANT LOGISTICS GROUP, INC.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Net cash flows (used in) provided by financing activities",
        "match": "This Annual Report on Form 10-K contains certain statements that may be considered forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended and Section 21E of the Securities Exchange Act of 1934, as amended and such statements are subject to the safe harbor created by those sections and the Private Securities Litigation Reform Act of 1995, as amended. All statements, other than statements of historical or current fact, are statements that could be deemed forward-looking statements, including without limitation: any projections of earnings, revenues, or other financial items; any statement of plans, strategies, and objectives of management for future operations; any statements concerning proposed new services or developments; any statements regarding future economic conditions or performance; and any statements of belief and any statements of assumptions underlying any of the foregoing. In this Annual Report, statements relating to our ability to achieve our strategic plan and the anticipated impact of our strategic initiatives, our ability to recruit and retain qualified independent contractors and qualified driver and non-driver employees, our ability to react to market conditions and gain market share, future demand for and supply of new and used tractors and trailers (including expected prices of such equipment), expected functioning and effectiveness of our information systems and other technology we implement, our ability to leverage technology to gain efficiencies, expected sources and adequacy of working capital and liquidity, future relationships, use, classification, compensation, and availability with respect to third-party service providers, future driver market conditions, including future driver pay, expected improvements to financial and operational measures, future allocation of capital, including equipment purchases and upgrades and the allocation of capital among our segments, future insurance and claims levels and expenses, future impact of pending litigation, future tax rates, expense, and deductions, future fuel management, expense, and the future effectiveness of fuel surcharge programs, future interest rates and effectiveness of interest rate swaps, future investments in and the growth of individual segments and services, expected capital expenditures (including the future mix of lease and purchase obligations), future asset dispositions, future asset utilization and efficiency, future trucking capacity, expected freight demand and volumes, future rates, future depreciation and amortization, future compliance with and impact of existing and proposed federal and state laws and regulations, future salaries, wages, and related expenses, future earnings from and value of our investments, including our equity investment in TEL, future customer relationships, future defaults under debt agreements, future payment of financing and operating lease liabilities, future unforeseen events such as strikes, work stoppages, and weather catastrophes, future acquisitions, future credit availability, future repurchases, if any, future stock prices, future goodwill impairment, future indebtedness, expected transition to and effect of new accounting standards, expected effect of deferred tax assets, our mix of single and team operations, the effect of safety ratings and hours-of-service expectations, future operating and maintenance expenses, and the future impact of COVID-19 on our business and results of operations, among others, are forward-looking statements. Such statements may be identified by their use of terms or phrases such as \"believe,\" \"may,\" \"could,\" \"expects,\" \"estimates,\" \"projects,\" \"mission,\" \"anticipates,\" \"plans,\" \"intends,\" and similar terms and phrases. Forward-looking statements are based on currently available operating, financial, and competitive information. Forward-looking statements are inherently subject to risks and uncertainties, some of which cannot be predicted or quantified, which could cause future events and actual results to differ materially from those set forth in, contemplated by, or underlying the forward-looking statements. Factors that could cause or contribute to such differences include, but are not limited to, those discussed in the section entitled \"Item 1A. Risk Factors,\" set forth below. Readers should review and consider the factors discussed in \"Item 1A. Risk Factors,\" along with various disclosures in our press releases, stockholder reports, and other filings with the Securities and Exchange Commission (“SEC”).",
        "after": "ITEM 7A. "
    },
    "836": {
        "CIK": "0000943034",
        "Company Name": "IMAGE SENSING SYSTEMS INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "We believe that several trends are driving the growth in ITS and adjacent market segments:",
        "match": "Proliferation of Traffic. In many countries, there has been a surge in the number of vehicles on roadways. Due to the growth of emerging economies and elevated standards of living, more people desire and are able to afford automobiles. The number of vehicles utilizing the world’s roadway infrastructure is growing at a quicker pace than new roads, bridges and highways are being constructed.  According to the Federal Highway Administration, American drivers put a record 3.28 trillion miles on public roads and highways in 2019, an increase of 0.6% from 3.26 trillion miles in 2018. However, we believe the effects of the COVID-19 pandemic have caused traffic congestion in the U.S. to decrease somewhat in 2020 and 2021, although we expect it to increase as the pandemic subsides due to increased vaccination rates and the removal of stay-at-home and other restrictive mandates. Overall, the growth in roadway infrastructure is failing to match the surge in the number of vehicles using it. Above-ground detection-based traffic management and control systems address the problem by monitoring high traffic areas and analyzing data that can be used to mitigate traffic problems.",
        "after": "The Demographics of Urbanization. Accelerated worldwide urbanization drives the creation and expansion of middle classes and produces heightened demand for automobiles. Because automobiles can be introduced to a metropolitan area faster than roadway infrastructure can be constructed, the result is continuously worsening traffic. Expanding the roadway infrastructure is slow and costly to implement, and often environmentally undesirable, so government agencies are increasingly turning to technology‑based congestion solutions that optimize performance and throughput of existing and new roadway infrastructure. Detection is the requisite common denominator for any technology‑based solution."
    },
    "880": {
        "CIK": "0001001385",
        "Company Name": "Northwest Pipe Co.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "The Company assesses impairment of property and equipment whenever changes in circumstances indicate that the carrying values of the asset or asset group(s)  may not be recoverable. The asset group is the lowest level at which identifiable cash flows are largely independent of the cash flows of other groups of assets or liabilities. The recoverable value of a long-lived asset group is determined by estimating future undiscounted cash flows using assumptions about the expected future operating performance of the Company.",
        "match": "impacts of pandemics, epidemics, or other public health emergencies, such as coronavirus disease 2019 (“COVID-19”); and",
        "after": "Inquired with management to understand the status of the contract, changes from prior years, and key assumptions in the development of the estimated costs to complete on the contracts."
    },
    "904": {
        "CIK": "0001009829",
        "Company Name": "JAKKS PACIFIC, INC.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Evaluation of Disclosure Controls and Procedures.",
        "match": "As of the date of filing of this Annual Report on Form 10-K (this “Report”), there are many uncertainties regarding the current Novel Coronavirus (“COVID-19”) pandemic, including the scope of scientific and health issues, the anticipated duration of the pandemic, and the extent of local and worldwide social, political, and economic disruption it may cause. To date, the COVID-19 pandemic has had far-reaching impacts on many aspects of the operations of JAKKS Pacific, Inc. (the “Company”, “we,” “our” or “us”), directly and indirectly, including on consumer behavior, customer store traffic, production capabilities, timing of product availability, our people, and the market generally. The scope and nature of these impacts continue to evolve each day. The COVID-19 pandemic has resulted in, and may continue to result in, regional quarantines, labor stoppages and shortages, changes in consumer purchasing patterns, mandatory or elective shut-downs of retail locations, disruptions to supply chains, including the inability of our suppliers and service providers to deliver materials and services on a timely basis, or at all, severe market volatility, liquidity disruptions, and overall economic instability, which, in many cases, have had, and we expect will continue to have, adverse impacts on our business, financial condition and results of operations. This situation is changing rapidly, and additional impacts may arise that we are not aware of currently.",
        "after": "On October 16, 2020, we reached an agreement (the “Amendment”) with holders of our New Term Loan and Wells Fargo, holder of our revolving credit facility, to amend our New Term Loan Agreement and defer our EBITDA covenant calculation until March 31, 2022. Under the Amendment, the trailing 12-month EBITDA requirement was reduced to $25.0 million, which will not be calculated earlier than March 31, 2022. The Amendment also required us to pre-pay $15.0 million of the New Term Loan immediately and, under certain conditions, pre-pay up to an additional $5.0 million no later than the third quarter of fiscal year 2021. As a result, we reclassified $20.0 million from long term debt to short term debt as of September 30, 2020. In connection with the amendment on October 20, 2020, we paid $15.0 million of our outstanding principal amount and $0.3 million in related interest and PIK interest. As of December 31, 2020, we had $124.5 million (including $4.7 million in payment-in-kind interest) outstanding under the New Term Loan Agreement, $5.0 million of which is recorded as short term debt, and $114.8 million is recorded as long term debt in the consolidated balance sheet."
    },
    "906": {
        "CIK": "0001010086",
        "Company Name": "Siga Technologies INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Item 8. Financial Statements and Supplementary Data",
        "match": "Certain statements in this Annual Report on Form 10-K, including certain statements contained in “Business” and “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” constitute “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended, including statements relating to the progress of SIGA’s development programs and timelines for bringing products to market, delivering products to the U.S Strategic National Stockpile (\"Strategic Stockpile\") and the enforceability of the 2011 BARDA Contract and the 19C BARDA Contract (each as defined below, and collectively, the \"BARDA Contracts\") with the U.S. Biomedical Advanced Research and Development Authority (\"BARDA\"). The words or phrases “can be,” “expects,” “may affect,” “may depend,” “believes,” “estimate,” “project” and similar words and phrases are intended to identify such forward-looking statements. Such forward-looking statements are subject to various known and unknown risks and uncertainties and SIGA cautions you that any forward-looking information provided by or on behalf of SIGA is not a guarantee of future performance. SIGA’s actual results could differ materially from those anticipated by such forward-looking statements due to a number of factors, some of which are beyond SIGA’s control, including, but not limited to, (i) the risk that BARDA elects, in its sole discretion as permitted under the BARDA Contracts, not to exercise all, or any, of the remaining unexercised options under those contracts, (ii) the risk that SIGA may not complete performance under the BARDA Contracts on schedule or in accordance with contractual terms, (iii) the risk that the BARDA Contracts are modified or canceled at the request or requirement of the U.S. Government, (iv) the risk that the nascent international biodefense market does not develop to a degree that allows SIGA to successfully market TPOXX® internationally, (v) the risk that potential products, including potential alternative uses or formulations of TPOXX® that appear promising to SIGA or its collaborators, cannot be shown to be efficacious or safe in subsequent pre-clinical or clinical trials, (vi) the risk that SIGA or its collaborators will not obtain appropriate or necessary governmental approvals to market these or other potential products or uses, (vii) the risk that SIGA may not be able to secure or enforce sufficient legal rights in its products, including intellectual property protection, (viii) the risk that any challenge to SIGA’s patent and other property rights, if adversely determined, could affect SIGA’s business and, even if determined favorably, could be costly, (ix) the risk that regulatory requirements applicable to SIGA’s products may result in the need for further or additional testing or documentation that will delay or prevent seeking or obtaining needed approvals to market these products, (x) the risk that the volatile and competitive nature of the biotechnology industry may hamper SIGA’s efforts to develop or market its products, (xi) the risk that changes in domestic or foreign economic and market conditions may affect SIGA’s ability to advance its research or may affect its products adversely, (xii) the effect of federal, state, and foreign regulation, including drug regulation and international trade regulation, on SIGA’s businesses and (xiii) the risk that the U.S. Government’s responses (including inaction) to the national or global economic situation or infectious disease such as COVID-19 may affect SIGA’s business adversely, as well as the risks and uncertainties included in Item 1A “Risk Factors” of this Form 10-K. All such forward-looking statements are current only as of the date on which such statements were made. SIGA does not undertake any obligation to update publicly any forward-looking statement to reflect events or circumstances after the date on which any such statement is made or to reflect the occurrence of unanticipated events.",
        "after": "The contract with BARDA (as amended, modified, or supplemented from time to time the \"2011 BARDA Contract”) includes a base contract, as modified, (“2011 Base Contract”) as well as options. The 2011 Base Contract specifies approximately $508.4 million of payments (including exercised options), of which, as of December 31, 2020, $459.8 million has been received by the Company for the manufacture and delivery of 1.7 million courses of oral TPOXX® and $45.6 million has been received for certain reimbursements in connection with development and supportive activities. Approximately $3.0 million remains eligible to be received in the future for reimbursements of development and supportive activities."
    },
    "914": {
        "CIK": "0001012019",
        "Company Name": "RUSH ENTERPRISES INC \\TX\\",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Definition and Limitations of Internal Control over Financial Reporting",
        "match": "Management continually monitors employee turnover data, which is supplemented with additional data from exit surveys to assist in determining the reasons for voluntary employee terminations. In 2020, our overall turnover rate was 42.62%, which is significantly higher than normal because of involuntary reductions in our workforce that were made at the onset of the COVID-19 pandemic. The turnover rate of our service and body shop technicians is also monitored closely by management, as the retention of skilled service and body shop technicians is critical to the success of the Company. Demand for service and body shop technicians across the country is very high, and turnover in this role is also traditionally high for commercial vehicle dealers. In 2020, our turnover rate for service and body shop technicians was 39.24%.",
        "after": "Selling, General and Administrative Expenses"
    },
    "952": {
        "CIK": "0001023994",
        "Company Name": "SG BLOCKS, INC.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "·    Our residential construction business is difficult to evaluate because we are currently focused on a new business model and have very limited operating history and limited information.",
        "match": "·    The impact of the COVID-19 coronavirus outbreak, or similar global health concerns, could negatively impact our ability to source certain products, impact product pricing, impact our customers’ ability or that of our licensee to obtain financing or have a negative impact on our business.",
        "after": "·    We may be unable to successfully integrate the Echo business with its current management and structure and the acquisition of Echo DCL, LLC may not result in the benefits anticipated."
    },
    "960": {
        "CIK": "0001029199",
        "Company Name": "EURONET WORLDWIDE, INC.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "   ",
        "match": "The primary sources of revenues generated by our ATM network are recurring monthly management fees, transaction-based fees, surcharges and margins earned on DCC transactions. We receive fixed monthly fees under many of our outsourced management contracts. The EFT Processing Segment also generates revenues from POS operations and merchant management, card network management for credit, debit, prepaid and loyalty cards, prepaid mobile airtime recharge and other electronic content on ATMs and ATM advertising. We primarily service financial institutions across Europe, the Middle East, Asia Pacific, and the United States. As of December 31, 2020, we operated 37,729 ATMs compared to 46,070 at December 31, 2019. The decrease was largely due to temporary closures of ATMs in response to the COVID-19 pandemic. ",
        "after": "We monitor the number of transactions made by cardholders on our network. These include cash withdrawals, balance inquiries, deposits, prepaid mobile airtime recharge purchases, DCC transactions and certain denied (unauthorized) transactions. We do not bill certain transactions on our network to financial institutions, and we have excluded these transactions for reporting purposes. The number of transactions processed over our networks has increased over the last five years at a compound annual growth rate (\"CAGR\") of approximately 11.7% as indicated in the following table:"
    },
    "964": {
        "CIK": "0001031029",
        "Company Name": "StarTek, Inc.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "All Other ",
        "match": "Our financial condition and results of operations for 2021 could get adversely affected by health pandemics such as the recent Coronavirus or COVID-19 outbreak.",
        "after": "2020"
    },
    "982": {
        "CIK": "0001035976",
        "Company Name": "FNCB BANCORP, INC.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Note 8. BORROWED FUNDS",
        "match": "FNCB generally offers commercial loans to sole proprietors and businesses located in its primary market area. The commercial loan portfolio includes, but is not limited to, lines of credit, dealer floor plan lines, equipment loans, vehicle loans and term loans. These loans are primarily secured by vehicles, machinery and equipment, inventory, accounts receivable, marketable securities and deposit accounts. At December 31, 2020, FNCB’s commercial and industrial loans totaled $238.4 million, or 26.4%, of the total loan portfolio. Also included in commercial and industrial loans are loans originated during 2020 under various programs that were part of the governmental response to the COVID-19 pandemic. FNCB participated in the Paycheck Protection Program (\"PPP\") promulgated under the Coronavirus Aid, Relief and Economic Security Act (\"CARES Act\"). PPP loans outstanding included in commercial and industrial loans were $78.6 million at December 31, 2020. FNCB also participated in the Federal Reserve System's Main Street Lending Program under which the Federal Reserve purchased 95.0% of the originated principal balance. The remaining 5.0% principal of loans originated under the Main Street Lending Program outstanding and included in commercial and industrial loans at December 31, 2020 was $4.3 million.",
        "after": "Other non-performing assets at December 31, 2020 and 2019 was comprised solely of a classified account receivable secured by an evergreen letter of credit in the amount of $1.9 million, received in 2011 as part of a settlement agreement for a large construction, land acquisition and development loan for a residential development project in the Pocono region of Monroe County. The agreement provides for payment to FNCB as real estate building lots are sold. The project was stalled due to a decline in real estate values in this area following the financial crisis of 2008. In 2019, economic development in this market area started to improve and management had confirmed that the developer for this project had resumed construction activity, including the completion of substantial infrastructure, and had increased marketing and sales initiatives related to the project. As of December 31, 2020, no single-unit lots have been sold, however, the construction of a seven-unit building that houses timeshare units has been completed and owners began occupying the units in the fourth quarter of 2020. Management continues to monitor this project closely and is currently in negotiations with with the developer to establish a repayment plan beginning in 2021. However, uncertainty and economic volatility associated with the COVID-19 pandemic are unknown and could negatively impact the timing of sales and payments."
    },
    "988": {
        "CIK": "0001036188",
        "Company Name": "QAD INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Judgment is required to determine the SSP for each distinct performance obligation. In instances where SSP is not directly observable because the Company does not sell the license, product or service separately, the Company determines the SSP using information that  may include market conditions and other observable inputs. In making these judgments, the Company analyzes various factors, including its pricing methodology and consistency, size of the arrangement, length of term, customer demographics and overall market and economic conditions. Based on these results, the estimated SSP is set for each distinct product or service delivered to customers. The Company rarely sells licenses on a stand-alone basis, as the majority of its license sales to customers include first year maintenance with the license purchase. The Company frequently sells subscription, maintenance and services on a stand-alone basis. ",
        "match": "QAD believes there are substantial growth opportunities in our cloud business. Global manufacturers are facing unprecedented levels of disruption and turbulence. COVID-19, as an example, has accelerated digital transformation. Responding to these changes requires a level of agility that legacy ERP solutions fail to deliver. QAD's Adaptive ERP offers greater fit out of the box, rapid deployment and the ability to easily adapt and extend systems to meet the challenge of accelerating change.",
        "after": "Identification of the contract, or contracts, with a customer;"
    },
    "1000": {
        "CIK": "0001040130",
        "Company Name": "PETMED EXPRESS INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "PetMed Express was incorporated in the state of Florida in January 1996. The Company’s common stock is traded on the NASDAQ Global Select Market under the symbol “PETS.” The Company began selling pet medications and other pet health products in September 1996. In March 2010, the Company started offering for sale additional pet supplies on its website, and these items are drop shipped to customers by third party vendors. Presently, the Company’s product line includes approximately 3,000 of the most popular pet medications, health products, and supplies for dogs, cats, and horses.",
        "match": "We currently have 219 full time employees, including: 123 in customer care and marketing; 29 in fulfillment and purchasing; 55 in our pharmacy; 5 in information technology; 3 in administrative positions; and 4 in management. None of our employees are represented by a labor union, or governed by any collective bargaining agreements. We consider relations with our employees to be good. The majority of our employees work at our headquarters and distribution center located in Delray Beach, Florida. As a result of the COVID-19 pandemic many of our personnel are currently working remotely, and in the long term, we expect some personnel to transition to working remotely on a regular basis.",
        "after": "32.1"
    },
    "1026": {
        "CIK": "0001046102",
        "Company Name": "Guaranty Federal Bancshares Inc",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Commercial",
        "match": "The Bank's primary market areas are Greene, Christian, Jasper, and Newton Counties, which are in the southwestern corner of Missouri and include the cities of Springfield, Nixa, Ozark, Joplin, Carthage and Neosho, Missouri (our “Market Area”). The major components of the Market Area’s economy are service industries, education, retail, light manufacturing, hospitality and health care. There is a significant regional health care presence with three large regional hospitals. There also are four accredited colleges and two major universities. Part of the area’s growth can be attributed to its proximity to Branson, Missouri, which has developed a strong tourism industry related to country music, entertainment and outdoor recreation. Branson is located 30 miles south of Springfield and normally attracts between six and seven million tourists each year, many of whom pass through Springfield. However, Branson’s tourism industry was negatively impacted in 2020 and continues to be negatively impacted by the effects of the coronavirus or COVID-19 pandemic (“COVID-19”) which is discussed in more detail below. The Bank also has one Loan Production Office in Webster County, Missouri.",
        "after": "Land & Land Development"
    },
    "1034": {
        "CIK": "0001047127",
        "Company Name": "NATIONAL HEALTHCARE CORP",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Income (loss) before income taxes",
        "match": "Statements in this annual filing that are not historical facts are forward-looking statements.  NHC cautions investors that any forward-looking statements made involve risks and uncertainties and are not guarantees of future performance.  The risks and uncertainties include, among others, the following:  liabilities and other claims asserted against us and patient care liabilities, as well as the resolution of current litigation; availability of insurance and assets for indemnification; national and local economic conditions, including their effect on the availability and cost of labor, utilities and materials; the effect of government regulations and changes in regulations governing the healthcare industry, including our compliance with such regulations; changes in Medicare and Medicaid payment levels and methodologies and the application of such methodologies by the government and its fiscal intermediaries; the uncertainty of the extent, duration and effects of the novel coronavirus (“COVID-19”) pandemic and the response of governments, and other factors referenced in this annual filing.",
        "after": "NHC HomeCare of Panama City"
    },
    "1110": {
        "CIK": "0001070235",
        "Company Name": "FIRST CAPITAL INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Investment",
        "match": "Forward-looking statements are not guarantees of future performance. Management’s ability to predict results or the effect of future plans or strategies is inherently uncertain. Numerous risks and uncertainties could cause or contribute to the Company’s actual results, performance and achievements being materially different from those expressed or implied by the forward-looking statements. Factors that may cause or contribute to these differences include, without limitation, the severity, magnitude and duration of the COVID-19 pandemic, including impacts of the pandemic and of businesses’ and governments’ responses to the pandemic on our operations and personnel, and on commercial activity and demand across our and our customers’ businesses, market, economic, operational, liquidity, credit and interest rate risks associated with the Company’s business (including developments and volatility arising from the COVID-19 pandemic),general economic conditions, including changes in market interest rates and changes in monetary and fiscal policies of the federal government; the ability of First Capital, Inc. to execute its business plan; First Capital, Inc.’s ability to control costs and expenses; competitive products and pricing; deposit flows; loan delinquency rates; changes in federal and state legislation and regulation; and other factors disclosed periodically in First Capital, Inc.’s filings with the SEC. Additional factors that may affect our results are discussed in Item 1A to this Annual Report on Form 10-K titled “Risk Factors” below.  These factors should be considered in evaluating the forward-looking statements and undue reliance should not be placed on such statements, whether included in this report or made elsewhere from time to time by First Capital, Inc. or on its behalf. Any forward-looking statements made by or on behalf of First Capital, Inc. speak only as of the date they are made, and except to the extent required by applicable law First Capital, Inc. does not undertake to update forward-looking statements to reflect the impact of circumstances or events that arise after the date the forward-looking statements were made. The reader should, however, consult any further disclosures of a forward-looking nature First Capital, Inc. may make in any subsequent Annual Reports on Form 10-K, Quarterly Reports on Form 10-Q, or Current Reports on Form 8-K.",
        "after": "(200)bp"
    },
    "1124": {
        "CIK": "0001077428",
        "Company Name": "HOOKER FURNITURE CORPORATION",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "The critical audit matters communicated below are matters arising from the current period audit of the consolidated financial statements that were communicated or required to be communicated to the audit committee and that: (1) relate to accounts or disclosures that are material to the consolidated financial statements and (2) involved our especially challenging, subjective, or complex judgments. The communication of critical audit matters does not alter in any way our opinion on the consolidated financial statements, taken as a whole, and we are not, by communicating the critical audit matters below, providing separate opinions on the critical audit matters or on the accounts or disclosures to which they relate.",
        "match": "The effect and consequences of the coronavirus (COVID-19) pandemic or future pandemics on a wide range of matters including but not limited to U.S. and local economies; our business operations and continuity; the health and productivity of our employees; and the impact on our global supply chain, the retail environment and our customer base;",
        "after": "    Income tax accrual (See note 16)"
    },
    "1146": {
        "CIK": "0001089063",
        "Company Name": "ALASKA COMMUNICATIONS SYSTEMS GROUP INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "•   TekMate, LLC",
        "match": "disruptions or failures in the physical infrastructure or operating systems that support our businesses and customers, or cyber-attacks or security breaches of the physical infrastructure, operating systems or devices that our customers use to access our products and services; due to the COVID-19 pandemic, many of our employees are temporarily working remotely, which may pose additional data security risks",
        "after": "Basis for Opinion"
    },
    "1150": {
        "CIK": "0001089872",
        "Company Name": "Southern First Bancshares, Inc.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "2,239,430 ",
        "match": "The impact of the outbreak of the novel coronavirus, or COVID-19, on our business, including the impact of the actions taken by governmental authorities to try and contain the virus or address the impact of the virus on the United States economy (including, without limitation, the Coronavirus Aid, Relief and Economic Security Act, or the CARES Act), and the resulting effect of these items on our operations, liquidity and capital position, and on the financial condition of our borrowers and other customers;   ",
        "after": "Basic "
    },
    "1188": {
        "CIK": "0001107421",
        "Company Name": "QUALYS, INC.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "In  June 2016, the FASB issued ASU No. 2016-13, Financial Instruments-Credit Losses (Topic 326) as modified by subsequently issued ASU No. 2018-19, 2019-04, 2019-05 and 2019-11, which introduces a new accounting model, Current Expected Credit Losses (\"CECL\"). CECL requires earlier recognition of credit losses, while also providing additional transparency about credit risk. CECL utilizes a lifetime expected credit loss measurement objective for the recognition of credit losses at the time the financial asset is originated or acquired. The expected credit losses are adjusted each period for changes in expected lifetime credit losses. The Company adopted this ASU on  January 1, 2020, using a modified retrospective transition method, which requires a cumulative-effect adjustment, if any, to the opening balance of retained earnings to be recognized on the date of adoption with prior periods not restated. The adoption did not have a material impact on the Company's consolidated financial statements.",
        "match": "The continued spread of COVID-19, or any similar widespread infectious disease outbreak, could harm our business, financial condition and results of operations.",
        "after": "Our quarterly operating results may vary from period to period, which could result in our failure to meet expectations with respect to operating results and cause the trading price of our stock to decline."
    },
    "1206": {
        "CIK": "0001113232",
        "Company Name": "BUILD-A-BEAR WORKSHOP INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "PROPERTIES ",
        "match": "COVID-19 Pandemic",
        "after": "Second Amended and Restated Build-A-Bear Workshop, Inc. 2004 Stock Incentive Plan (incorporated by reference from Exhibit 99.1 on our Registration Statement on Form S-8, filed on May 18, 2009)"
    },
    "1218": {
        "CIK": "0001120370",
        "Company Name": "PDF SOLUTIONS INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "The following discusses our exposure to market risk related to changes in interest rates and foreign currency exchange rates. We do not currently own any equity investments, nor do we expect to own any in the foreseeable future. This discussion contains forward-looking statements that are subject to risks and uncertainties. Actual results could vary materially as a result of a number of factors.",
        "match": "This Annual Report on Form 10-K, particularly in Item 1 “Business” and Item 7 “Management’s Discussion and Analysis of Financial Condition and Results of Operations,” includes forward-looking statements within the meaning of Section 27A of the Securities Act of 1933, as amended (the “Securities Act”) and Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”). These statements include, but are not limited to, statements concerning: expectations about the effectiveness of our business and technology strategies; expectations regarding global economic trends; expectations regarding recent and future acquisitions; current semiconductor industry trends; expectations of the success and market acceptance of our intellectual property and our solutions; the impact of the coronavirus (COVID-19) on the semiconductor industry and our business and our ability to obtain additional financing if needed. Our actual results could differ materially from those projected in the forward-looking statements as a result of a number of factors, risks and uncertainties discussed in this Form 10-K, especially those contained in Item 1A of this Form 10-K. The words “may,” “anticipate,” “plan,” “continue,” “could,” “projected,” “expect,” “believe,” “intend,” and “assume,” the negative of these terms and similar expressions are used to identify forward-looking statements. All forward-looking statements and information included herein is given as of the filing date of this Form 10-K with the Securities and Exchange Commission (“SEC”) and based on information available to us at the time of this report and future events or circumstances could differ significantly from these forward-looking statements. Unless required by law, we undertake no obligation to update publicly any such forward-looking statements.",
        "after": "On  May 6, 2020, the Company initiated an arbitration proceeding with the Hong Kong International Arbitration Center against SMIC New Technology Research & Development (Shanghai) Corporation (“SMIC”) due to SMIC’s failure to pay fees due to PDF under a series of contracts. The Company seeks to recover the unpaid fees, a declaration requiring SMIC to pay fees under the contracts in the future, and costs associated with bringing the arbitration proceeding. The arbitration is on-going.  "
    },
    "1226": {
        "CIK": "0001123360",
        "Company Name": "HARVARD BIOSCIENCE INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "(o)",
        "match": "COVID-19",
        "after": "The measurement date is  December 31 for these plans. The funded status of the Company’s defined benefit pension plans and the amount recognized in the consolidated balance sheets at  December 31, 2020 and 2019 is as follows:\n\n\n    \n"
    },
    "1248": {
        "CIK": "0001132105",
        "Company Name": "AMES NATIONAL CORPORATION",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Business Combination:",
        "match": "In response to the COVID-19 pandemic, the CARES Act was signed into law on March 27, 2020 to provide national emergency economic relief measures. The Coronavirus Response and Relief Supplemental Appropriations Act of 2021 (“CRRSAA”) was signed into law on December 27, 2020 to supplement and expand the CARES Act. Many of the CARES Act’s programs are dependent upon the direct involvement of U.S. financial institutions, such as the Company and the Banks, and have been implemented through rules and guidance adopted by federal departments and agencies, including the U.S. Department of Treasury, the Federal Reserve and other federal banking agencies, including those with direct supervisory jurisdiction over the Company and the Banks. Furthermore, as the on-going COVID-19 pandemic evolves, federal regulatory authorities continue to issue additional guidance with respect to the implementation, lifecycle, and eligibility requirements for the various CARES Act programs as well as industry-specific recovery procedures for COVID-19. In addition, it is possible that Congress will enact supplementary COVID-19 response legislation, including amendments to the CARES Act or new bills comparable in scope to the CARES Act. The Company continues to assess the impact of the CARES Act, CRRSA and other statues, regulations and supervisory guidance related to the COVID-19 pandemic.",
        "after": "Fair value of federal funds sold acquired"
    },
    "1270": {
        "CIK": "0001157762",
        "Company Name": "APPLIED OPTOELECTRONICS, INC.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Filing Date ",
        "match": "This Annual Report on Form 10-K (\"Form 10-K\") contains forward-looking statements that are based on our management’s beliefs and assumptions and on information currently available to our management, including statements appearing under the heading, “Management’s Discussion and Analysis of Financial Condition and Results of Operations”. The statements contained in this Form 10-K that are not purely historical are forward-looking statements within the meaning of the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933, as amended, or the Securities Act, and Section 21E of the Securities Exchange Act of 1934, as amended, or the Exchange Act. In some cases, you can identify forward-looking statements by terminology such as ‘‘may,’’ ‘‘will,’’ ‘‘should,’’ ‘‘expects,’’ ‘‘plans,’’ ‘‘anticipates,’’ ‘‘believes,’’ ‘‘estimates,” “strategy,” “future,” “likely,” or “would” or by other similar expressions that convey uncertainty of future events or outcomes.  These forward-looking statements involve risks and uncertainties, as well as assumptions and current expectations, which could cause the Company’s actual results to differ materially from those anticipated in such forward-looking statements. These risks and uncertainties include but are not limited to: statements about reduction in the size or quantity of customer orders; change in demand for the company’s products due to industry conditions; our ability to maintain sufficient liquidity; changes in manufacturing operations; volatility in manufacturing costs; delays in shipments of products; disruptions in the supply chain; change in the rate of design wins or the rate of customer acceptance of new products; the company’s reliance on a small number of customers for a substantial portion of its revenues; pricing pressure; a decline in demand for our customers’ products or their rate of deployment of their products; general conditions in the internet data center, cable television or CATV, telecommunications or telecom and fiber-to-the-home or FTTH; changes in the world economy (particularly in the United States and China); the negative effects of seasonality; the anticipated impact to our business operations, customer demand and supply chain due to the recent global pandemic of a novel strain of the coronavirus (COVID-19); realization of deferred tax assets; and other risks and uncertainties described more fully under the heading “Risk Factors” in this Form 10-K and those discussed in the Company’s other documents filed with or furnished to the Securities and Exchange Commission. You should not rely on forward-looking statements as predictions of future events. All forward-looking statements in this Form 10-K are based upon information available to us as of the date hereof, and qualified in their entirety by this cautionary statement. Except as required by law, we assume no obligation to update forward-looking statements for any reason after the date of this report to conform these statements to actual results or to changes in the company’s expectations.",
        "after": "August 13, 2013"
    },
    "1274": {
        "CIK": "0001158463",
        "Company Name": "LEMAITRE VASCULAR INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "(3)         Exhibits",
        "match": "Since March 2020, the COVID-19 pandemic has significantly impacted the markets into which we sell devices, our sales and our operations. In response to COVID-19, many hospitals have limited elective procedures, and many of our devices are used in elective procedures. Additionally, our sales representatives’ access to hospitals and surgeons has been restricted by hospitals or local governments. In areas where the COVID-19 pandemic has materially abated, we have begun to see restrictions eased. During 2020, these dynamics resulted in, and we expect will continue to result in, variable sales. In response to the COVID-19 pandemic, we have modified our manufacturing operations in order to adhere to social distancing requirements dictated by local law. In Q2 2020 we also undertook measures to reduce our operating costs, including temporary base salary cuts and a reduction in force of approximately 13% of our full-time employees. However, as sales have normalized, we have been rehiring personnel in many areas. We ended our temporary base salary cuts on August 31, 2020.",
        "after": "10.7"
    },
    "1280": {
        "CIK": "0001160791",
        "Company Name": "INPHI CORP",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Issuance of common stock from exercise of stock options",
        "match": "NOTE REGARDING COVID-19",
        "after": "Other liabilities"
    },
    "1286": {
        "CIK": "0001162194",
        "Company Name": "CUTERA INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Current liabilities:",
        "match": "● Juliet – In December 2017, the Company introduced the Juliet laser for women’s intimate health. Juliet is a versatile multi-application platform utilizing an Er:YAG laser with the 2940 nm wavelength. This Erbium wavelength produces noticeable results due to its high peak absorption in water. Additionally, Juliet’s Erbium technology allows for a controlled thermal delivery to tissue, keeping the procedure safe for patients while minimizing downtime. Juliet delivers two passes of energy to the target area during treatment. The first pass uses ablation to vaporize the tissue and create micro-channels of injury. The second pass uses coagulation to deliver a thermal injury to the area, which further stimulates the body's normal wound healing process, revitalizing, and remodeling damaged tissue and introducing the formation of new blood vessels. Juliet also has a disposable tip, which must be changed for every procedure. As a result, the replacement of the tips results in recurring revenue. The Company is the distributor of Juliet. All regulatory activities are managed by Asclepion laser technologies gmbh, the legal manufacturer. During the quarter ended June 30, 2020, the Company wrote-off $0.8 million of inventory on hand related to its Juliet platform due to declining sales. Sales related to Juliet have been declining due to the COVID-19 pandemic and the FDA letter issued on July 30, 2018 expressing concerns regarding “vaginal rejuvenation” procedures using energy-based devices.",
        "after": "Responding to actions by activist shareholders could be costly and time-consuming, disrupt the Company's operations and divert the attention of management and its employees. Additionally, perceived uncertainties as to the Company's future direction as a result of shareholder activism or changes to the composition of its board of directors may lead to the perception of a change in the direction of its business or other instability, which may be exploited by its competitors, cause concern to the Company's current or potential customers, and make it more difficult to attract and retain qualified personnel. If customers choose to delay, defer or reduce transactions with the Company or do business with its competitors instead of the Company, then the Company's business, financial condition and operating results would be adversely affected. In addition, the share price of its common stock and the trading price of the notes could experience periods of increased volatility as a result of shareholder activism."
    },
    "1290": {
        "CIK": "0001166928",
        "Company Name": "RIOT BLOCKCHAIN, INC.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Balance at December 31, 2019",
        "match": "The COVID-19 global coronavirus pandemic has had far-reaching and adverse effects on the global supply chain that could affect the price, availability and delivery schedule for new miners. ",
        "after": "10,251 "
    },
    "1292": {
        "CIK": "0001168054",
        "Company Name": "Plumas Bancorp",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Weighted average interest rate at year-end",
        "match": "The effects of the COVID-19 pandemic, including government responses to the pandemic.",
        "after": "Substandard – A substandard loan is not adequately protected by the current sound worth and paying capacity of the borrower or the value of the collateral pledged, if any. Loans classified as substandard have a well-defined weakness or weaknesses that jeopardize the liquidation of the debt. Well defined weaknesses include a project's lack of marketability, inadequate cash flow or collateral support, failure to complete construction on time or the project's failure to fulfill economic expectations. They are characterized by the distinct possibility that the Company will sustain some loss if the deficiencies are not corrected."
    },
    "1302": {
        "CIK": "0001172631",
        "Company Name": "NOVAGOLD RESOURCES INC ",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "The following summarizes certain Canadian federal income tax consequences generally applicable under the Income Tax Act (Canada) and the regulations enacted thereunder (collectively, the “Canadian Tax Act”) and the Canada-United States Income Tax Convention (1980) (the “Convention”) to the holding and disposition of common shares.",
        "match": "risks related to the coronavirus global health pandemic (COVID-19);",
        "after": "The accompanying notes are an integral part of these consolidated financial statements."
    },
    "1304": {
        "CIK": "0001173420",
        "Company Name": "CEVA INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Revaluation of investment in non-marketable equity securities",
        "match": "Our expectations regarding the impact of COVID-19 on our business, operations, customers and the economy; and",
        "after": "Purchase of property and equipment"
    },
    "1338": {
        "CIK": "0001213660",
        "Company Name": "DYADIC INTERNATIONAL INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "During 2020, the Company entered into a feasibility study with the University of Oslo for a potential influenza vaccine.",
        "match": "Information (other than historical facts) set forth in this Annual Report contains forward-looking statements within the meaning of the Federal securities laws, which involve many risks and uncertainties that could cause our actual results to differ materially from those reflected in the forward-looking statements. Forward-looking statements generally can be identified by use of the words “expect,” “should,” “intend,” “anticipate,” “will,” “project,” “may,” “might,” “potential,” or “continue” and other similar terms or variations of them or similar terminology. Such forward-looking statements are included under Item 7 “Management’s Discussion and Analysis”. Dyadic International, Inc., and its subsidiaries cautions readers that any forward-looking information is not a guarantee of future performance and that actual results could differ materially from those contained in the forward-looking information. Such statements reflect the current views of our management with respect to our operations, results of operations and future financial performance. Forward-looking statements involve many risks, uncertainties or other factors within and/or beyond Dyadic’s control. These factors include, but are not limited to, (1) general economic, political and market conditions; (2) our ability to generate the required productivity, stability, purity, performance, cost, safety and other data necessary to carry out and implement our biopharmaceutical research and business plans and strategic initiatives; (3) our ability to retain and attract employees, consultants, directors and advisors; (4) our ability to implement and successfully carry out Dyadic’s and third parties’ research and development efforts; (5) our ability to obtain new license and research agreements; (6) our ability to maintain our existing access to, and/or expand access to third party contract research organizations in order to carry out our research projects for ourselves and third parties; (7) competitive pressures and reliance on our key customers and collaborators; (8) the pharmaceutical and biotech industry, governmental regulatory and other agencies’ willingness to adopt, utilize and approve the use of the C1 gene expression platform; (9) the risk of theft, misappropriation or expiration of owned or licensed proprietary and intellectual property, genetic and biological materials owned by us and/or Danisco US, Inc. and VTT Technical Research Centre of Finland Ltd; (10) speculative nature and illiquidity of equity securities received as consideration from sub-licenses; (11) our expectations concerning the impact of the novel coronavirus identified as “COVID-19” on our business and operating results; and (12) other factors discussed in Dyadic’s publicly available filings, including information set forth under the caption “Risk Factors” in this Annual Report. We caution you that the foregoing list of important factors is not exclusive. The forward-looking statements are based on our beliefs, assumptions and expectations of future performance, considering the information currently available to us. These statements are only predictions based upon our current expectations and projections about future events. There are important factors that could cause our actual results, level of activity, performance or achievements to differ materially from the results, level of activity, performance or achievements expressed or implied by the forward-looking statements. Moreover, we operate in a highly regulated, competitive and rapidly changing environment. Our competitors have far greater resources, infrastructure and market presence than we do which makes it difficult for us to enter certain markets, and/or to gain or maintain customers. New risks emerge from time to time and it is not possible for our management to predict all risks, nor can we assess the impact of all factors on our business or the extent to which any factor, or combination of factors, may cause actual results to differ materially from those contained in any forward-looking statements we may make. Before investing in our common stock, investors should carefully read the information set forth under the caption “Risk Factors” and elsewhere in this Annual Report which could have a material adverse effect on our business, results of operations and financial condition.",
        "after": "Note 7:     Shareholders’ Equity"
    },
    "1400": {
        "CIK": "0001280263",
        "Company Name": "MONOLITHIC POWER SYSTEMS INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "For the year ended December 31, 2020, net cash used in investing activities was $39.2 million, primarily due to purchases of property and equipment of $55.6 million, partially offset by net sales and maturities of short-term investments of $22.1 million. For the year ended December 31, 2019, net cash used in investing activities was $167.1 million, primarily due to purchases of property and equipment of $95.8 million, net purchases of short-term investments of $76.8 million and net contributions to the deferred compensation plan of $3.1 million. These cash outflows were partially offset by proceeds from sales of property and equipment of $9.3 million.",
        "match": "the effects of the COVID-19 pandemic on the global economy, the semiconductor industry and our business;",
        "after": "The Company’s level 3 assets consist of government-backed student loan auction-rate securities. The following table provides a rollforward of the fair value of the auction-rate securities (in thousands): "
    },
    "1416": {
        "CIK": "0001288359",
        "Company Name": "W&T OFFSHORE INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "March 4, 2021",
        "match": "COVID-19 Impacts on Economic Environment.  Due to circumstances related to the outbreak of COVID-19, various measures have been taken by federal, state and local governments to reduce the rate of spread of COVID-19.  These measures and other factors have resulted in a decrease of general economic activity and a corresponding decrease in global and domestic energy demand impacting commodity pricing.  In addition, actions by the Organization of Petroleum Exporting Countries and other high oil exporting countries like Russia (“OPEC+”) negatively impacted crude oil prices during early 2020.  These rapid and unprecedented events pushed crude oil storage near capacity and drove prices down significantly in the second quarter of 2020.  These events were the primary cause of the significant supply-and-demand imbalance for oil, significantly lowering oil pricing in 2020 compared to the prior year.  Throughout the United States during 2020, COVID-19 outbreaks continued and, in some areas, increased.  Should these conditions continue in future periods, they could constrain our ability to store and move production to downstream markets, delay or curtail development activity or temporarily shut-in production, any or all of which could further reduce our cash flow.",
        "after": "(1)"
    },
    "1432": {
        "CIK": "0001296435",
        "Company Name": "ORMAT TECHNOLOGIES, INC.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Loan",
        "match": "The global spread of a public health crisis, including the COVID-19 pandemic may have an adverse impact on our business.",
        "after": "The COVID-19 pandemic and efforts to control its spread have significantly curtailed the movement of people, goods and services worldwide. Governments around the world have ordered companies to limit or suspend non-essential operations and imposed operational and travel restrictions resulting in a decline in global economic activity and an increase in market volatility. We have implemented significant measures both to comply with government requirements and to preserve the health and safety of our employees. These measures include working remotely where possible and operating separate shifts in our power plants, manufacturing facilities and other locations while trying to continue operations as close to full capacity in all locations."
    },
    "1450": {
        "CIK": "0001303313",
        "Company Name": "BankFinancial CORP",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "At December 31, 2020, we had the capacity to borrow an additional $315.6 million under our credit facilities with the FHLB. Furthermore, we had unpledged securities that could be used to support in excess of $7.5 million of additional FHLB borrowings.",
        "match": "Factors that could cause actual results to differ materially from the results anticipated or projected and which could materially and adversely affect our operating results, financial condition or future prospects include, but are not limited to: (i) less than anticipated loan and lease growth due to intense competition for loans and leases, particularly in terms of pricing and credit underwriting; or a dearth of borrowers who meet our underwriting standards, or the coronavirus disease 2019 (\"COVID-19\") pandemic and the related adverse local and national economic consequences; (ii) the impact of re-pricing and competitors’ pricing initiatives on loan and deposit products; (iii) interest rate movements and their impact on the economy, customer behavior and our net interest margin; (iv) adverse economic conditions in general, or specific events such as the COVID-19 pandemic or terrorism, and in the markets in which we lend that could result in increased delinquencies in our loan portfolio or a decline in the value of our investment securities and the collateral for our loans; (v) declines in real estate values that adversely impact the value of our loan collateral, other real estate owned (\"OREO\"), asset dispositions and the level of borrower equity in their investments; (vi) borrowers that experience legal or financial difficulties that we do not currently foresee; (vii) results of supervisory monitoring or examinations by regulatory authorities, including the possibility that a regulatory authority could, among other things, require us to increase our allowance for loan losses or adversely change our loan classifications, write-down assets, reduce credit concentrations or maintain specific capital levels; (viii) changes, disruptions or illiquidity in national or global financial markets; (ix) the credit risks of lending activities, including risks that could cause changes in the level and direction of loan delinquencies and charge-offs or changes in estimates relating to the computation of our allowance for loan losses; (x) monetary and fiscal policies of the U.S. Government, including policies of the U.S. Treasury and the Federal Reserve Board; (xi) factors affecting our ability to access deposits or cost-effective funding, and the impact of competitors' pricing initiatives on our deposit products; (xii) legislative or regulatory changes that have an adverse impact on our products, services, operations and operating expenses; (xiii) higher federal deposit insurance premiums; (xiv) higher than expected overhead, infrastructure and compliance costs; (xv) changes in accounting principles, policies or guidelines; (xvi) the effects of any federal government shutdown; and (xvii) privacy and cybersecurity risks, including the risks of business interruption and the compromise of confidential customer information resulting from intrusions.",
        "after": "BANKFINANCIAL CORPORATION"
    },
    "1456": {
        "CIK": "0001307579",
        "Company Name": "Huntsman Corporation",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Advanced",
        "match": "With respect to Huntsman Corporation, certain information set forth in this report contains “forward-looking statements” within the meaning the Private Securities Litigation Reform Act of 1995, Section 27A of the Securities Act of 1933 and Section 21E of the Securities Exchange Act of 1934. All statements other than historical factual information are forward-looking statements, including without limitation statements regarding: projections of revenue, expenses, profit, profit margins, tax rates, tax provisions, cash flows, pension and benefit obligations and funding requirements, our liquidity position or other projected financial measures; projected impact of COVID-19 on our operations and future financial results; management’s plans and strategies for future operations, including statements relating to anticipated operating performance, cost reductions, restructuring activities, new product and service developments, competitive strengths or market position, acquisitions, divestitures, spin-offs or other distributions, strategic opportunities, securities offerings, stock repurchases, dividends and executive compensation; growth, declines and other trends in markets we sell into; new or modified laws, regulations and accounting pronouncements; outstanding claims, legal proceedings, tax audits and assessments and other contingent liabilities; foreign currency exchange rates and fluctuations in those rates; general economic and capital markets conditions; the timing of any of the foregoing; assumptions underlying any of the foregoing; and any other statements that address events or developments that we intend or believe will or may occur in the future. In some cases, forward-looking statements can be identified by terminology such as “believes,” “expects,” “may,” “will,” “should,” “anticipates” or “intends” or the negative of such terms or other comparable terminology, or by discussions of strategy. We may also make additional forward-looking statements from time to time. All such subsequent forward-looking statements, whether written or oral, by us or on our behalf, are also expressly qualified by these cautionary statements.",
        "after": "By:"
    },
    "1526": {
        "CIK": "0001337013",
        "Company Name": "FUTUREFUEL CORP.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Denver, Colorado",
        "match": "With respect to our biofuels segment, our plant has a demonstrated capacity near 59 MMgy (million gallons per year) with production of 58 MMgy during 2020 with the reinstatement of the blenders’ tax credit (“BTC”), which strengthened a COVID-19 weakened market for renewable fuel volumes and resulting price declines. In late December 2019, the BTC was retroactively reinstated from its expiry on January 1, 2018 through December 31, 2022. The future production of biodiesel is uncertain and will depend on various factors including: (i) changes in feedstock prices relative to biodiesel prices; (ii) competition from alternative products, such as renewable diesel; (iii) whether government mandates with respect to biodiesel usage remain in effect; (iv) whether certain tax credits with respect to biodiesel production remain in effect; and (v) competitiveness and availability of foreign imports. See the discussion below, including “Risk Factors” beginning at page 15 below.  ",
        "after": "19)"
    },
    "1566": {
        "CIK": "0001358190",
        "Company Name": "LIMESTONE BANCORP, INC.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Junior subordinated debentures",
        "match": "the impact and duration of the novel coronavirus disease 2019 (“COVID-19”) pandemic and national, state and local emergency conditions the pandemic has produced;",
        "after": "Other Real Estate Owned (“OREO”) – Assets acquired through or instead of loan foreclosure are initially recorded at fair value less estimated costs to sell when acquired, establishing a new cost basis. These assets are subsequently accounted for at the lower of cost or fair value, less estimated costs to sell. If fair value declines subsequent to foreclosure, a write-down is recorded through expense. Costs after acquisition are expensed unless the expenditure is for a recoverable improvement, which  may be capitalized."
    },
    "1706": {
        "CIK": "0001419600",
        "Company Name": "SOLAREDGE TECHNOLOGIES, INC",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": " A summary of the activity in the stock options granted to employees and members of the board of directors for the year ended December 31, 2020 and related information are as follows: ",
        "match": "the duration, scope and effects of the ongoing COVID-19 pandemic and government and other third party responses to it and the related macroeconomic effects, including to our business and the business of our suppliers and customers; ",
        "after": "(11,058 "
    },
    "1734": {
        "CIK": "0001430306",
        "Company Name": "ServisFirst Bancshares, Inc.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Other mortgage",
        "match": "the global health and economic crisis precipitated by the COVID-19 outbreak;",
        "after": "Credit card rewards program membership fees – represent memberships in our credit card rewards program and are paid annually by our cardholders at the time they open an account and on each anniversary. Revenue is recognized ratably over the membership period."
    },
    "1736": {
        "CIK": "0001430723",
        "Company Name": "Oak Valley Bancorp",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "(Dollars in thousands)",
        "match": "We have based these forward-looking statements on our current expectations and projections about future events and trends. These forward-looking statements are subject to a number of risks, uncertainties and assumptions that are difficult to predict, including the impact of the coronavirus (COVID-19) pandemic on our business, results of operations and financial condition and our and the U.S. government’s response to it, and including those listed in this “Special Note Regarding Forward-Looking Statements,” and those described in Part II, Item 7 “Management’s Discussion and Analysis of Financial Condition and Results of Operations.” Moreover, we operate in a very competitive and rapidly changing environment, and new risks emerge from time to time. It is not possible for our management to predict all risks, nor can we assess the impact of all factors on our business or the extent to which any factor, or combination of factors, may cause actual results to differ materially from those contained in any forward-looking statements we may make. In light of these risks, uncertainties, and assumptions, the forward-looking events and circumstances discussed in this Annual Report may not occur and actual results could differ materially and adversely from those anticipated or implied in the forward-looking statements.",
        "after": "Non-Accrual and Past Due Loans. Loans are considered past due if the required principal and interest payments have not been received as of the date such payments were due. Loans are placed on non-accrual status when, in management’s opinion, the borrower  may be unable to meet payment obligations as they become due, as well as when required by regulatory provisions. Loans  may be placed on non-accrual status regardless of whether or not such loans are considered past due. When interest accrual is discontinued, all unpaid accrued interest is reversed. Interest income is subsequently recognized only to the extent cash payments are received in excess of principal due. Loans are returned to accrual status when all the principal and interest amounts contractually due are brought current and future payments are reasonably assured."
    },
    "1760": {
        "CIK": "0001441816",
        "Company Name": "Verisk Analytics, Inc.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "We invoice our customers in annual, quarterly, or monthly installments. Amounts billed and collected in advance are recorded as deferred revenues on the balance sheet and are recognized as the services are performed and revenue recognition criteria are met.",
        "match": "You should carefully consider the following risks and all of the other information set forth in this annual report on Form 10-K before deciding to invest in any of our securities. If any of the following risks actually occurs, our business, financial condition or results of operations would likely suffer. In such case, the trading price of our securities, including our common stock, could decline due to any of these risks, and you may lose all or part of your investment. In addition to the effects of the COVID-19 pandemic and resulting global disruptions on our business and operations discussed in Item 7 of Part II, \"Management's Discussion Analysis of Financial Condition and Results of Operations,\" and in the risk factors below, additional or unforeseen effects from the COVID-19 pandemic and the global economic climate may give rise to or amplify many of the risks discussed below.",
        "after": "3.2"
    },
    "1822": {
        "CIK": "0001478320",
        "Company Name": "Eagle Bancorp Montana, Inc.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Commercial real estate",
        "match": "statements regarding the current global COVID-19 pandemic;",
        "after": "2020"
    },
    "1852": {
        "CIK": "0001494319",
        "Company Name": "BOSTON OMAHA Corp ",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "changes in claims handling procedures",
        "match": "This Report contains certain statements that are, or may be deemed to be, “forward-looking statements” within the meaning of Section 27A of the Securities Act of 1933, as amended, and Section 21E of the Securities Exchange Act of 1934, as amended (the “Exchange Act”), or by Public Law 104-67. All statements included in this Report, other than statements that relate solely to historical fact, are “forward-looking statements.” Such statements include, but are not limited to, any statement that may predict, forecast, indicate or imply future results, performance, achievements or events, including the impact of the COVID-19 pandemic, or any statement that may relate to strategies, plans or objectives for, or potential results of, future operations, financial results, financial condition, business prospects, growth strategy or liquidity, and are based upon management’s current plans and beliefs or current estimates of future results or trends. Forward-looking statements can generally be identified by phrases such as “believes,” “expects,” “potential,” “continues,” “may,” “should,” “seeks,” “predicts,” “anticipates,” “intends,” “projects,” “estimates,” “plans,” “could,” “designed,” “should be” and other similar expressions that denote expectations of future or conditional events rather than statements of fact.",
        "after": "Thereafter"
    },
    "1864": {
        "CIK": "0001498828",
        "Company Name": "RBB Bancorp",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Total securities, available for sale, at fair value",
        "match": "severe weather, natural disasters, acts of war or terrorism, public health issues (including novel coronavirus, or COVID-19), or other adverse external events could harm our business;",
        "after": "The loan portfolio of PGBH was recorded at fair value at the date of acquisition with the assistance of a third-party valuation. A valuation of PGBH’s loan portfolio was performed as of the acquisition date to assess the fair value of the loan portfolio. The loan portfolio was segmented into two groups; loans with credit deterioration, of which there were none, and loans without credit deterioration, and then split further by loan type. The fair value was calculated on an individual loan basis using a discounted cash flow analysis. The discount rate utilized was based on a weighted average cost of capital, considering the cost of equity and cost of debt. Also factored into the fair value estimates were loss rates, recovery period and prepayment rates based on industry standards."
    },
    "1882": {
        "CIK": "0001511337",
        "Company Name": "LINDBLAD EXPEDITIONS HOLDINGS, INC.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "Our debt could adversely affect our financial health and operating flexibility.",
        "match": "suspended operations and disruptions to our business and operations related to COVID-19;",
        "after": "Level 1"
    },
    "1916": {
        "CIK": "0001528129",
        "Company Name": "Genie Energy Ltd.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": " 266,490 ",
        "match": "CORONAVIRUS DISEASE (COVID-19)  ",
        "after": " 2019 "
    },
    "1958": {
        "CIK": "0001556593",
        "Company Name": "First Northwest Bancorp",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "In addition, if charge-offs in future periods exceed the allowance for loan losses we will need additional provisions to replenish the allowance for loan losses. Any additional provisions will result in a decrease in net income, and possibly capital, and may have a material adverse effect on our financial condition and results of operations.",
        "match": "Further, statements about the potential effects of the COVID-19 pandemic on the Bank’s businesses and financial results and condition may constitute forward-looking statements and are subject to the risk that the actual effects may differ, possibly materially, from what is reflected in those forward-looking statements due to factors and future developments that are uncertain, unpredictable and in many cases beyond the Bank’s control, including the scope and duration of the pandemic, actions taken by governmental authorities in response to the pandemic, and the direct and indirect impact of the pandemic on the Bank, its customers and third parties. These developments could have an adverse impact on our financial position and our results of operations.",
        "after": "Weighted- Average Interest Rate"
    },
    "1966": {
        "CIK": "0001560241",
        "Company Name": "electroCore, Inc.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "We are initially focused on neurology and our therapy, gammaCore, is cleared by the FDA for use by adults for the following four neurological indications: the acute treatment of pain associated with each of migraine headache and episodic cluster headache, or eCH, the preventive treatment of migraine headache and adjunctive use for the preventive treatment of cluster headache, or CH. In February 2021, gammaCore was cleared by the FDA for the acute and preventive treatment of migraine in adolescents between 12 and 17 years of age.",
        "match": "In July 2020, the FDA granted us an EUA authorizing the use of the Company's gammaCore Sapphire CV nVNS therapy at home or in a healthcare setting to acutely treat adult patients with known or suspected COVID-19 who are experiencing exacerbation of asthma-related dyspnea and reduced airflow, and for whom approved drug therapies are not tolerated or provided insufficient symptom relief.",
        "after": "We are also considering several additional indications for our nVNS technology which are being studied in a number of investigator-initiated trials, or IITs. These indications include secondary headache, COVID-19 respiratory symptoms, stroke, post-traumatic headache, mild traumatic brain injury, post-traumatic stress disorder, opioid use disorders and post-operative ileus."
    },
    "2046": {
        "CIK": "0001593538",
        "Company Name": "PLAYAGS, INC. ",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "our failure to meet revenue or earnings estimates made by research analysts or other investors;",
        "match": "Product supply. We obtain most of the parts for our products from outside suppliers, including both off-the-shelf items as well as components manufactured to our specifications. We also manufacture parts in-house that are used for product assembly and for servicing existing products. We generally perform warehousing, quality control, final assembly and shipping from our facilities in Atlanta, Mexico City and Oklahoma City, although small inventories are maintained and repairs are performed by our field service employees. We believe that our sources of supply for components and raw materials are adequate and that alternative sources of materials are available. These sources may be affected by adverse global factors such as the COVID-19 pandemic.",
        "after": "Revenue:"
    },
    "2134": {
        "CIK": "0001623925",
        "Company Name": "Business First Bancshares, Inc.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "6/30/2019",
        "match": "the effects of the ongoing COVID-19 pandemic, including, among other effects: the impact of the public health crisis; the extent and duration of closures of businesses, including our branches, vendors and customers; the operation of financial markets; employment levels; market liquidity; the impact of various actions taken in response by the United States (“U.S.”) federal government, the Board of Governors of the Federal Reserve System, or the Federal Reserve (the \"Federal Reserve\"), other banking regulators, state and local governments; the adequacy of our allowance for loan losses in relation to potential losses in our loan portfolio; and the impact that all of these factors have on our borrowers, other customers, vendors and counterparties;",
        "after": "The following is a summary of the Company’s (consolidated) and the Bank’s actual capital amounts and ratios at  December 31, 2020 and 2019. "
    },
    "2294": {
        "CIK": "0001681087",
        "Company Name": "NI HOLDINGS, INC.",
        "Item": "Entire Document",
        "Primary Word": "COVID-19",
        "before": "We offer comprehensive compensation and benefits packages to our employees including a 401k Plan, employee stock ownership plan, healthcare and insurance benefits, health savings and flexible spending accounts, paid time off, and flexible work arrangements. We also offer stock-based compensation to certain management personnel as a way to attract and retain key talent. See Notes 14 and 20 to the Consolidated Financial Statements included under Item 8 for further discussion of our benefit plans and stock-based compensation. ",
        "match": "In response to the COVID-19 pandemic in March 2020, we pivoted to a remote working environment for substantially all of our employees with a commitment to the safety of our employees, business partners, and the communities we serve. As appropriate, certain of our offices have opened on an optional and limited basis in accordance with applicable rules and regulations in their respective jurisdictions. We believe that we have adjusted well to date, benefitting from prior investments in technology, systems, and training, which have enabled us to maintain full, continuous operations through the pandemic. ",
        "after": "As of December 31, 2020, NI Holdings and its subsidiaries had 205 total employees. Employee turnover averaged 17.3% during 2020, with higher than average rates experienced by our Direct Auto employee base located in Chicago. None of our employees are covered by a collective bargaining agreement, and we believe that our employee relations are good. "
    }
}